[
  {
    "site": "LinkedIN",
    "title": "Web Developer",
    "companyName": "Brilliance UAE",
    "location": "Indore, Madhya Pradesh, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  The ideal candidate is a creative problem solver who will work in coordination with cross-functional teams to design, develop, and maintain our next generation websites and web tools. You must be comfortable working as part of a team while taking the initiative to take lead on new innovations and projects.  ResponsibilitiesRevise, edit, proofread & optimize web contentWork with cross-functionally to enhance overall user experience of our platformsOwn various design tasks involved in the web development life cycle from start to finish\nQualificationsBachelor's degree or equivalent experience in Computer ScienceAt least 0 - 2 years' of experience using HTML, CSS, and JavaScriptProficiency in at least one server-side technology (Java, PHP, NodeJS, Python, Ruby)Ability to multi-task, organize, and prioritize work",
    "link": "https://www.linkedin.com/jobs/view/3538710608/?eBP=CwEAAAGHG0v9zumfliTZyHzAJBUqbCV2_86Ev-fj3uIZr7A8R3u2UhODaPAFDoI6FYNAa0AyR-g1ICENg1Ifrn6k-ulhzSDHFW8DNVxwmw2RrcE0iLY1pwlYlfHD-RLlYiQ3eOFfLaKeiwYvJwKPvFZWHTiyug_WMlVMvPLro79__4F8CJYxuD1K7ruGVt7HedktBsffA4VXudkDifv-IXwfftu4Rnzhbz_mQqr-GWYporTEuOkfSoyTo7p3pN5U2_gLZb2Jj1s3K67Bd2qFDGYGW0qN9D3kI1c3zuOYQ4IVAxWbZti2l3VIPpsJDG_2TFgp_CWn0KoICBOWMqTqM7xrMCshmzm1rMsLY7dd5-KZ5wpIG6TtobNftF6RRmUV3HyXd7hiSTJOWWDOqTiR0GZtgIf8oVR2GA&refId=FWUPmjjxlmOUmYmeVKpcfw%3D%3D&trackingId=kZV3uw8cRw77hE%2B8Z42o9g%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Web Developer in Chennai",
    "companyName": "Brilliance UAE",
    "location": "Chennai, Tamil Nadu, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  The ideal candidate is a creative problem solver who will work in coordination with cross-functional teams to design, develop, and maintain our next generation websites and web tools. You must be comfortable working as part of a team while taking the initiative to take lead on new innovations and projects.  ResponsibilitiesRevise, edit, proofread & optimize web content Work with cross-functionally to enhance overall user experience of our platforms Own various design tasks involved in the web development life cycle from start to finish\nQualificationsBachelor's degree or equivalent experience in Computer Science At least 1 - 2 years' of experience using HTML, CSS, and JavaScript Proficiency in at least one server-side technology (Java, PHP, NodeJS, Python, Ruby) Ability to multi-task, organize, and prioritize work",
    "link": "https://www.linkedin.com/jobs/view/3538710608/?eBP=CwEAAAGHG0v9zumfliTZyHzAJBUqbCV2_86Ev-fj3uIZr7A8R3u2UhODaPAFDoI6FYNAa0AyR-g1ICENg1Ifrn6k-ulhzSDHFW8DNVxwmw2RrcE0iLY1pwlYlfHD-RLlYiQ3eOFfLaKeiwYvJwKPvFZWHTiyug_WMlVMvPLro79__4F8CJYxuD1K7ruGVt7HedktBsffA4VXudkDifv-IXwfftu4Rnzhbz_mQqr-GWYporTEuOkfSoyTo7p3pN5U2_gLZb2Jj1s3K67Bd2qFDGYGW0qN9D3kI1c3zuOYQ4IVAxWbZti2l3VIPpsJDG_2TFgp_CWn0KoICBOWMqTqM7xrMCshmzm1rMsLY7dd5-KZ5wpIG6TtobNftF6RRmUV3HyXd7hiSTJOWWDOqTiR0GZtgIf8oVR2GA&refId=FWUPmjjxlmOUmYmeVKpcfw%3D%3D&trackingId=kZV3uw8cRw77hE%2B8Z42o9g%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer (Entry Level)",
    "companyName": "MRI Software",
    "location": "Bangalore Rural, Karnataka, India, ",
    "description": "About the job\n        \n\n\n        \n                  We are currently seeking a Junior Software Engineer to work within our global Product Development department working to apply defined software development life cycle processes to deliver production ready code of the highest quality, this individual will be diligent in testing their code and working with the team to produce\nMRI Software’s high standard product. This individual will work under the Agile development methodology in a cross-functional environment with other groups, both inside and outside the department including Product Management and Documentation, as well as create and test code in our dynamic team setting\nResponsibilities\nApplies defined practices and procedures to design, implement, and support software projectsBuilds effective working relationships with team membersActively seeks assistance as needed but demonstrates learning and growing independenceActively seeks guidance for prioritization and review of deliverables.Performs and designs testing protocols to ensure that the product is fully tested.\nRequirements\nCurrently pursuing a BE, Btech, MCA, MSC, or BCA Computer Science or related technical field (2022 Passout may also apply)Experience developing software or algorithms based on predetermined specificationsKnowledge of object-oriented programming, Microsoft .Net or Java preferredProficient with Source Control tools Familiarity with database objects (tables, stored procedures, queries, etc.) a plusAttention to detail is a mustGood written and verbal communication skills\nBenefits\nAbility to learn leading technical / industry standards and technologiesFlexible working arrangements (2 days in the office)Annual performance-related bonusHealth insurance6x Flexi Fridays: knock 2.5 hours off your day on a FridayEngaging, fun & inclusive culture: check out the MRI Software APAC Insta feed and stories!\nAbout The Business\nMRI Software is a global Proptech leader delivering innovative applications and hosted solutions that free real estate companies to elevate their business. \nOur flexible technology platform, along with an open and connected ecosystem, allows us to meet the unique needs of real estate businesses, from property-level management and accounting, to investment modeling and analytics for the global commercial and residential markets. With nearly five decades of expertise and insight, we have grown to include offices in across the United States, the United Kingdom, Hong Kong, Singapore, Australia, South Africa, New Zealand, Canada, and India, with over 3000 team members to support our clients and their unique needs!\nMRI is proud to be an Equal Employment Opportunity employer.",
    "link": "https://www.linkedin.com/jobs/view/3538710608/?eBP=CwEAAAGHG0v9zumfliTZyHzAJBUqbCV2_86Ev-fj3uIZr7A8R3u2UhODaPAFDoI6FYNAa0AyR-g1ICENg1Ifrn6k-ulhzSDHFW8DNVxwmw2RrcE0iLY1pwlYlfHD-RLlYiQ3eOFfLaKeiwYvJwKPvFZWHTiyug_WMlVMvPLro79__4F8CJYxuD1K7ruGVt7HedktBsffA4VXudkDifv-IXwfftu4Rnzhbz_mQqr-GWYporTEuOkfSoyTo7p3pN5U2_gLZb2Jj1s3K67Bd2qFDGYGW0qN9D3kI1c3zuOYQ4IVAxWbZti2l3VIPpsJDG_2TFgp_CWn0KoICBOWMqTqM7xrMCshmzm1rMsLY7dd5-KZ5wpIG6TtobNftF6RRmUV3HyXd7hiSTJOWWDOqTiR0GZtgIf8oVR2GA&refId=FWUPmjjxlmOUmYmeVKpcfw%3D%3D&trackingId=kZV3uw8cRw77hE%2B8Z42o9g%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "ACI Worldwide",
    "location": "Bengaluru, Karnataka, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Job Description\n\nJob Summary:\n\nPlans, designs, develops and tests Development Operations automation streams, including continuous integration and delivery. Actively contributes to daily development and delivery business needs and is engaged in the scalability of the business roadmap well as non-functional projects.\n\nJob Responsibilities:\n\n Responsible for designing, developing, testing and delivering high quality Development Operations tools. Researches and resolves customer or development reported problems. Maintains working knowledge of the hardware platform, network and application layers. Manages the dependencies for use in implementing proper solutions. Exhibits good technical and business judgment and thorough understanding of how customers use the product when dealing with product requirements, complex design issues, and tradeoffs. Perform other duties as assigned. Understand and adhere to all corporate policies to include but not limited to the ACI Code of Business Conduct and Ethics.\n\nKnowledge, Skills and Experience required for the job:\n\n Bachelor's degree in computer science or related field or equivalent software development experience. 3 to 5 years Development Operations experience including development/system administration. Strong Technical skills in tools/frameworks: Linux/Unix scripts Jenkins Pipeline Creation Groovy Scripts Ansible Scripts Docker Kubernetes Cluster Terraform Prometheus Grafana ANT Scripts Maven Git Hub/Bit Bucket SVN SSL Certificates Creation Windows Batch commands Experience in working with Cloud Platforms like Azure or AWS Experience in Setting up Application Servers like Tomcat, JBoss, WebSphere Basic knowledge in working with Databases like Oracle DB/PostgreSQL\n\nPreferred Knowledge, Skills and Experience needed for the job:\n\n Experience in working with Java or Python language Experience in Kibana, Elastic Search",
    "link": "https://www.linkedin.com/jobs/view/3538710608/?eBP=CwEAAAGHG0v9zumfliTZyHzAJBUqbCV2_86Ev-fj3uIZr7A8R3u2UhODaPAFDoI6FYNAa0AyR-g1ICENg1Ifrn6k-ulhzSDHFW8DNVxwmw2RrcE0iLY1pwlYlfHD-RLlYiQ3eOFfLaKeiwYvJwKPvFZWHTiyug_WMlVMvPLro79__4F8CJYxuD1K7ruGVt7HedktBsffA4VXudkDifv-IXwfftu4Rnzhbz_mQqr-GWYporTEuOkfSoyTo7p3pN5U2_gLZb2Jj1s3K67Bd2qFDGYGW0qN9D3kI1c3zuOYQ4IVAxWbZti2l3VIPpsJDG_2TFgp_CWn0KoICBOWMqTqM7xrMCshmzm1rMsLY7dd5-KZ5wpIG6TtobNftF6RRmUV3HyXd7hiSTJOWWDOqTiR0GZtgIf8oVR2GA&refId=FWUPmjjxlmOUmYmeVKpcfw%3D%3D&trackingId=kZV3uw8cRw77hE%2B8Z42o9g%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "Nuance Communications",
    "location": "Pune, Maharashtra, India, Remote",
    "description": "About the job\n        \n\n\n        \n                  Job Summary\n\nC++ and C# .Net engineer is responsible for designing and implementing new features along with maintenance of our client and internal facing gRPC web application called Nuance Vocalizer - an advanced, flexible, enterprise‑level Text‑to‑Speech solution that delivers intelligent self‑service for organisations of all sizes and complexities. Clients that use this Vocalizer include Sony, Bank of America, Rakuten and other Fortune 500 companies across the globe.\n\nRoles And Responsibilities\n Design, code, and test application components in the .NET Framework and C# language Design, code, and test application components in C++. Document technical designs and program logic Write complete and detailed unit and integration tests Participate in functional and technical reviews Troubleshoot and resolve application defects Handle multiple responsibilities with rapidly changing priorities and deadlines Work effectively with a distributed team in multiple geographic locations and time zones\nKnowledge, Skills And Qualifications\n Strong knowledge of the C# language and Microsoft .NET Demonstrated object-oriented design experience Familiarity with services and cloud-based architectures Expertise in Microsoft Development tools (Visual Studio, .NET Framework)\nEducation: BS in Computer Science or related discipline\n\nYears of Experience: 2+\n\nRequired Skills\n\n2+ years of experience with Microsoft Visual Studio creating multi-tier applications using C# .Net and C++.\n Experience developing high-performance, multi-threaded, enterprise grade applications Knowledge of UML and the ability to author a detailed design specification Experience in Agile software development process including Scrum Excellent English communication skills (written, oral, listening) Excellent organizational and planning skills Excellent technical, analytical, debugging, and problem-solving skills\nPreferred Skills\n Experience with large distributed systems Experience with cloud-based deployments (Azure a big plus) Database design and programming using SQL Server Experience with JavaScript, jQuery, HTML, and CSS Experience with ASP.NET Core Experience with RESTful APIs and JSON Familiarity with Atlassian toolset (JIRA, Confluence), Git, and Azure DevOps Experience with Speech Recognition Software a plus\nNuance offers a compelling and rewarding work environment. We offer market competitive salaries,\n\nbonus, equity, benefits, meaningful growth and development opportunities and a casual yet technically\n\nchallenging work environment. Join our dynamic, entrepreneurial team and become part of our\n\ncontinuing success.",
    "link": "https://www.linkedin.com/jobs/view/3538710608/?eBP=CwEAAAGHG0v9zumfliTZyHzAJBUqbCV2_86Ev-fj3uIZr7A8R3u2UhODaPAFDoI6FYNAa0AyR-g1ICENg1Ifrn6k-ulhzSDHFW8DNVxwmw2RrcE0iLY1pwlYlfHD-RLlYiQ3eOFfLaKeiwYvJwKPvFZWHTiyug_WMlVMvPLro79__4F8CJYxuD1K7ruGVt7HedktBsffA4VXudkDifv-IXwfftu4Rnzhbz_mQqr-GWYporTEuOkfSoyTo7p3pN5U2_gLZb2Jj1s3K67Bd2qFDGYGW0qN9D3kI1c3zuOYQ4IVAxWbZti2l3VIPpsJDG_2TFgp_CWn0KoICBOWMqTqM7xrMCshmzm1rMsLY7dd5-KZ5wpIG6TtobNftF6RRmUV3HyXd7hiSTJOWWDOqTiR0GZtgIf8oVR2GA&refId=FWUPmjjxlmOUmYmeVKpcfw%3D%3D&trackingId=kZV3uw8cRw77hE%2B8Z42o9g%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "Zuora",
    "location": "Chennai, Tamil Nadu, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  THE TEAM\nThe Digital Experience and Security (DES) team focuses on the entire engagement lifecycle from Zuora prospect to Zuora customer. We build foundational frameworks aimed at providing our customers with a consistent, frictionless and ultimately delightful journey throughout their entire interaction with Zuora.\nFunctional areas of responsibility include Authentication and Data Access Control, Tenant Management (Tenant Lifecycle, Features and Entitlements, Configuration Management), Test Environments, and general Self Service capabilities.\nAs a Software Engineer, you will be working with a group of talented engineers within Zuora’s greater platform organization, on building the foundational infrastructure and functionality that facilitates the entire customer interactions lifecycle with Zuora (Digital Experience).\nThis includes, but is not limited to, authentication systems, audit trails, internal data intensive workflows, tenant management and self service initiatives.\nOur services are built using a modern cloud-based tech stack and run on AWS.\nResponsibilities\nDesigns, develops, ships, and maintains features with guidance from more experienced engineers.Builds highly flexible, foundational services that empower and enable our internal and external customers.Improves the development experience at Zuora by enhancing development tools, test coverage, and/or code structure.\nAbout You\nLove solving hard problems and building solid solutions.Self motivated, takes ownership to drive tasks to completion.Curious and eager to learn, experiment and try new things.Disciplined self-starter, able to be highly productive both working alone and in close collaboration within an agile development team. \nBasic Qualifications\nDegree in Computer Science, Electrical Engineering, or relevant education/experience. Excellent verbal and written English communication.2+ years software development experience specializing in backend, platform, or infrastructure development in Java, C++ or another object oriented language .Strong database knowledge. Knows SQL and NoSQL as well as when to use each.Has designed and built web applications and possesses competence in related concepts like web services, SOA, RPC (REST, gRPC, Thrift) and API design.Good knowledge of common algorithms, data structures and design patterns.\nPreferred Qualifications\nHands-on experience in cloud and devops technologies (Docker, Terraform, AWS) Experience with scalable distributed systems, particularly within a SaaS product.Experience designing and implementing authentication / authorization systemsExperience building systems that rely on data segmentation and advanced data access controlsFamiliarity with web applications and UI concepts like AJAX, SPA, sessions etc.\nAbout Zuora & Our “zeo” Culture\nZuora (NYSE: ZUO) Zuora provides the leading cloud-based subscription management platform that functions as a system of record for subscription businesses across all industries. Powering the Subscription Economy®, the Zuora platform was architected specifically for dynamic, recurring subscription business models and acts as an intelligent subscription management hub that automates and orchestrates the entire subscription order-to-revenue process seamlessly across billing and revenue recognition. Zuora serves more than 1,000 companies around the world, including Box, Ford, Penske Media Corporation, Schneider Electric, Siemens, Xplornet, and Zoom.\nAt Zuora, we have one CEO but every employee is empowered and supported to be the ‘ZEO’ of their own career experience. By embedding inclusion and belonging into our processes, policies and culture, we are building a workplace where our 1,200+ ZEOs across North America, Europe, and APAC can bring all the elements of who they are into their work. In addition to an industry-leading six-month, 100% paid parental leave for all our ZEOs, we also offer programs to support your mental health and give back to our communities along with “career cash” and plenty of learning and development opportunities.\nTo learn more visit www.zuora.com\nZuora is proud to be an Equal Employment Opportunity Employer.\nThink, be and do you! At Zuora, different perspectives, experiences and contributions matter. Everyone counts. Zuora is proud to be an Equal Opportunity Employer committed to creating an inclusive environment for all.\nZuora does not discriminate on the basis of, and considers individuals seeking employment with Zuora without regards to, race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics.\nWe encourage candidates from all backgrounds to apply. Applicants in need of special assistance or accommodation during the interview process or in accessing our website may contact us by sending an email to assistance(at)zuora.com.",
    "link": "https://www.linkedin.com/jobs/view/3538710608/?eBP=CwEAAAGHG0v9zumfliTZyHzAJBUqbCV2_86Ev-fj3uIZr7A8R3u2UhODaPAFDoI6FYNAa0AyR-g1ICENg1Ifrn6k-ulhzSDHFW8DNVxwmw2RrcE0iLY1pwlYlfHD-RLlYiQ3eOFfLaKeiwYvJwKPvFZWHTiyug_WMlVMvPLro79__4F8CJYxuD1K7ruGVt7HedktBsffA4VXudkDifv-IXwfftu4Rnzhbz_mQqr-GWYporTEuOkfSoyTo7p3pN5U2_gLZb2Jj1s3K67Bd2qFDGYGW0qN9D3kI1c3zuOYQ4IVAxWbZti2l3VIPpsJDG_2TFgp_CWn0KoICBOWMqTqM7xrMCshmzm1rMsLY7dd5-KZ5wpIG6TtobNftF6RRmUV3HyXd7hiSTJOWWDOqTiR0GZtgIf8oVR2GA&refId=FWUPmjjxlmOUmYmeVKpcfw%3D%3D&trackingId=kZV3uw8cRw77hE%2B8Z42o9g%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer II",
    "companyName": "TripleLift",
    "location": "Pune, Maharashtra, India, ",
    "description": "About the job\n        \n\n\n        \n                  About TripleLift\n\nTripleLift is the advertising technology company reinventing ad placement at the intersection of creative, media and data. Our marketplace serves the world’s leading brands, publishers, streaming companies and demand-side platforms, executing over 1 trillion ad transactions every month. Customers choose us because of our addressable offerings from native to online video to connected television, innovations that insert brands into content in real-time, and supportive experts dedicated to maximizing partner performance.\n\nPart of the Vista Equity Partners portfolio, TripleLift has appeared on both the Inc. 5000 and Deloitte Technology Fast 500 for five consecutive years, has been named to Business Insider’s list of Hottest Ad Tech Companies for three straight years and was awarded Most Innovative TV Advertising Technology by AdExchanger in 2021. Find out how TripleLift is shaping the future of advertising at triplelift.com.\n\nTeam \n\nThe Connections team is responsible for enabling advertising transactions on our exchange platform- handling billions of ad requests a day and growing- and adapting the engagement bus and impression bus for customer use cases. We drive improvements to performance, scale and features that drive advertiser spend on the TLX platform.\n\nThe Role\n\nTripleLift is seeking an experienced Software Engineer to join our team full time. We are a fast growing startup in the advertising technology sector, trying to tackle some of the most challenging problems facing the industry. As an exchange engineer, you will be responsible for improving our exchange that’s handling billions of ad requests a day and quickly growing, optimizing our real time bidding logic.\n\nResponsibilities\nOwn a mission critical codebase that’s at the heart of TripleLift’s value proposition;Write maintainable and well tested code that will be executed billions of times a day and needs to respond in less than 100ms;Manage and actively monitor the health of our exchange which runs globally across multiple AWS regions and data centers;Research and implement cutting edge technologies that improve the performance of our exchange;Design systems for scale that can handle an order of magnitude growth in traffic;Mentor and coach others on the engineer team around Java and distributed systems best practices.\n\nDesired Skills And Attributes\nExperience in building out high performance APIs and services leveraging Java, experience with Netty and event-driven, non blocking applications is a bonus;Experience working on large scale systems and network heavy systems capable of handling billions of HTTP requests a day;Familiarity with in-memory key value stores such as Memcache, Redis or AerospikeComfortable working with queues or other messaging systems such as RabbitMQ or Apache KafkaComfortable taking ownership of projects and showcasing key accomplishments;Strives for continued learning opportunities to build upon craft;Excellent organizational skills and attention to detail;Ability to work quickly and independently with minimal oversight;Ability to accept feedback and constructive critique positively;Solid understanding of different design patterns and their associated tradeoffs;Extremely strong and demonstrable work ethic.\n\nCore Technologies\nJava 8 & Netty to power our real time bidding ad exchange & large scale APIApache ZooKeeper & Apache Kafka to power our message busMemcached & Aerospike as our high speed datastoresAmazon Web Services, Terraform, & Ansible to manage our deployment and infrastructure\n\nExperience Requirement\n\n3-5 years of relevant development experience.\n\nAwards\n\nWe love celebrating our achievements. They remind us of our contributions making advertising work for everyone, and the TripleLifters who make it all possible. TripleLift is proud to be recognized by Digiday for our best-in-class ad technology, as a Best Workplace for our culture and benefits and among the Best in Business for our innovations and positive impact on the industry by Inc.\n\nTo check out more of our awards and distinctions, please visit https://triplelift.com/ideas/#distinctions\n\nDiversity, Equity, Inclusion and Accessibility at TripleLift \n\nAt TripleLift, we believe in the power of diversity, equity, inclusion and accessibility. Our culture enables individuals to share their uniqueness and contribute as part of a team. With our DE&I initiatives, TripleLift is a place that works for you, and where you can feel a sense of belonging. At TripleLift, we will consider and champion all qualified applicants for employment without regard to race, creed, color, religion, national origin, sex, age, disability, sexual orientation, gender identity, gender expression, genetic predisposition, veteran, marital, or any other status protected by law. TripleLift is proud to be an equal opportunity employer.\n\nTo learn more, please visit https://triplelift.com/diversity-equity-and-inclusion/\n\nPrivacy Policy\n\nPlease see our Privacy Policies on our TripleLift and 1plusX websites.\n\nTripleLift does not accept unsolicited resumes from any type of recruitment search firm. Any resume submitted in the absence of a signed agreement will become the property of TripleLift and no fee shall be due.",
    "link": "https://www.linkedin.com/jobs/view/3538710608/?eBP=CwEAAAGHG0v9zumfliTZyHzAJBUqbCV2_86Ev-fj3uIZr7A8R3u2UhODaPAFDoI6FYNAa0AyR-g1ICENg1Ifrn6k-ulhzSDHFW8DNVxwmw2RrcE0iLY1pwlYlfHD-RLlYiQ3eOFfLaKeiwYvJwKPvFZWHTiyug_WMlVMvPLro79__4F8CJYxuD1K7ruGVt7HedktBsffA4VXudkDifv-IXwfftu4Rnzhbz_mQqr-GWYporTEuOkfSoyTo7p3pN5U2_gLZb2Jj1s3K67Bd2qFDGYGW0qN9D3kI1c3zuOYQ4IVAxWbZti2l3VIPpsJDG_2TFgp_CWn0KoICBOWMqTqM7xrMCshmzm1rMsLY7dd5-KZ5wpIG6TtobNftF6RRmUV3HyXd7hiSTJOWWDOqTiR0GZtgIf8oVR2GA&refId=FWUPmjjxlmOUmYmeVKpcfw%3D%3D&trackingId=kZV3uw8cRw77hE%2B8Z42o9g%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Engineering Software Engineer",
    "companyName": "Valeo",
    "location": "Chennai, Tamil Nadu, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Valeo is a tech global company, designing breakthrough solutions to reinvent the mobility. We are an automotive supplier partner to automakers and new mobility actors worldwide. Our vision? Invent a greener and more secured mobility, thanks to solutions focusing on intuitive driving and reducing CO2 emissions. We are leader on our businesses, and recognized as one of the largest global innovative companies.\nResponsibilities\n- Understand the System functionality and complex customer requirements and identify the\nvital information\n- Review System Requirements, System Architecture and Hardware Software Interface (HSI)\ndocument\n- Derive Software requirements from system level and create internal software requirements\nas needed for the complete software lifecycle\n- Documenting and Managing software requirements within Requirements Management tool\n(DOORS)\n- Conduct functional reviews with software architects and software testers- Support Software Architects with High-Level Design documentation, software test team and\ndevelopment team as needed\n- Ensure full traceability and coverage- Manage requirements baselines- Update software requirements specification for a change request- Adhere to the defined processes within the organization- Maintain quality work to meet the ASPICE process- Support internal/external Quality audits and ASPICE assessments (SWE.1)\nProfessional Experience\nExperience in Requirements Engineering and Management in Automotive or relevant Industry.- Working experience in Requirements Management tool (Rational DOORS or relevant)- Experience with Configuration management tools- Working experience in agile methodology (e.g. SCRUM).- Experience working with different document formats(PDF, Word, Excel, etc)- Knowledge on DOORS Scripting languages (DXL).- Certified as Requirements Engineer (IREB or relevant)- Understanding of ASPICE and ISO26262 standards.\nJob:\nR&D Engineer\nOrganization:\nEngineering Software CDA\nSchedule:\nFull time\nEmployee Status:\nRegular\nJob Type:\nPermanent contract\nJob Posting Date:\n2023-03-14\nJoin Us !\n\nBeing part of our team, you will join:\n\n one of the largest global innovative companies, with more than 20,000 engineers working in Research & Development a multi-cultural environment that values diversity and international collaboration more than 100,000 colleagues in 31 countries... which make a lot of opportunity for career growth a business highly committed to limiting the environmental impact if its activities and ranked by Corporate Knights as the number one company in the automotive sector in terms of sustainable development\n\nMore information on Valeo: https://www.valeo.com",
    "link": "https://www.linkedin.com/jobs/view/3538710608/?eBP=CwEAAAGHG0v9zumfliTZyHzAJBUqbCV2_86Ev-fj3uIZr7A8R3u2UhODaPAFDoI6FYNAa0AyR-g1ICENg1Ifrn6k-ulhzSDHFW8DNVxwmw2RrcE0iLY1pwlYlfHD-RLlYiQ3eOFfLaKeiwYvJwKPvFZWHTiyug_WMlVMvPLro79__4F8CJYxuD1K7ruGVt7HedktBsffA4VXudkDifv-IXwfftu4Rnzhbz_mQqr-GWYporTEuOkfSoyTo7p3pN5U2_gLZb2Jj1s3K67Bd2qFDGYGW0qN9D3kI1c3zuOYQ4IVAxWbZti2l3VIPpsJDG_2TFgp_CWn0KoICBOWMqTqM7xrMCshmzm1rMsLY7dd5-KZ5wpIG6TtobNftF6RRmUV3HyXd7hiSTJOWWDOqTiR0GZtgIf8oVR2GA&refId=FWUPmjjxlmOUmYmeVKpcfw%3D%3D&trackingId=kZV3uw8cRw77hE%2B8Z42o9g%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Engineering Software Engineer",
    "companyName": "Valeo",
    "location": "Chennai, Tamil Nadu, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Valeo is a tech global company, designing breakthrough solutions to reinvent the mobility. We are an automotive supplier partner to automakers and new mobility actors worldwide. Our vision? Invent a greener and more secured mobility, thanks to solutions focusing on intuitive driving and reducing CO2 emissions. We are leader on our businesses, and recognized as one of the largest global innovative companies.\nResponsibilities\n- Understand the System functionality and complex customer requirements and identify the\nvital information\n- Review System Requirements, System Architecture and Hardware Software Interface (HSI)\ndocument\n- Derive Software requirements from system level and create internal software requirements\nas needed for the complete software lifecycle\n- Documenting and Managing software requirements within Requirements Management tool\n(DOORS)\n- Conduct functional reviews with software architects and software testers- Support Software Architects with High-Level Design documentation, software test team and\ndevelopment team as needed\n- Ensure full traceability and coverage- Manage requirements baselines- Update software requirements specification for a change request- Adhere to the defined processes within the organization- Maintain quality work to meet the ASPICE process- Support internal/external Quality audits and ASPICE assessments (SWE.1)\nProfessional Experience\nExperience in Requirements Engineering and Management in Automotive or relevant Industry.- Working experience in Requirements Management tool (Rational DOORS or relevant)- Experience with Configuration management tools- Working experience in agile methodology (e.g. SCRUM).- Experience working with different document formats(PDF, Word, Excel, etc)- Knowledge on DOORS Scripting languages (DXL).- Certified as Requirements Engineer (IREB or relevant)- Understanding of ASPICE and ISO26262 standards.\nJob:\nR&D Engineer\nOrganization:\nEngineering Software CDA\nSchedule:\nFull time\nEmployee Status:\nRegular\nJob Type:\nPermanent contract\nJob Posting Date:\n2023-03-14\nJoin Us !\n\nBeing part of our team, you will join:\n\n one of the largest global innovative companies, with more than 20,000 engineers working in Research & Development a multi-cultural environment that values diversity and international collaboration more than 100,000 colleagues in 31 countries... which make a lot of opportunity for career growth a business highly committed to limiting the environmental impact if its activities and ranked by Corporate Knights as the number one company in the automotive sector in terms of sustainable development\n\nMore information on Valeo: https://www.valeo.com",
    "link": "https://www.linkedin.com/jobs/view/3538710608/?eBP=CwEAAAGHG0v9zumfliTZyHzAJBUqbCV2_86Ev-fj3uIZr7A8R3u2UhODaPAFDoI6FYNAa0AyR-g1ICENg1Ifrn6k-ulhzSDHFW8DNVxwmw2RrcE0iLY1pwlYlfHD-RLlYiQ3eOFfLaKeiwYvJwKPvFZWHTiyug_WMlVMvPLro79__4F8CJYxuD1K7ruGVt7HedktBsffA4VXudkDifv-IXwfftu4Rnzhbz_mQqr-GWYporTEuOkfSoyTo7p3pN5U2_gLZb2Jj1s3K67Bd2qFDGYGW0qN9D3kI1c3zuOYQ4IVAxWbZti2l3VIPpsJDG_2TFgp_CWn0KoICBOWMqTqM7xrMCshmzm1rMsLY7dd5-KZ5wpIG6TtobNftF6RRmUV3HyXd7hiSTJOWWDOqTiR0GZtgIf8oVR2GA&refId=FWUPmjjxlmOUmYmeVKpcfw%3D%3D&trackingId=kZV3uw8cRw77hE%2B8Z42o9g%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "Vendasta",
    "location": "Chennai, Tamil Nadu, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  *This position is open for consideration of candidates in Chennai or willing to relocate to Chennai\nAbout the JobWe are looking for a candidate who fits one of these personas:The Expert: You are an expert in one of these technologies: Cloud Native Computing, GoLang, or Frontend using Angular. You know the right patterns and techniques to make things simpler for your colleagues and more reliable for our customers.The Mentor: You have experience from delivering high quality solutions. You love to take that experience and level up the intermediate developers around you to help them become senior developers too.The Shipper: You excel at taking the great ideas from nothing to usable prototype. You know which corners to cut now, so that as the idea takes off it will be easy to improve and scale.The Generalist: You have worked on multiple and varied large projects. When there is a tough problem your experience will allow you to find a workable solution, because it is similar enough to something you have done before.\nResponsibilities Develop software in teams of 3-5 developers, with the ability to take on tasks from the team and independently work on them to completion. Follow best practices to write clean, maintainable, scalable, and tested software.Contribute to the best engineering practices, including the use of design patterns, CI/CD, maintainable and scalable code, code review and automated test.Provide inputs for technical roadmap for the Product Area. Ensure that the NFRs and technical debt get their due focus. Work collaboratively with Product Managers to design solutions (including technical roadmap) that help our Partners connect digital solutions to small and medium sized businesses.Analysing and improving current system integrations and migration strategies.Interact and collaborate with our high-quality technical team across India and Canada\nSkills and Qualifications5+ years as full stack developer with either Java or Go as Programming Language and Angular / React for front endExperience or strong understanding with high scalability, data intensive, distributed Internet applicationsSoftware development experience including building distributed, microservice-style and cloud-based application architecturesProficiency in modern software language, and willingness to quickly learn our technology stackPreference will be given to candidates with a strong Go (programming language) experience, and who can demonstrate the ability to build and adapt web applications using Angular. Experience in Design, Build and Implementing cloud-native architectures (GCP preferred).Experience working with Scrum framework\nTechnologies We UseCloud Native Computing using Google Cloud PlatformBigQuery, Cloud Dataflow, Cloud Pub/Sub, Google Data Studio, Cloud IAM, Cloud Storage, Cloud SQL, Cloud Spanner, Cloud Datastore, Google Maps Platform, Stackdriver, etc… We have been invited to join the Early Access Program on quite a few GCP technologies.KubernetesGoLang, Typescript, Python, Javascript, HTMLAngularElasticsearch, MySQL, PostgreSQLGRPC\nAbout VendastaSo what do we actually do? We create an entire platform full of digital products & solutions that help small to medium sized businesses (SMBs) have a stronger presence online through digital advertising, online listings, reputation management, website creation, social media marketing … and much more! Our platform is used exclusively by channel partners, who sell products and services to SMBs, allowing them to leverage us to scale and grow their business. We’re trusted by 65,000+ channel partners, serving over 6 million SMBs worldwide! \nPerksBenefits - Health insuranceVacation - Minimum 3 weeks paid vacation per yearTraining & Career Development - Professional development plans, leadership workshops, mentorship program, and so much more! Culture - comprised of our core values: Drive, Innovation, Respect, and AgilityProvident Fund",
    "link": "https://www.linkedin.com/jobs/view/3538710608/?eBP=CwEAAAGHG0v9zumfliTZyHzAJBUqbCV2_86Ev-fj3uIZr7A8R3u2UhODaPAFDoI6FYNAa0AyR-g1ICENg1Ifrn6k-ulhzSDHFW8DNVxwmw2RrcE0iLY1pwlYlfHD-RLlYiQ3eOFfLaKeiwYvJwKPvFZWHTiyug_WMlVMvPLro79__4F8CJYxuD1K7ruGVt7HedktBsffA4VXudkDifv-IXwfftu4Rnzhbz_mQqr-GWYporTEuOkfSoyTo7p3pN5U2_gLZb2Jj1s3K67Bd2qFDGYGW0qN9D3kI1c3zuOYQ4IVAxWbZti2l3VIPpsJDG_2TFgp_CWn0KoICBOWMqTqM7xrMCshmzm1rMsLY7dd5-KZ5wpIG6TtobNftF6RRmUV3HyXd7hiSTJOWWDOqTiR0GZtgIf8oVR2GA&refId=FWUPmjjxlmOUmYmeVKpcfw%3D%3D&trackingId=kZV3uw8cRw77hE%2B8Z42o9g%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "ImageKit.io",
    "location": "India, Remote",
    "description": "About the job\n        \n\n\n        \n                  Note: This is a remote-only role. As long as you have a stable internet connection, youcan work from anywhere in the world. We do meet up if you are in Delhi NCR or on ourcompany trips.Have you ever ordered with BigBasket? Or booked a ticket on BookMyShow? Orbought a product from Nykaa? Then you’ve already interacted with ImageKit. ImageKitis a SaaS product that streamlines images and videos for companies of all sizes acrossthe globe. Over 80,000 developers and 1200+ companies across 65+ countries useImageKit to store, manage and deliver optimized images and videos on websites andapps. We strongly believe that every company is destined to be a content and mediacompany and would need a partner to help them manage and deliver them. ImageKit ison a journey to revolutionize the media space. And we are looking for people like you tojoin us on this journey.\nWant to know more about our company?https://blog.imagekit.io/imagekit-io-funding-current-business-and-future-plans-cdc66ccda3b9https://yourstory.com/2021/12/saas-startup-imagekit-image-optimisation-nykaa-bigbaskethttps://www.youtube.com/watch?v=t-r5m0kE2xohttps://www.glassdoor.co.uk/Overview/Working-at-ImageKit-EI_IE3293686.11,19.htmhttps://www.linkedin.com/company/imagekit-io/mycompany/ (feel free to reach out toone of our existing employees to know more about how we work)Background about ImageKit relevant to this roleCurrently, we serve over a few billion images and videos daily, have multiple serversrunning in 6 regions globally, with sustained request rates round-the-clock because ofour customers spread across the globe. We also manage several terabytes of imagestorage through our digital asset management tool called the Media library.We are continuously evolving to improve our systems’ stability, performance andsecurity. Additionally, we have tons of features to be added to the existing product andare also working on video optimization and delivery (already available in beta) and\nadding more collaboration and AI-powered workflows in the Media Library, with the aimto make ImageKit the best media management and delivery product globally.We are looking for passionate full-stack developers with not just good technical skills,but also a good sense of making user-friendly products, to join our technology team. Ifyou are someone who gets excited about solving large-scale engineering problems,wants to build industry-first features, and wants to be a part of a fast-growing IndianSaaS startup, let's have a word.\nProblems you will be working on at ImageKit\n1. Video delivery and optimization - We are gradually moving from just images tovideos as well, helping companies simplify video delivery across devices. Wehave launched a beta version with real-time processing, and need to improve alot there.2. Media management - A central place to upload, search and collaborate on allimages and videos that you see on a company's website. This would involvebuilding a product to store, manage, and collaborate on several TBs of digitalassets and multiple users in an organization.3. Building for scale - We already serve over a few billion images every day and thisnumber is growing rapidly. How do you handle sudden traffic surges, for complexand CPU-intensive media processing to serve optimized content in real-time?4. Delivering close to 100% uptime always - Our product is integrated on livewebsites for things as critical as product images on an e-commerce website. Ourservices need to remain up for our customers regardless of what happens in thebackground.\nResponsibilities\n1. Work with other team members to conceptualize new features, build them fromscratch, roll them out to our customers, and improve them based on feedback.2. Keep in mind the pain points of customers while creating any feature or product.Excellent user experience is critical for us.3. Take full ownership of development, testing, quality & launch of new productsand features4. Iterate, develop, and test MVPs quickly.\n5. Improve existing features and write test cases.6. Review code that is written by other team members7. Manual and automatic testing of your features.8. Coordinate with the infrastructure team and monitor critical metrics related to theproduct on production servers.9. Willing to work autonomously and remotely.\nRequirements\n1. Should have excellent problem-solving skills with the ability to break down alarge problem or system into smaller components and prioritize the design &development work.2. Demonstrated interest in learning new things and working on them (for example -own startup, an initial member of someone else's startup, contribution to opensource projects, a small website or side hustle that they run on their own, etc.)3. Knowledge of Javascript / NodeJS (must), HTML (must).4. 3-5 Years of work experience and bachelor's degree from any college ispreferred5. Knowledge about CDNs, DNS, and AWS is preferred.6. Knowledge about best practices for improving web performance is preferred.7. Excellent communication skills (the English language is not mandatory, but theclarity of thoughts is essential especially now that we are working remotely\nWhat will we offer you?1. An excellent compensation, for sure2. You work with a very hardworking and responsible remote team. We take our workseriously, and also our off-sites (the last one was for a week in Bali. Don't miss out onthe next :))3. We take care of your and your family's health insurance.4. Help you with funds to set up your workspace at your home or take up a co-workingspace.5. A learning and wellness fund to pursue any professional course and any hobbiesoutside of work (Gym, bartending, sports, and dancing are some hobbies that our teammembers have pursued).\n6. No questions asked leave policy. We trust you to get the work done.7. Flexible working hours and flexible work locations. As long as you have a stableinternet connection, you can work from anywhere in the world.",
    "link": "https://www.linkedin.com/jobs/view/3538710608/?eBP=CwEAAAGHG0v9zumfliTZyHzAJBUqbCV2_86Ev-fj3uIZr7A8R3u2UhODaPAFDoI6FYNAa0AyR-g1ICENg1Ifrn6k-ulhzSDHFW8DNVxwmw2RrcE0iLY1pwlYlfHD-RLlYiQ3eOFfLaKeiwYvJwKPvFZWHTiyug_WMlVMvPLro79__4F8CJYxuD1K7ruGVt7HedktBsffA4VXudkDifv-IXwfftu4Rnzhbz_mQqr-GWYporTEuOkfSoyTo7p3pN5U2_gLZb2Jj1s3K67Bd2qFDGYGW0qN9D3kI1c3zuOYQ4IVAxWbZti2l3VIPpsJDG_2TFgp_CWn0KoICBOWMqTqM7xrMCshmzm1rMsLY7dd5-KZ5wpIG6TtobNftF6RRmUV3HyXd7hiSTJOWWDOqTiR0GZtgIf8oVR2GA&refId=FWUPmjjxlmOUmYmeVKpcfw%3D%3D&trackingId=kZV3uw8cRw77hE%2B8Z42o9g%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer II",
    "companyName": "Uber",
    "location": "Bengaluru, Karnataka, India, ",
    "description": "About the job\n        \n\n\n        \n                  About The Role\nRider Rentals is a product team in Uber Bangalore with the mission to provide rental cars to our customers quickly and seamlessly. This team will host an entrepreneurial mindset which will focus on rapid experimentation of ideas to expand the product portfolio for Uber.\nThis team is working to bring customer-centric rental experience to our riders, at par with the Uber experience that they have come to expect. We partner with global providers with the goal to offer our riders car-rental options in many cities around the world.\nWhat The Candidate Will Need / Bonus Points\n---- What the Candidate Will Do ----\nBack End/Application development experienceCode primarily in Golang and an enthusiasm to learn others.Strong competencies in data structures, algorithms and software design optimized for large-scale systemsExperience in efficiently collaborating on projectsStrong Code and documentation - your code should be used as the example for your company and you have the ability to build and design technical solutions from the ground up.\n Basic Qualifications\nBack End/Application development experienceCode primarily in Golang and an enthusiasm to learn others.Strong competencies in data structures, algorithms and software design optimized for large-scale systemsExperience in efficiently collaborating on projectsStrong Code and documentation - your code should be used as the example for your company and you have the ability to build and design technical solutions from the ground up.Fast learner: We're looking for software engineers who thrive on learning new technologies and don't believe in one-size-fits-all solutions. You should be able to adapt easily to meet the needs of our massive growth and rapidly evolving business environment.\n---- What the Candidate Will Do ----\nBack End/Application development experienceCode primarily in Golang and an enthusiasm to learn others.Strong competencies in data structures, algorithms and software design optimized for large-scale systemsExperience in efficiently collaborating on projectsStrong Code and documentation - your code should be used as the example for your company and you have the ability to build and design technical solutions from the ground up.Fast learner: We're looking for software engineers who thrive on learning new technologies and don't believe in one-size-fits-all solutions. You should be able to adapt easily to meet the needs of our massive growth and rapidly evolving business environment.\nUber is proud to be an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you have a disability or special need that requires accommodation, please let us know by completing this form.\nOffices continue to be central to collaboration and Uber’s cultural identity. Unless formally approved to work fully remotely, Uber expects employees to spend at least half of their work time in their assigned office. For certain roles, such as those based at green-light hubs, employees are expected to be in-office for 100% of their time. Please speak with your recruiter to better understand in-office expectations for this role.",
    "link": "https://www.linkedin.com/jobs/view/3538710608/?eBP=CwEAAAGHG0v9zumfliTZyHzAJBUqbCV2_86Ev-fj3uIZr7A8R3u2UhODaPAFDoI6FYNAa0AyR-g1ICENg1Ifrn6k-ulhzSDHFW8DNVxwmw2RrcE0iLY1pwlYlfHD-RLlYiQ3eOFfLaKeiwYvJwKPvFZWHTiyug_WMlVMvPLro79__4F8CJYxuD1K7ruGVt7HedktBsffA4VXudkDifv-IXwfftu4Rnzhbz_mQqr-GWYporTEuOkfSoyTo7p3pN5U2_gLZb2Jj1s3K67Bd2qFDGYGW0qN9D3kI1c3zuOYQ4IVAxWbZti2l3VIPpsJDG_2TFgp_CWn0KoICBOWMqTqM7xrMCshmzm1rMsLY7dd5-KZ5wpIG6TtobNftF6RRmUV3HyXd7hiSTJOWWDOqTiR0GZtgIf8oVR2GA&refId=FWUPmjjxlmOUmYmeVKpcfw%3D%3D&trackingId=kZV3uw8cRw77hE%2B8Z42o9g%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "Valor PayTech",
    "location": "Chennai, Tamil Nadu, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Job Description:We are looking to hire a seasoned iOS developer with extensive experience in Native iOS (Swift SwiftUI& Obj. C) Mobile. Design and build applications for the iOS platform. Ensure the performance, quality, and knowledge of best practices. Collaborate with a team to define, design, and ship new features. Identify and correct bottlenecks and fix bugs and Help maintain code quality, organization, and automation.\nYear of experience: 3 -8 yearsPackage: ₹ 6,00,000 - 16,00,000 P.A.\nFollowing Skill-set are required:Native iOS (Swift , SwiftUI& Obj. C) MobileStrong knowledge and hands-on development experience in Native iOS Mobile app development using Swift (5.x & above) & Objective C is a must.Working knowledge of iOS SDK, Xcode & iOS-related tools for debugging/troubleshooting.Good understanding of Native app iOS design theme & guidelines for smartphone/tablets.Hands-on development experience in calling web services (RESTful / SOAP) & basic client-server architecture understanding.",
    "link": "https://www.linkedin.com/jobs/view/3538710608/?eBP=CwEAAAGHG0v9zumfliTZyHzAJBUqbCV2_86Ev-fj3uIZr7A8R3u2UhODaPAFDoI6FYNAa0AyR-g1ICENg1Ifrn6k-ulhzSDHFW8DNVxwmw2RrcE0iLY1pwlYlfHD-RLlYiQ3eOFfLaKeiwYvJwKPvFZWHTiyug_WMlVMvPLro79__4F8CJYxuD1K7ruGVt7HedktBsffA4VXudkDifv-IXwfftu4Rnzhbz_mQqr-GWYporTEuOkfSoyTo7p3pN5U2_gLZb2Jj1s3K67Bd2qFDGYGW0qN9D3kI1c3zuOYQ4IVAxWbZti2l3VIPpsJDG_2TFgp_CWn0KoICBOWMqTqM7xrMCshmzm1rMsLY7dd5-KZ5wpIG6TtobNftF6RRmUV3HyXd7hiSTJOWWDOqTiR0GZtgIf8oVR2GA&refId=FWUPmjjxlmOUmYmeVKpcfw%3D%3D&trackingId=kZV3uw8cRw77hE%2B8Z42o9g%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Specialist - Software Engineering",
    "companyName": "LTIMindtree",
    "location": "Chennai, Tamil Nadu, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Role : Senior Specialist - Software EngineeringLocation:- Chennai, Tamil Nadu, IndiaExperience -7 to 12 years\nRole and Responsibilities: -Should have technical background. No specific technology however should be sound in SDLC and should be able to get hands on if required-Facilitates daily stand-up, iteration planning, sprint review, and iteration retrospective-Manage the engineering development projects and facilitates sprint releases, Handle end to end delivery with client.-Create or analyze business requirements documents and project timelines-Guides team in time estimating practices and facilitates team estimates-Drive team iteration execution, communicates with management and stakeholders, protects the team from uncontrolled injection of work (changes are evaluated/intentional)-Manage project conflicts, challenges and dynamic business requirements to keep operations running at a high performance-Work with the team leads to resolve people problems and project roadblocks-Able to do post mortem and root cause analysis to help teams continuously improve their practices to ensure maximum productivity-Leads team effort in relentless improvement, define and implement improvement stories to increase the velocity and quality of the program-Proactively identify and eliminate impediments and facilitate flow-Maintain team data in project management software (i.e. JIRA, Manuscript, etc.) to support estimates and execution-Presents high level project readouts for senior management-Supports product owner(s) with intra-team dynamics with respect to priorities and scope*Skills and Qualifications-Minimum 9+ years of project management experience and Scrum Master leading sprints.-Demonstrable expertise of agile methodology and frameworks like Scrum, Kanban, etc.-Expert coach on implementation of agile scrum-Deep understanding of the fundamentals of iterative and incremental development-Strong knowledge of Scrum theory, rules and practices-Strong understanding of SDLC and Agile procedures to predict the development teams’ needs-Solid experience working with Architecture teams to assess and size story/epics-Passionate commitment to delivering products on time-Comfortable with presenting project readouts to Executive level audience-Deep understanding of agile metrics (tasks, backlog tracking, burndown metrics, velocity, user stories etc.) to analyze and improve sprint planning-Ability to understand and represent both the business and technology-Excellent communicator in person, over the phone and through email-Self-motivated, organized",
    "link": "https://www.linkedin.com/jobs/view/3538710608/?eBP=CwEAAAGHG0v9zumfliTZyHzAJBUqbCV2_86Ev-fj3uIZr7A8R3u2UhODaPAFDoI6FYNAa0AyR-g1ICENg1Ifrn6k-ulhzSDHFW8DNVxwmw2RrcE0iLY1pwlYlfHD-RLlYiQ3eOFfLaKeiwYvJwKPvFZWHTiyug_WMlVMvPLro79__4F8CJYxuD1K7ruGVt7HedktBsffA4VXudkDifv-IXwfftu4Rnzhbz_mQqr-GWYporTEuOkfSoyTo7p3pN5U2_gLZb2Jj1s3K67Bd2qFDGYGW0qN9D3kI1c3zuOYQ4IVAxWbZti2l3VIPpsJDG_2TFgp_CWn0KoICBOWMqTqM7xrMCshmzm1rMsLY7dd5-KZ5wpIG6TtobNftF6RRmUV3HyXd7hiSTJOWWDOqTiR0GZtgIf8oVR2GA&refId=FWUPmjjxlmOUmYmeVKpcfw%3D%3D&trackingId=kZV3uw8cRw77hE%2B8Z42o9g%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Manual Test Engineer",
    "companyName": "cure.fit (cult.fit)",
    "location": "Bengaluru, Karnataka, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Founded in 2016 by Mukesh Bansal and Ankit Nagori , Cure.fit is a mobile app that takes a holistic approach towards health and fitness by bringing together all aspects of a healthy lifestyle on a single platform. Cure.fit offers both online and offline experiences across fitness, nutrition and mental well-being through its 4 products, i.e. Cult.fit , Eat.fit , Mind.fit & Care.fit with the aim to make fitness fun and easy\n\nAs a Quality member, you will test the applications developed by custom development. You will be involved in end-to-end processes and metrics for software testing within the organization . You will collaborate with project managers and software developers to establish reporting metrics, test scenarios, and efficiencies through manual testing and streamlining QA techniques to achieve quality objectives.\n\nThis Role Demands Someone Who Has\nAbility to work effectively in a fast-paced and changing business environment.Flexibility, adaptability, and work in minimal supervision if required are must to have to be successful in this role.\nSkills & Experience\nWell versed with testing methodologies\nMust-Have Skills\nHaving good knowledge on iOS/Android based apps testing.Highly proficient in manual testing (Different types of testing: Regression, Sanity, Smoke & Functionality related)Good at writing manual test cases with all possible scenarios.Knowledge of defect reporting & bug tracking using JiraGood in debugging skillsKnowledge of software development lifecycleGood communication skills\nGood To Have Skills\nDecent problem solving skills and ability to write code.API testingWebsite testingPrevious experience of testing e-commerce applicationsExperience working with Agile methodologiesAbility to find, file, and manage bugs, aggressively driving qualityExperienced in testing larger scale projects/ quick changes from planning to sign offMust be extremely responsive, able to work under pressure in crisis with a strong sense of urgencyAbility to independently create test data as per the requirements\nEducation And Experience\nRequires Bachelors in Engineering Degree or equivalent2-4 years minimum professional experience in testing\nKey Responsibilities\nAnalyzing the requirement from a testing perspectiveCreating test plans and writing test scriptsClosely working with the scrum master and product owner to identify the risk areasManaging the defects logged and tracking them till they get closedPerforming RCA over the defects loggedIn-depth regression testing which will cover all the components\nAt Cure.fit , our mission is to “make health easy”. Through our products and services, we want to enable people to significantly improve their overall health, reduce the risk of lifestyle diseases and enable a long, disease free life. We are deeply passionate about health, fitness, and the general well-being and are eager to leverage the power of technology to help people live healthier, happier lives.\n\nIn pursuit of this objective, we are always looking for excellent team members to fulfill the vision of building these incredible and innovative products.",
    "link": "https://www.linkedin.com/jobs/view/3538710608/?eBP=CwEAAAGHG0v9zumfliTZyHzAJBUqbCV2_86Ev-fj3uIZr7A8R3u2UhODaPAFDoI6FYNAa0AyR-g1ICENg1Ifrn6k-ulhzSDHFW8DNVxwmw2RrcE0iLY1pwlYlfHD-RLlYiQ3eOFfLaKeiwYvJwKPvFZWHTiyug_WMlVMvPLro79__4F8CJYxuD1K7ruGVt7HedktBsffA4VXudkDifv-IXwfftu4Rnzhbz_mQqr-GWYporTEuOkfSoyTo7p3pN5U2_gLZb2Jj1s3K67Bd2qFDGYGW0qN9D3kI1c3zuOYQ4IVAxWbZti2l3VIPpsJDG_2TFgp_CWn0KoICBOWMqTqM7xrMCshmzm1rMsLY7dd5-KZ5wpIG6TtobNftF6RRmUV3HyXd7hiSTJOWWDOqTiR0GZtgIf8oVR2GA&refId=FWUPmjjxlmOUmYmeVKpcfw%3D%3D&trackingId=kZV3uw8cRw77hE%2B8Z42o9g%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer I",
    "companyName": "Precisely",
    "location": "India, Remote",
    "description": "About the job\n        \n\n\n        \n                  Precisely is the leader in data integrity. We empower businesses to make more confident decisions based on trusted data through a unique combination of software, data enrichment products and strategic services. What does this mean to you? For starters, it means joining a company focused on delivering outstanding innovation and support that helps customers increase revenue, lower costs and reduce risk. In fact, Precisely powers better decisions for more than 12,000 global organizations, including 99 of the Fortune 100. Precisely's 2500 employees are unified by four company core values that are central to who we are and how we operate: Openness, Determination, Individuality, and Collaboration. We are committed to career development for our employees and offer opportunities for growth, learning and building community. With a \"work from anywhere\" culture, we celebrate diversity in a distributed environment with a presence in 30 countries as well as 20 offices in over 5 continents. Learn more about why it's an exciting time to join Precisely!\nIntro And Job Overview\nThe role of a Web Developer is to create well-written front-end web applications based on best practices, standards, and application requirements received from the product owners and designers. Developer will work with a team to design, develop, and test moderate to complex graphical interfaces and services for web applications.\nResponsibilities And Duties\nDevelop web applications and services using Syncsort’s software development processes and tools leading to the highest standard of software quality.Participate in design and code reviews within a team environment to eliminate errors early in the development process.Take proactive actions to prevent customer issues.Participate in problem determination and debugging of software product issues by using technical skills and tools to isolate the cause of the problem in an efficient and timely manner.Provide documentation needed to thoroughly communicate software functionality.Present technical features of product to customers and stakeholders as required.Deliver a complete front-end web application.Ensure high performance and quality of web applications.Write, document and unit test JavaScript, TypeScript, HTML, CSS and SASS(LESS), REST API and services.Coordinate with UX and graphic designers for front end consistency.Ensure timelines and deliverables are met.Participate in the Agile development process.Utilize and contribute to Design System.\nRequirements And Qualifications\n3 to 5 years of relevant experience.Bachelor’s degree in Computer Science or related field, or equivalent experience.Ability to analyze moderate to complex programming problems and create algorithms and programming solutions.Ability to produce results at a level commensurate with skill level consistent with industry standards.Strong teamwork skills.Results focused with good time management and personal management skills.Ability to be flexible and handle multiple priorities or focus and provide in-depth solutions.Good self-management skills with the ability to show initiative and take responsibility for issues and problems.Specialized Knowledge - HTML, CSS, and JavaScript skills – Angular experience prefered, AngularJS, Vue.js, React a plus.API experience (RESTful, SOAP), NodeJS, Java Web Development, Spring Framework, JDBC, Apache Velocity, Bootstrap Java or C#Experience with Docker, micro-services, kubernetes, AWS preferred.Experience with Jenkins, NPM, Gulp.jsAutomated unit testing – Jasmine, Junit or Nunit.Automated functional testing – Protractor, Selenium.Experience with XML, CSS, SASS, SQL, SQL Server, and MVC.Experience using Ng-bootstrap, JQuery, JQuery UI.Written and verbal communication skills with the ability to write design documentation.Experience with Agile Scrum application development practices and tools (Jira, TFS).",
    "link": "https://www.linkedin.com/jobs/view/3538710608/?eBP=CwEAAAGHG0v9zumfliTZyHzAJBUqbCV2_86Ev-fj3uIZr7A8R3u2UhODaPAFDoI6FYNAa0AyR-g1ICENg1Ifrn6k-ulhzSDHFW8DNVxwmw2RrcE0iLY1pwlYlfHD-RLlYiQ3eOFfLaKeiwYvJwKPvFZWHTiyug_WMlVMvPLro79__4F8CJYxuD1K7ruGVt7HedktBsffA4VXudkDifv-IXwfftu4Rnzhbz_mQqr-GWYporTEuOkfSoyTo7p3pN5U2_gLZb2Jj1s3K67Bd2qFDGYGW0qN9D3kI1c3zuOYQ4IVAxWbZti2l3VIPpsJDG_2TFgp_CWn0KoICBOWMqTqM7xrMCshmzm1rMsLY7dd5-KZ5wpIG6TtobNftF6RRmUV3HyXd7hiSTJOWWDOqTiR0GZtgIf8oVR2GA&refId=FWUPmjjxlmOUmYmeVKpcfw%3D%3D&trackingId=kZV3uw8cRw77hE%2B8Z42o9g%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "bluCursor Infotech Pvt Ltd",
    "location": "Indore, Madhya Pradesh, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  - Apply only if you are willing to relocate to Indore, MP & work from the office.\nRequirements:Degree(s) - B.Tech/BE (CS, IT)/MCAEligibility - 2020, 2021, 2022 & 2023 graduates & postgraduates only.Good programming skills.Deep familiarity with Java, OOPS, Operating systems & Data Structures.Have knowledge of working with relational database systems e.g. Oracle, MySQL, or similar DBMS.Hands-on knowledge in designing & developing applications using Java EE platforms.Proficiency in software engineering tools.Excellent understanding of Javascript, jQuery, nodeJS, React, AngularJS & BootstrapStrong verbal & written communication skills.\nResponsibilities:Execute full software development life cycle (SDLC).Write well-designed, testable Java code.Work with third-party libraries & APIs.Build, deploy, operate, scale, & maintain cloud-based solutions. Work in a diverse & global team environment.Continuously discover, evaluate & implement new technologies.Testing the product in controlled, real situations before going live.Design, initiate & handle technical designs & complex application features.Work closely with analysts, designers & staff.Initiate & drive major changes in programs, procedures & methodology.Maintaining the systems once they are up & running.Responsible for the design, development, & improvement of the database.Design databases that meet all requirements for entry & reporting of data; maintain the integrity & quality of databases; control system capacity for existing requirements & plan for future needs; & test new processes & systems.Understanding client requirements & functional specifications.",
    "link": "https://www.linkedin.com/jobs/view/3538710608/?eBP=CwEAAAGHG0v9zumfliTZyHzAJBUqbCV2_86Ev-fj3uIZr7A8R3u2UhODaPAFDoI6FYNAa0AyR-g1ICENg1Ifrn6k-ulhzSDHFW8DNVxwmw2RrcE0iLY1pwlYlfHD-RLlYiQ3eOFfLaKeiwYvJwKPvFZWHTiyug_WMlVMvPLro79__4F8CJYxuD1K7ruGVt7HedktBsffA4VXudkDifv-IXwfftu4Rnzhbz_mQqr-GWYporTEuOkfSoyTo7p3pN5U2_gLZb2Jj1s3K67Bd2qFDGYGW0qN9D3kI1c3zuOYQ4IVAxWbZti2l3VIPpsJDG_2TFgp_CWn0KoICBOWMqTqM7xrMCshmzm1rMsLY7dd5-KZ5wpIG6TtobNftF6RRmUV3HyXd7hiSTJOWWDOqTiR0GZtgIf8oVR2GA&refId=FWUPmjjxlmOUmYmeVKpcfw%3D%3D&trackingId=kZV3uw8cRw77hE%2B8Z42o9g%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Associate Software Engineer",
    "companyName": "Priceline",
    "location": "Mumbai, Maharashtra, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Our Technology team is the backbone of our company: constantly creating, testing, learning and iterating to better meet the needs of our customers. If you thrive in a fast-paced, ideas-led environment, you’re in the right place.\n\nWhy This Job’s a Big Deal\n\nJoin an Agile team of experts that are instrumental in building the next generation of travel applications. We constantly explore new technologies and engineer better solutions for ever demanding business needs. Our team of engineers, at all levels, work with the business leaders in defining the product roadmap and come up with innovative solutions to grow the future of travel. We design and develop our back end systems and REST APIs that serve hundreds of millions of searches a day, collecting and parsing data across thousands of partners to get the best deals for our customers.\n\nIn This Role You Will Get To\nParticipate in critical projects with direct impact on the evolution of Priceline's business.Be part of a cross-functional agile team that continuously experiments, iterates and delivers on new product objectives.Showcase your development skills of Core Java or similar programming languages.Apply your programming skills towards building low latency and high throughput transactional services with continuous integration and automation testing.Implement SQL composition skills that collects and queries data for investigation and analysis in real time from our applications.Utilize your knowledge to understand our codebase, systems and business requirements to effectively make changes to our applications.Effectively collaborate and engage in team efforts, speak up for what you think are the best solutions and be able to converse respectfully and compromise when necessary.\nWho You Are\nBachelor’s degree or higher in Computer Science or related field.2+ years of experience in software engineering and development.Illustrated history of living the values necessary to Priceline: Customer, Innovation, Team, Accountability and Trust.Coding experience with Core Java / Scala or similar programming languages.Thorough SQL compositions skills for composing queries and analysis.Deep understanding of modern real-time as well as batch processing big data solutions (Spark/ Kafka/KSql/ Flink/ Apache Beam)Experience developing applications that work with NoSQL stores (e.g.Cassandra, Bigtable, MongoDB)Has a good understanding of Lambda Architecture.Experience with developing on Cloud, especially GCP and AWS.Proficient with DWH concepts, with experience in dimensional modeling.Comfort and experience with Spring Frameworks, Web Services and APIs.Experience in Microservices, Kubernetes, Dockers is a big positive.\nWho We Are\n\nWE ARE PRICELINE.\n\nOur success as one of the biggest players in online travel is all thanks to our incredible, dedicated team of talented employees. Priceliners are focused on being the best travel deal makers in the world, motivated by our passion to help everyone experience the moments that matter most in their lives. Whether it’s a dream vacation, your cousin’s graduation, or your best friend’s wedding - we make travel affordable and accessible to our customers.\n\nOur culture is unique and inspiring (that’s what our employees tell us). We’re a grown-up, startup. We deliver the excitement of a new venture, without the struggles and chaos that can come with a business that hasn’t stabilized.\n\nWe’re on the cutting edge of innovative technologies. We keep the customer at the center of all that we do. Our ability to meet their needs relies on the strength of a workforce as diverse as the customers we serve. We bring together employees from all walks of life and we are proud to provide the kind of inclusive environment that stimulates innovation, creativity and collaboration.\n\nPriceline is part of the Booking Holdings, Inc. (Nasdaq: BKNG) family of companies, a highly profitable global online travel company with a market capitalization of over $80 billion. Our sister companies include Booking.com, BookingGo, Agoda, Kayak and OpenTable.\n\nIf you want to be part of something truly special, check us out!\n\nFlexible work at Priceline\n\nWhen we return to the office we will be in a fully flex mode, meaning you decide when to come to the office when it makes sense for you to do so - no minimum number of days in the office. Until then we are all working from home and will return to our flex mode when it is safe to do so.\n\nDiversity and Inclusion are a Big Deal!\n\nTo be the best travel dealmakers in the world, it’s important we have a workforce that reflects the diverse customers and communities we serve. We are committed to cultivating a culture where all employees have the freedom to bring their individual perspectives, life experiences, and passion to work.\n\nPriceline is a proud equal opportunity employer. We embrace and celebrate the unique lenses through which our employees see the world. We’d love you to join us and add to our rich mix!\n\nApplying for this position\n\nWe're excited that you are interested in a career with us. For all current employees, please use the internal portal to find jobs and apply.\n\nExternal candidates are required to have an account before applying. When you click Apply, returning candidates can log in, or new candidates can quickly create an account to save/view applications.",
    "link": "https://www.linkedin.com/jobs/view/3538710608/?eBP=CwEAAAGHG0v9zumfliTZyHzAJBUqbCV2_86Ev-fj3uIZr7A8R3u2UhODaPAFDoI6FYNAa0AyR-g1ICENg1Ifrn6k-ulhzSDHFW8DNVxwmw2RrcE0iLY1pwlYlfHD-RLlYiQ3eOFfLaKeiwYvJwKPvFZWHTiyug_WMlVMvPLro79__4F8CJYxuD1K7ruGVt7HedktBsffA4VXudkDifv-IXwfftu4Rnzhbz_mQqr-GWYporTEuOkfSoyTo7p3pN5U2_gLZb2Jj1s3K67Bd2qFDGYGW0qN9D3kI1c3zuOYQ4IVAxWbZti2l3VIPpsJDG_2TFgp_CWn0KoICBOWMqTqM7xrMCshmzm1rMsLY7dd5-KZ5wpIG6TtobNftF6RRmUV3HyXd7hiSTJOWWDOqTiR0GZtgIf8oVR2GA&refId=FWUPmjjxlmOUmYmeVKpcfw%3D%3D&trackingId=kZV3uw8cRw77hE%2B8Z42o9g%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "Ford Motor Company",
    "location": "Chennai, Tamil Nadu, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  Job Description\nDeveloping Continuous integration/Delivery (CI/CD) Solutions. Create and maintain Tech application documentation who is willing to learn automation.\nResponsibilities\nNice to Have Skills:\nWindows Server and / or Linux scripting experienceClear understanding of network and application security standardsAbility to create and maintain technical application documentationUnderstanding of VoIP technologyExperience with Verint or other call recording softwareFamiliarity with speech analytics softwareJavaTektonPowershellWindows & Unix shell scriptsGoogle Cloud Portal OpenShiftSplunkAPI integrations (XML/JSON)Container technologiesStrong teamwork, communication and interpersonal skillsStrong analytical and critical decision-making skillsSelf-starter, capable of working independently and as a team player\nAdditional Information:\nThis position is an excellent opportunity for the successful candidate to gain a wide breadth of experiences in developing automation solutions working with various contact center voice channel applications, client/server and web-based technologies.\nAdditional Skills Preferred:\nExperience in developing continuous integration/continuous delivery (CI/CD) solutionsAbility to create and maintain technical application documentation\nQualifications\n6 + years of experience in a hands-on technical role engaged in implementing and supporting software applicationsBachelor’s Degree in Information Systems, Computer Science or equivalent experienceWindows Server and / or Linux server administrationKnowledge of networking protocols and conceptsWorking knowledge of SQL Server and the ability to write ad-hoc queriesAdvanced trouble-shooting skillsStrong analytical and critical decision-making skillsSolid verbal and written communication skillsWorking knowledge of configuration control and deployment practicesSelf-starter, capable of working independently and as a team playerAvailability to work off-hours for support",
    "link": "https://www.linkedin.com/jobs/view/3538710608/?eBP=CwEAAAGHG0v9zumfliTZyHzAJBUqbCV2_86Ev-fj3uIZr7A8R3u2UhODaPAFDoI6FYNAa0AyR-g1ICENg1Ifrn6k-ulhzSDHFW8DNVxwmw2RrcE0iLY1pwlYlfHD-RLlYiQ3eOFfLaKeiwYvJwKPvFZWHTiyug_WMlVMvPLro79__4F8CJYxuD1K7ruGVt7HedktBsffA4VXudkDifv-IXwfftu4Rnzhbz_mQqr-GWYporTEuOkfSoyTo7p3pN5U2_gLZb2Jj1s3K67Bd2qFDGYGW0qN9D3kI1c3zuOYQ4IVAxWbZti2l3VIPpsJDG_2TFgp_CWn0KoICBOWMqTqM7xrMCshmzm1rMsLY7dd5-KZ5wpIG6TtobNftF6RRmUV3HyXd7hiSTJOWWDOqTiR0GZtgIf8oVR2GA&refId=FWUPmjjxlmOUmYmeVKpcfw%3D%3D&trackingId=kZV3uw8cRw77hE%2B8Z42o9g%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "Singsys Pte Ltd",
    "location": "Lucknow, Uttar Pradesh, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  B.Tech.(CS/IT)/MCA having more than one year of hands on experience in either of following languages/skills: \nProficient in either of these coding languages: PHP-MYSQL/ Flutter/ react native/ react js/ Swift/ Android (java/kotlin)Good understanding of basic Software engineering and development.Basic understanding of Object Oriented Programming.Possess good logical and analytical skills in a structured manner.Effective Communication, correct understanding & clear presentation.Proactive, self-motivated and a good team player.\nSingsys is a Singapore based Mobile and Web Applications development company with its offshore development centre based at Lucknow (India). We have a significant number of global and domestic clientele ranging from budding startups to fortune 500 companies in our portfolio.\nWe provide attractive compensation package and opportunity to work on live client projects from clients of international repute. We also provide home cooked healthy lunch as well as tea/snacks for free to all our staff members in our in house cafeteria. Company covers all its employees under extensive group accidental insurance with coverage of Rs. 50 Lakhs.\nAll positions are based at Lucknow (India). Selection will be based on a personal interview held at our Lucknow office. No WFH provided.",
    "link": "https://www.linkedin.com/jobs/view/3538710608/?eBP=CwEAAAGHG0v9zumfliTZyHzAJBUqbCV2_86Ev-fj3uIZr7A8R3u2UhODaPAFDoI6FYNAa0AyR-g1ICENg1Ifrn6k-ulhzSDHFW8DNVxwmw2RrcE0iLY1pwlYlfHD-RLlYiQ3eOFfLaKeiwYvJwKPvFZWHTiyug_WMlVMvPLro79__4F8CJYxuD1K7ruGVt7HedktBsffA4VXudkDifv-IXwfftu4Rnzhbz_mQqr-GWYporTEuOkfSoyTo7p3pN5U2_gLZb2Jj1s3K67Bd2qFDGYGW0qN9D3kI1c3zuOYQ4IVAxWbZti2l3VIPpsJDG_2TFgp_CWn0KoICBOWMqTqM7xrMCshmzm1rMsLY7dd5-KZ5wpIG6TtobNftF6RRmUV3HyXd7hiSTJOWWDOqTiR0GZtgIf8oVR2GA&refId=FWUPmjjxlmOUmYmeVKpcfw%3D%3D&trackingId=kZV3uw8cRw77hE%2B8Z42o9g%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "Protegrity",
    "location": "Mumbai, Maharashtra, India, Remote",
    "description": "About the job\n        \n\n\n        \n                  The global data privacy software market is projected to grow from $2.36 billion in 2022 to $25.85 billion by 2029.\nSo, if you are searching for an innovative career, then the cybersecurity industry might just be the one for you. Protegrity, an international provider of data protection solutions, is looking for new team members who want to make an impact in a company that prioritizes something we all care about: our privacy.\nWe need people who recognize the opportunity, can plan effectively, take action and execute in the enterprise marketplace with our intuitive, diverse, and future-forward global teams.\nSo, are you up for collaborating with the best in data security?\nJoin us on this journey and make an impact with one of the top 25 global software providers. We look forward to making our world become a better place with you on our team.\nApply and discover what’s next today!\nAs a software engineer with Protegrity’s talented product development team you will contribute to cutting-edge research, development and feature design/implementation in a fast-paced Agile environment. This position is perfect for smart technical individuals who enjoy building technology, working in a team of talented engineers and being part of end-to-end product delivery life cycle.\nTo qualify, you should have 3-5 years of relevant experience in developing & integrating scalable solutions. You should be highly versatile with full stack application programming and software application design concepts and aware with the latest trends in technology.\nResponsibilities may include but not be limited to\n Contribute to continuous development, enhancement and maintenance of existing and new products/features Contribute to appropriate software development methods, standards, tools to achieve well engineered outcome. Ability to work independently by applying development practices used by the team/organization including usage of design patterns, frameworks, programming/debugging environments, IDEs etc. Participating in Agile practices of the team/organization as an individual contributor and a team player. Adaptability to learn and enhance skills in the domain of data security alongside the product’s technical environment (like OS, cloud technology, container orchestration, native programming language of the environment, hardware etc.) Ability to review work of peer engineers/juniors alongside being an individual contributor. Excellent collaboration abilities within and across teams for technical requirements and product module dependencies. Ability to be a good team player and soft skilled person.\nIn addition to the qualifications a successful candidate will demonstrate\n 3+ years post-bachelor’s degree experience as software engineer in developing & integrating big data and/or cloud solutions. Knowledge on modern scalable/elastic systems in cloud like Databricks/ HDInisghts/ Dataflow/ Cloudera Data Platform/Big Query/Synapse etc. Any or multiple is desirable. Knowledge of large-scale SQL engines like Hive, Presto, SparkSQL etc. Experience on any or multiple of programming languages like Java/Python/Go/C++ Knowledge of Public Cloud technologies like AWS/GCP/Azure Understanding of containerized platforms like Kubernetes or Openshift Specifying, Designing, implementing and debugging high-performance Big Data and Cloud systems Experience on Linux OS and Shell Scripting Capability to specify, design, implement, debug and profile high-performance web application software. Should be strong at debugging, troubleshooting, profiling own’s code as well as reviewing that of peers. Sufficient knowledge of office productivity tools to represent formal exchange of technical content communication. Excellent verbal and written communication skills along with good rapport and collaboration with teammates within the team.\nGood to have skills -\n Knowledge of operating systems and concepts. Linux & Windows is the preference. Knowledge of creating and operating any multi node cluster like Hadoop. Knowledge of creating and operating any containerized platform like Kubernetes in cloud Knowledge of software performance measurements and tuning Understanding of software security requirements and associated standards like NIST, OWASP, PCI-DSS etc. Has gone through a devops cycle, CI/CD pipelines and software test automations. Knowledge of cryptography and cryptographic algorithms Knowhows of Agile process for product delivery.\nPreferred Qualifications\n Background to computer science and systems Experience on Java & Python programming language Knowledge of Public Cloud technologies like AWS/GCP/Azure Knowledge on modern scalable/elastic systems in cloud like Databricks/ HDInisghts/ Dataflow/ Cloudera Data Platform(CDP)/Big Query/Synapse etc. Any or multiple is desirable.\nWe offer a competitive salary and comprehensive benefits with generous vacation and holiday time off. All employees are also provided access to ongoing learning & development.\nEnsuring a diverse and inclusive workplace is our priority. We are committed to an environment of acceptance where you are free to bring your full self to work. All qualified applicants and current employees will not be discriminated against on the basis of race, color, religion, sex, sexual orientation, gender identity, age, national origin, disability or veteran status.",
    "link": "https://www.linkedin.com/jobs/view/3538710608/?eBP=CwEAAAGHG0v9zumfliTZyHzAJBUqbCV2_86Ev-fj3uIZr7A8R3u2UhODaPAFDoI6FYNAa0AyR-g1ICENg1Ifrn6k-ulhzSDHFW8DNVxwmw2RrcE0iLY1pwlYlfHD-RLlYiQ3eOFfLaKeiwYvJwKPvFZWHTiyug_WMlVMvPLro79__4F8CJYxuD1K7ruGVt7HedktBsffA4VXudkDifv-IXwfftu4Rnzhbz_mQqr-GWYporTEuOkfSoyTo7p3pN5U2_gLZb2Jj1s3K67Bd2qFDGYGW0qN9D3kI1c3zuOYQ4IVAxWbZti2l3VIPpsJDG_2TFgp_CWn0KoICBOWMqTqM7xrMCshmzm1rMsLY7dd5-KZ5wpIG6TtobNftF6RRmUV3HyXd7hiSTJOWWDOqTiR0GZtgIf8oVR2GA&refId=FWUPmjjxlmOUmYmeVKpcfw%3D%3D&trackingId=kZV3uw8cRw77hE%2B8Z42o9g%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "Yarikul Infotech",
    "location": "Srinagar, Jammu & Kashmir, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  The ideal candidate will be responsible for developing high-quality applications. They will also be responsible for designing and implementing testable and scalable code.  Must Haves:Candidate must be living in or willing to work from our Srinagar, Jammu & Kashmir officeMust not be bound by a specific programming languageWilling to learn and switch programming languages and technologiesPrior experience in Fullstack Software DevelopmentEnthusiasm to explore and learn new technologies on their own and share your knowledge\nResponsibilities:Write high-quality, scalable, and testable code for our Web-based ERP softwareDesign, Develop and Maintain new features and modules for our ERP Software\nQualifications:Bachelor's degree or equivalent experience in Computer Science or a related fieldExperience in Web DevelopmentExperience in MVC frameworks in Front end and Back end languages.SQL database or relational database skillsProblem-solving skills\nSalient Features:A competitive SalaryFriendly and relaxed work environmentOpportunity to take Paid courses and learn new skillsFlexible working hoursOpportunity to travel abroad",
    "link": "https://www.linkedin.com/jobs/view/3538710608/?eBP=CwEAAAGHG0v9zumfliTZyHzAJBUqbCV2_86Ev-fj3uIZr7A8R3u2UhODaPAFDoI6FYNAa0AyR-g1ICENg1Ifrn6k-ulhzSDHFW8DNVxwmw2RrcE0iLY1pwlYlfHD-RLlYiQ3eOFfLaKeiwYvJwKPvFZWHTiyug_WMlVMvPLro79__4F8CJYxuD1K7ruGVt7HedktBsffA4VXudkDifv-IXwfftu4Rnzhbz_mQqr-GWYporTEuOkfSoyTo7p3pN5U2_gLZb2Jj1s3K67Bd2qFDGYGW0qN9D3kI1c3zuOYQ4IVAxWbZti2l3VIPpsJDG_2TFgp_CWn0KoICBOWMqTqM7xrMCshmzm1rMsLY7dd5-KZ5wpIG6TtobNftF6RRmUV3HyXd7hiSTJOWWDOqTiR0GZtgIf8oVR2GA&refId=FWUPmjjxlmOUmYmeVKpcfw%3D%3D&trackingId=kZV3uw8cRw77hE%2B8Z42o9g%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer Intern",
    "companyName": "MHTECHIN",
    "location": "Aurangabad, Maharashtra, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  MHTECHIN is changing the way global brands and their agencies advertise to audiences around the world. How? With a media buying platform that helps brands deliver a more insightful and relevant ad experience for consumers – and sets a new standard for global reach, accuracy, and transparency. We are proud of the culture we have built. We value the unique experiences and perspectives that each person brings to The Trade Desk, and we are committed to fostering inclusive spaces where everyone can bring their authentic selves to work every day.\nInternship Period: Total 6 months internship\nWhat You’ll Do\nOwn and ship a meaningful project, end-to-end. We believe strongly in ownership at The Trade Desk, and we are committed to you having something substantial to show for your time here that will make a positive Impact for the teamReceive close, one-on-one mentorship from an experienced software engineerCollaborate with a globally connected team of engineers, Interns & other teams and departments in cities across the worldWork with new technologies across a wide spectrum of computer science, including distributed systems, petabyte-scale data processing, machine learning/AI, and UI/UX\nWho you are\nYou might be a great fit for a Software Engineer internship at MHTECHIN if:\nYou are fluent in one or more modern programming languagesHave a firm grasp of basic data structures and algorithmic techniquesYou are a quick and self-directed learner. We provide close support and mentorship, but you will have ownership over the design, plan, and implementation of what you build.Enrolled in a bachelor's degree in Computer Science / Engineering / IT or a related programHave a graduation date between Summer 2022 to Winter 2027\n\nMHTECHIN does not accept unsolicited resumes from search firm recruiters. Fees will not be paid in the event a candidate submitted by a recruiter without an agreement in place is hired; such resumes will be deemed the sole property of MHTECHIN. The Trade Desk is an equal-opportunity employer. All aspects of employment will be based on merit, competence, performance, and business needs. We do not discriminate on the basis of race, color, religion, marital status, age, national origin, ancestry, physical or mental disability, medical condition, pregnancy, genetic information, gender, sexual orientation, gender identity or expression, veteran status, or any other status protected under federal, state, or local law.",
    "link": "https://www.linkedin.com/jobs/view/3538710608/?eBP=CwEAAAGHG0v9zumfliTZyHzAJBUqbCV2_86Ev-fj3uIZr7A8R3u2UhODaPAFDoI6FYNAa0AyR-g1ICENg1Ifrn6k-ulhzSDHFW8DNVxwmw2RrcE0iLY1pwlYlfHD-RLlYiQ3eOFfLaKeiwYvJwKPvFZWHTiyug_WMlVMvPLro79__4F8CJYxuD1K7ruGVt7HedktBsffA4VXudkDifv-IXwfftu4Rnzhbz_mQqr-GWYporTEuOkfSoyTo7p3pN5U2_gLZb2Jj1s3K67Bd2qFDGYGW0qN9D3kI1c3zuOYQ4IVAxWbZti2l3VIPpsJDG_2TFgp_CWn0KoICBOWMqTqM7xrMCshmzm1rMsLY7dd5-KZ5wpIG6TtobNftF6RRmUV3HyXd7hiSTJOWWDOqTiR0GZtgIf8oVR2GA&refId=FWUPmjjxlmOUmYmeVKpcfw%3D%3D&trackingId=kZV3uw8cRw77hE%2B8Z42o9g%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  }
]