[
  {
    "site": "LinkedIN",
    "title": "Software Engineer (Entry Level)",
    "companyName": "MRI Software",
    "location": "Bangalore Rural, Karnataka, India, ",
    "description": "About the job\n        \n\n\n        \n                  We are currently seeking a Junior Software Engineer to work within our global Product Development department working to apply defined software development life cycle processes to deliver production ready code of the highest quality, this individual will be diligent in testing their code and working with the team to produce\nMRI Software’s high standard product. This individual will work under the Agile development methodology in a cross-functional environment with other groups, both inside and outside the department including Product Management and Documentation, as well as create and test code in our dynamic team setting\nResponsibilities\nApplies defined practices and procedures to design, implement, and support software projectsBuilds effective working relationships with team membersActively seeks assistance as needed but demonstrates learning and growing independenceActively seeks guidance for prioritization and review of deliverables.Performs and designs testing protocols to ensure that the product is fully tested.\nRequirements\nCurrently pursuing a BE, Btech, MCA, MSC, or BCA Computer Science or related technical field (2022 Passout may also apply)Experience developing software or algorithms based on predetermined specificationsKnowledge of object-oriented programming, Microsoft .Net or Java preferredProficient with Source Control tools Familiarity with database objects (tables, stored procedures, queries, etc.) a plusAttention to detail is a mustGood written and verbal communication skills\nBenefits\nAbility to learn leading technical / industry standards and technologiesFlexible working arrangements (2 days in the office)Annual performance-related bonusHealth insurance6x Flexi Fridays: knock 2.5 hours off your day on a FridayEngaging, fun & inclusive culture: check out the MRI Software APAC Insta feed and stories!\nAbout The Business\nMRI Software is a global Proptech leader delivering innovative applications and hosted solutions that free real estate companies to elevate their business. \nOur flexible technology platform, along with an open and connected ecosystem, allows us to meet the unique needs of real estate businesses, from property-level management and accounting, to investment modeling and analytics for the global commercial and residential markets. With nearly five decades of expertise and insight, we have grown to include offices in across the United States, the United Kingdom, Hong Kong, Singapore, Australia, South Africa, New Zealand, Canada, and India, with over 3000 team members to support our clients and their unique needs!\nMRI is proud to be an Equal Employment Opportunity employer.",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=14%2B3KiTT%2Bqlngay73zmTBw%3D%3D&trackingId=l1BMJy62t80VHxUqnLVYHg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software System Engineer",
    "companyName": "ICU Medical",
    "location": "Chennai, Tamil Nadu, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Job Title\n\nSystem Engineer/Senior System Engineer\n\nPosition Summary\n\nSeeking a system engineer to work with a dynamic, research-oriented engineering group. The individual should demonstrate strong technical skills in Software Engineering and ability to work with functional requirements. Candidate should have experience or exposure to Product Development that cut across preferably a combined software and hardware system. Experience in documenting the designs, architecture & requirements are important.\n\nEssential Duties & Responsibilities\n Work as a system engineer specialist cutting across software, hardware, software design & architecture, modeling and requirements Collaborate with stakeholders to identify requirements for business needs Collaborate with engineering and verifications teams to ensure the alignment of the requirements Keep current with technical and industry developments\nKnowledge, Skills & Qualifications\n 5-10 years’ experience doing software development, software architecture, systems engineering Software development areas of interest Java/JavaScript/Python/HTML/CSS/Angular Cloud-based development using AWS Web technologies Database design Networking Software requirements Software architecture UML\nEducation and Experience\n Bachelor’s degree in Engineering or equivalent Overall experience of 5 to 10 years in the field of Software Engineering\nMinimum Qualifications\n Must be 18 years of age Must pass pre-employment drug screen and background check\nTravel Requirements\n Typically requires travel less than 5% of the time\nPhysical Requirements and Work Environment\n This is largely a sedentary role. This job operates in a professional office environment and routinely uses standard office equipment. May need to lift and transport moderately heavy objects, such as computers or peripherals.\nICU Medical is an Affirmative Action and Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or protected veteran status and will not be discriminated against on the basis of disability.\n\nNot Applicable\n\nPrimary Location\n\nIN-TN-Chennai\n\nSchedule\n\nFull-time\n\nShift\n\nDay Job\n\nTravel\n\nYes, 5 % of the Time",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=14%2B3KiTT%2Bqlngay73zmTBw%3D%3D&trackingId=l1BMJy62t80VHxUqnLVYHg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Lead Software Engineer",
    "companyName": "Quotient Technology Inc.",
    "location": "Bengaluru, Karnataka, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  Quotient is an equal opportunity employer. We celebrate diversity, value inclusion, and foster belonging within our teams. We strongly encourage individuals of all backgrounds, race, national origin, sex, gender, sexual orientation, gender identity, age, religion, marital and parental status, medical conditions, citizenship, and individuals with different and special abilities to apply. If you need reasonable accommodations throughout the recruitment process, please let us know.\n\nAs a member of the Quotient Technology Inc. Business Systems team, you will help build the platform for our online consumer promotion and media products. The technology stack includes Java, Spring(boot), Scala, Solr, Akka, MariaDB, Kubernetes, and GCP-managed services. The ideal candidate will have strong analytical and effective communication skills, with a proactive and self-motivated mindset, and the ability to work efficiently in a dynamic and demanding environment.\n\nWhat You'll Do\nDesign and develop REST APIs using Java, SpringBoot, Hibernate, MariaDB, etc.Develop high-quality code that is unit-tested and code-reviewed.Contribute to the feature design process.Work independently and as part of a team, completing small to large-sized projects while managing competing prioritiesCollaborate with product management to gather requirements and other cross-functional teams to deliver a high-quality product\n\nWhat You'll Bring\nBE/Btech in Computer Science (or equivalent) and 7+ years of hands-on relevant experienceStrong understanding of core CS fundamentals (Algorithms, Data Structures)Strong backend engineering background using Java, Scala, or other object-oriented languages with experience using Spring FrameworkHands-on experience with database technologies - MariaDB, MySQL, MSSQL, etc.\n\nDesirable skills:\nExperience in designing & developing Docker-based micro-services platforms.Experience in developing cloud-native applications.Keen ability to understand the end-user experience and business needs.\n\nLIFE AT QUOTIENT\n\nWe look for people with the skills and passion to thrive at a company where innovation is the norm, collaboration is paramount, and fun is always part of the mix! Come join our amazing team!\n\nIntegrity - We do the right thing, no exceptions.\n\nCustomer Service - We are obsessed with our customers, internal and external.\n\nTeamwork - We work with trust and respect, treating our company as it was our own.\n\nInnovation - We look for better ways to do everything, never settling for the status quo.\n\nSustainable Growth - We constantly look for ways to grow the business more efficiently.\n\nQ-crew Perks And Benefits\n\nAt Quotient, we want you to have a healthy, rewarding, balanced and meaningful experience – both at work and in life. From traditional medical coverage to flexible time off to helping you save for your future, we’re committed to providing you the best benefits.\n\nAbout Quotient\n\nQuotient (NYSE: QUOT) is the leading digital media and promotions technology company that creates cohesive omnichannel brand-building and sales-driving opportunities to deliver valuable outcomes for advertisers, retailers and consumers. The Quotient platform is powered by exclusive consumer spending data, location intelligence and purchase intent data to reach millions of shoppers daily and deliver measurable, incremental sales. Quotient partners with leading advertisers and retailers, including Clorox, Procter & Gamble, General Mills, Unilever, Albertsons Companies, CVS, Dollar General and Peapod Digital Labs, a company of Ahold Delhaize USA. Quotient is headquartered in Salt Lake City, Utah, and has offices across the US as well as in Bangalore, Paris, London and Tel Aviv. For more information visit www.quotient.com",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=14%2B3KiTT%2Bqlngay73zmTBw%3D%3D&trackingId=l1BMJy62t80VHxUqnLVYHg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer",
    "companyName": "Bazaarvoice",
    "location": "Bangalore Urban, Karnataka, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  About Bazaarvoice\n\nAt Bazaarvoice, we create smart shopping experiences. Through our expansive global network, product-passionate community & enterprise technology, we connect thousands of brands and retailers with billions of consumers. Our solutions enable brands to connect with consumers and collect valuable user-generated content, at an unprecedented scale. This content achieves global reach by leveraging our extensive and ever-expanding retail, social & search syndication network. And we make it easy for brands & retailers to gain valuable business insights from real-time consumer feedback with intuitive tools and dashboards. The result is smarter shopping: loyal customers, increased sales, and improved products.\n\nThe problem we are trying to solve : Brands and retailers struggle to make real connections with consumers. It's a challenge to deliver trustworthy and inspiring content in the moments that matter most during the discovery and purchase cycle. The result? Time and money spent on content that doesn't attract new consumers, convert them, or earn their long-term loyalty.\n\nOur brand promise : closing the gap between brands and consumers.\n\nFounded in 2005, Bazaarvoice is headquartered in Austin, Texas with offices in North America, Europe, Asia and Australia.\n\nIt’s official: Bazaarvoice is a Great Place to Work in the US , Australia , India , Lithuania, and the UK !\n\nWhat Will You Do\n\nYou'll be part of a highly skilled distributed team that is responsible for developing and supporting BV's content storage. The system is a highly scalable, multi-datacenter, globally distributed JSON datastore system built on top of Apache Cassandra and Kafka. It offers global consistent snapshots and a built-in streaming data platform that powers billions of requests per day serving our user-generated content. We are interested in engineers who are hands-on and willing to dig into tough problems. We love people who are willing to explore new areas, learn quickly, and apply their skills to challenging issues.\n\nKey Responsibilities\n\nDeliver improvements to content storage systems by working with product owners, develops, devops and QA to understand the needs of our customers.\n\nDesign, code and review changes - applying an end-to-end quality mindset to ensure the highest degree of stability and performance.\n\nRequired Skills\n\nWhat Do We Want:\n\n4 or more years’ experience with content storage in distributed databases(Big Data)\n\nExpert knowledge in Java and Apache Cassandra\n\nDemonstrated experience with Kafka\n\nExperience with SQL-like RDBMS (eg: mySQL, Postgres, Oracle)\n\nExceptional experience working within cloud technologies such as AWS\n\nDesired Skills\n\nUnderstanding of Python or other scripting languages\n\nAbility to collaborate with others\n\nDesire to grow and take ownership of work\n\nAren't afraid to take on less glamorous work if it helps the team accomplish their mission\n\nExperience with Agile or Kanban / Lean software development methodologies\n\nEducational Qualifications\n\nB.E/ B.Tech/M.E/M.Tech or equivalent\n\nKey Skills\nContent storage in distributed databases(Big Data)Java and Apache CassandraKafkaSQL-like RDBMS (eg: mySQL, Postgres, Oracle) AWS\n\n₹15,00,000 - ₹35,00,000 a year\n\nWhy join Bazaarvoice?\n\nCustomer is key\n\nWe see our own success through our customers’ outcomes.\n\nWe approach every situation with a customer first mindset.\n\nTransparency & Integrity Builds Trust\n\nWe believe in the power of authentic feedback because it’s in our DNA.\n\nWe do the right thing when faced with hard choices. Transparency and trust accelerate our collective performance.\n\nPassionate Pursuit of Performance\n\nOur energy is contagious, because we hire for passion, drive & curiosity.\n\nWe love what we do, and because we’re laser focused on our mission.\n\nInnovation over Imitation\n\nWe seek to innovate as we are not content with the status quo.\n\nWe embrace agility and experimentation as an advantage.\n\nStronger Together\n\nWe bring our whole selves to the mission and find value in diverse perspectives.\n\nWe champion what’s best for Bazaarvoice before individuals or teams.\n\nAs a stronger company we build a stronger community.\n\nCommitment to diversity and inclusion\n\nBazaarvoice provides equal employment opportunities (EEO) to all team members and applicants according to their experience, talent, and qualifications for the job without regard to race, color, national origin, religion, age, disability, sex (including pregnancy, gender stereotyping, and marital status), sexual orientation, gender identity, genetic information, military/veteran status, or any other category protected by federal, state, or local law in every location in which the company has facilities. Bazaarvoice believes that diversity and an inclusive company culture are key drivers of creativity, innovation and performance. Furthermore, a diverse workforce and the maintenance of an atmosphere that welcomes versatile perspectives will enhance our ability to fulfill our vision of creating the world’s smartest network of consumers, brands, and retailers.",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=14%2B3KiTT%2Bqlngay73zmTBw%3D%3D&trackingId=l1BMJy62t80VHxUqnLVYHg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer",
    "companyName": "DMI (Digital Management, LLC)",
    "location": "Tourism in Mizoram, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  DMI is a global professional services company that specializes in digital strategy, design, transformation, and support. More than your basic systems integrator or big-box advisor, we are a new breed of partner that blends human-centric consulting and design with agile engineering, delivery, and global scale. We believe that digital transformation is an end-to-endless evolutionary process that requires technology solutions and partners that meet organizations where they are. Consultants at the core, DMI has been delivering mission-critical, enterprise grade solutions since 2002 for more than a hundred Fortune 1,000 enterprises, various state and local government agencies and all fifteen U.S. federal departments. DMI has grown to 2,100+ employees globally and has been continually recognized by top industry analysts as well as a Top Workplace in the USA and Remote.\nDMInc.com | Careers | Twitter | LinkedIn | Facebook\nAbout The Opportunity\nDMIis looking for a Senior Software Engineer to join our Salesforce practice. The SSE will guide Salesforce custom solution development and consultatively recommend Salesforce best in class solutions.\nDuties And Responsibilities\n Develop solutions built on Salesforce platform  Build scalable, extensible, and secure applications  Implementation of custom APEX classes, triggers and flows necessary for achieve client business goals  Package and deploy Salesforce solutions, as applicable  Creation of technical design documentation  Collaborating with the Salesforce Administrator to validate business requirements and any considerations (security, scalability, limits)  Develop Apex (classes and triggers), Visualforce, and Lightning Web Components, (based on specific requirements), to extend Salesforce to support business requirements  Custom User Interface development, including Visualforce pages/Lightning pages, Aura Components and Lightning Web Components  Integrations: Use Salesforce APIs to integrate with other systems used in the organization  Best Practices: Adhere to Salesforce best practices, maintain code documentation, and write / maintain test classes for all custom development  Experience designing and developing service-oriented architecture with integration and migration background  Take ownership of release cycles to implement and deploy new/updates to existing applications and code  Integrating and maintaining business applications to Salesforce  Collaborating with IT / Developers for other systems to integrate across the business \nQualifications\nEducation and Years of Experience:  B achelors in Information Systems, Computer Science or equivalent work experience and 5+ years of Salesforce development and consulting experience\nRequired And Desired Skills/Certifications Strong experience working with Salesforce APIs and ability to manage integration with enterprise systems  Experience implementing and developing in Apex, LWC, Visualforce, Aura Components and Java  Strong communication skills and ability to collaborate effectively in a geographically dispersed working environment  Ability to work independently as well as manage a team of developers  Ability to adapt to time critical deadlines and changing priorities in a fast-paced environment  Proficient with Salesforce Lightning Design System  Knowledge of version control systems, DevOps, and software development methodologies  Strong presentation, communication, and business ethics  Ability to write, interpret, and critique technical specifications  Certifications: Salesforce Platform App Builder  Salesforce Platform Developer I  Salesforce Platform Developer II  Salesforce Administrator  MuleSoft Certifications a plus \nDesired Skills\n Experience working as a member of an agile development team  Experience working with MDM solutions  Experience working as a member of a consulting firm  Work/certifications with Salesforce growth technologies like CPQ, FSL, or MuleSoft is a plus \nAdditional Requirements\nMin Citizenship Status Required:\nPhysical Requirements: No Physical requirement needed for this position.\nLocation: India\nWorking at DMI\nThe Following Categories Make Up Your DMI Wellbeing\nDMI is a diverse, prosperous and rewarding place to work. Being part of the DMI family means we care about your wellbeing. As such, we offer a variety of perks and benefits that help meet various interests and needs, while still having the opportunity to work directly with a number of our award winning, Fortune 1000 clients.\n Community – Blood drives, volunteering opportunities, Holiday parties, summer picnics, Tech Chef, Octoberfest just to name a few ways DMI comes together as a community.  Convenience/Concierge - Virtual visits through health insurance, pet insurance, commuter benefits, discount tickets for movies, travel and many other items to provide convenience.  Development – Annual performance management, continuing education and tuition assistance, internal job opportunities along with career enrichment and advancement to help each employee with their professional and personal development.  Financial – Generous 401k match for both pre-tax and post-tax (ROTH) contributions along with financial wellness education, EAP, Life Insurance and Disability help provide financial stability for each DMI employee.  Recognition – Great achievements do not go unnoticed by DMI through Annual Awards ceremony, service anniversaries, peer-to-peer acknowledgement through Give-A-Wow, employee referral bonuses.  Wellness – Healthcare benefits, Wellness programs, Flu Shots, Biometric screenings, on-site lactation rooms provide employees with several wellness options. \nEmployees are valued for their talents and contributions. We all take pride in helping our customers achieve their goals, which in turn contributes to the overall success of the company.\nThe company does and will take affirmative action to employ and advance in employment individuals with disabilities and protected veterans, and to treat qualified individuals without discrimination on the basis of their physical or mental disability or veteran status. DMI is an Equal Opportunity Employer Minority/Female/Veterans/Disability. DMI maintains a drug-free workplace.\n***************** No Agencies Please *****************\nApplicants selected may be subject to a government security investigation and must meet eligibility requirements for access to classified information. US citizenship may be required for some positions.\nJob ID:  2023-24780",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=14%2B3KiTT%2Bqlngay73zmTBw%3D%3D&trackingId=l1BMJy62t80VHxUqnLVYHg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer",
    "companyName": "Equiniti",
    "location": "Chennai, Tamil Nadu, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Role Description:\n\nThis role would be suitable for someone that has an applications development background and an excellent understanding of the Software Development Lifecycle.\n\nCore duties and responsibilities:\n\nAs a Senior Software Engineer you will be involved in:\nDelivery of solutions across all of the businesses internal applications for EQ BoardroomDelivering quality softwareInvolved in discussions around designWorking across globally dispersed teamsKeep up to date with current technologies, design patterns and tools\n\nSkills, Attributes and Behaviour:\n\nKey Requirements:\n.NET C#Visual StudioTeam Foundation Server (TFS) or similar code management toolTFS build/deploy knowledgeJavaScript/JQueryStrong working knowledge in SQL ServerKnowledge in WiX projectsMVCExposure/knowledge in Classic ASP is an plusStrong knowledge in HTML/CSS/SharepointKnowledge on debugging issues in IIS/Dot Net/SQL Server\n\nImportantly the candidate must be willing to work in maintenance/ support role, in UK time zone. \n\nWe are committed to equality of opportunity for all staff and applications from individuals are encouraged regardless of age, disability, sex, gender reassignment, sexual orientation, pregnancy and maternity, race, religion or belief and marriage and civil partnerships. Please note any offer of employment is subject to satisfactory pre-employment screening checks.",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=14%2B3KiTT%2Bqlngay73zmTBw%3D%3D&trackingId=l1BMJy62t80VHxUqnLVYHg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer I",
    "companyName": "Eventbrite",
    "location": "India, Remote",
    "description": "About the job\n        \n\n\n        \n                  THE CHALLENGE\nEventbrite's business continues to grow and scale rapidly, powering millions of events. Event creators and event goers need new tools and technologies that empower them to have the most meaningful live experiences. As a Software Engineer at Eventbrite, you will build beautiful, responsive, delightful and intuitive user interfaces that people are excited to use\nTHE TEAM\nWe're a people-focused Engineering organization: the women and men on our team value working together in small teams to solve big problems, supporting an active culture of mentorship and inclusion, and pushing themselves to learn new things daily. Pair programming, weekly demos, tech talks, and quarterly hackathons are at the core of how we’ve built our team and product. We believe in engaging with the community, regularly hosting free events with some of the top technical speakers, and actively contributing to open source software (check out Britecharts as an example!). Our technology spans across web, mobile, API, big data, machine learning, search, physical point of sale, and scanning systems. To learn more about some of the frontend teamwork, check out our frontend blog\nTHE SKILL SET\nAdvanced English Level1-2 years of experience working in a Software Development role Experience with or the excitement to work with Python and Django web frameworkUnderstanding that great code is also maintainable codeYou care about making sure your code is well testedA result driven self starter with great communication and collaboration skillsUnit-testing know-how required, experience with TDD or BDD is an added bonusKnowledge of front-end technologies (HTML, CSS, Ajax, Javascript)Database experience (ideally MySQL, NoSQLis a plus)OOP/OOD knowledge\nBONUS POINTS\nExperience with AWS and developing APIsExperience using non-relational databasesFamiliarity with Eventbrite and a passion for live events\nWhat We Offer\nAt Eventbrite, we strive to support our Britelings and their loved ones through different stages of life with robust and attractive benefits, financial and physical wellness options, and great perks. In addition to offering a competitive salary and company stock, we have other great benefits available. In the Briteland, you’ll find great medical plans, fertility and adoption benefits, wellness reimbursement, generous parental leave, and much more.\nWe Care About Your Mental Health And Wellbeing.\nOur employees enjoy free coaching sessions with Modern Health. We also offer free therapy sessions with a psychologist. You’ll also have access to private medical insurance for you and your family, that includes dental care. And our wellness program to pay for your gym expenses.\nWe work hard to cultivate a diverse, equitable and inclusive culture where Britelings feel like they belong.\nEmployees can participate in resource groups and we offer programming throughout the year to support a diverse and inclusive workplace.\nWe offer ongoing training and career development that meets people where they are in their careers.\nWe offer unlimited access to courses in Udemy, leadership coaching for all managers, Briteling led talks, and weekly company-wide town halls with our CEO. We take culture seriously and design programs with employee feedback in mind to make Eventbrite a great place to work no matter where you work from in the world.\nWork-life balance & flexibility is extremely important to us.\nOur employees can choose what works best for them: work in one of our offices, be fully remote or the best of both worlds! We believe in a flexible working environment to allow Britelings to perform at their best ensuring a healthy work-life balance. We have recently implemented Britebreak Fridays: all Britelings turn off their computers and take the first Friday of every month off to focus on their wellbeing.\nAbout Eventbrite\nEventbrite is a global self-service ticketing and experience technology platform that serves a community of hundreds of thousands of event creators in nearly 180 countries. Since inception, Eventbrite has been at the center of the experience economy, transforming the way people organize and attend events. The company was founded by Julia Hartz, Kevin Hartz and Renaud Visage, with a vision to build a self-service platform that would make it possible for anyone to create and sell tickets to live experiences. The Eventbrite platform provides an intuitive, secure, and reliable service that enables creators to plan and execute their live and online events, whether it’s an annual culinary festival attracting thousands of foodies, a professional webinar, a weekly yoga workshop or a youth dance class. With over 290 million tickets distributed for over 5 million total events in 2021, Eventbrite is where people all over the world discover new things to do or new ways to do more of what they love. Learn more at www.eventbrite.com .\nIS THIS ROLE NOT AN EXACT FIT?\nSign up to keep in touch and we’ll let you know when we have new positions on our team .\nEventbrite is committed to equality of opportunity for all staff, and applications from all suitably qualified individuals are encouraged, regardless of age, disability, sex, gender reassignment, sexual orientation, pregnancy and maternity, race, religion or belief and marriage and civil partnerships.\nApplicant Privacy Notice",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=14%2B3KiTT%2Bqlngay73zmTBw%3D%3D&trackingId=l1BMJy62t80VHxUqnLVYHg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer I",
    "companyName": "Eventbrite",
    "location": "India, Remote",
    "description": "About the job\n        \n\n\n        \n                  THE CHALLENGE\nEventbrite's business continues to grow and scale rapidly, powering millions of events. Event creators and event goers need new tools and technologies that empower them to have the most meaningful live experiences. As a Software Engineer at Eventbrite, you will build beautiful, responsive, delightful and intuitive user interfaces that people are excited to use\nTHE TEAM\nWe're a people-focused Engineering organization: the women and men on our team value working together in small teams to solve big problems, supporting an active culture of mentorship and inclusion, and pushing themselves to learn new things daily. Pair programming, weekly demos, tech talks, and quarterly hackathons are at the core of how we’ve built our team and product. We believe in engaging with the community, regularly hosting free events with some of the top technical speakers, and actively contributing to open source software (check out Britecharts as an example!). Our technology spans across web, mobile, API, big data, machine learning, search, physical point of sale, and scanning systems. To learn more about some of the frontend teamwork, check out our frontend blog\nTHE SKILL SET\nAdvanced English Level1-2 years of experience working in a Software Development role Experience with or the excitement to work with Python and Django web frameworkUnderstanding that great code is also maintainable codeYou care about making sure your code is well testedA result driven self starter with great communication and collaboration skillsUnit-testing know-how required, experience with TDD or BDD is an added bonusKnowledge of front-end technologies (HTML, CSS, Ajax, Javascript)Database experience (ideally MySQL, NoSQLis a plus)OOP/OOD knowledge\nBONUS POINTS\nExperience with AWS and developing APIsExperience using non-relational databasesFamiliarity with Eventbrite and a passion for live events\nWhat We Offer\nAt Eventbrite, we strive to support our Britelings and their loved ones through different stages of life with robust and attractive benefits, financial and physical wellness options, and great perks. In addition to offering a competitive salary and company stock, we have other great benefits available. In the Briteland, you’ll find great medical plans, fertility and adoption benefits, wellness reimbursement, generous parental leave, and much more.\nWe Care About Your Mental Health And Wellbeing.\nOur employees enjoy free coaching sessions with Modern Health. We also offer free therapy sessions with a psychologist. You’ll also have access to private medical insurance for you and your family, that includes dental care. And our wellness program to pay for your gym expenses.\nWe work hard to cultivate a diverse, equitable and inclusive culture where Britelings feel like they belong.\nEmployees can participate in resource groups and we offer programming throughout the year to support a diverse and inclusive workplace.\nWe offer ongoing training and career development that meets people where they are in their careers.\nWe offer unlimited access to courses in Udemy, leadership coaching for all managers, Briteling led talks, and weekly company-wide town halls with our CEO. We take culture seriously and design programs with employee feedback in mind to make Eventbrite a great place to work no matter where you work from in the world.\nWork-life balance & flexibility is extremely important to us.\nOur employees can choose what works best for them: work in one of our offices, be fully remote or the best of both worlds! We believe in a flexible working environment to allow Britelings to perform at their best ensuring a healthy work-life balance. We have recently implemented Britebreak Fridays: all Britelings turn off their computers and take the first Friday of every month off to focus on their wellbeing.\nAbout Eventbrite\nEventbrite is a global self-service ticketing and experience technology platform that serves a community of hundreds of thousands of event creators in nearly 180 countries. Since inception, Eventbrite has been at the center of the experience economy, transforming the way people organize and attend events. The company was founded by Julia Hartz, Kevin Hartz and Renaud Visage, with a vision to build a self-service platform that would make it possible for anyone to create and sell tickets to live experiences. The Eventbrite platform provides an intuitive, secure, and reliable service that enables creators to plan and execute their live and online events, whether it’s an annual culinary festival attracting thousands of foodies, a professional webinar, a weekly yoga workshop or a youth dance class. With over 290 million tickets distributed for over 5 million total events in 2021, Eventbrite is where people all over the world discover new things to do or new ways to do more of what they love. Learn more at www.eventbrite.com .\nIS THIS ROLE NOT AN EXACT FIT?\nSign up to keep in touch and we’ll let you know when we have new positions on our team .\nEventbrite is committed to equality of opportunity for all staff, and applications from all suitably qualified individuals are encouraged, regardless of age, disability, sex, gender reassignment, sexual orientation, pregnancy and maternity, race, religion or belief and marriage and civil partnerships.\nApplicant Privacy Notice",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=14%2B3KiTT%2Bqlngay73zmTBw%3D%3D&trackingId=l1BMJy62t80VHxUqnLVYHg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Developer III - Software Engineering",
    "companyName": "UST",
    "location": "Thiruvananthapuram, Kerala, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Job Description\n\nRole Proficiency:\n\nIndependently develops error free code with high quality validation of applications guides other developers and assists Lead 1 – Software Engineering\n\nOutcomes\n Understand and provide input to the application/feature/component designs; developing the same in accordance with user stories/requirements. Code debug test document and communicate product/component/features at development stages. Select appropriate technical options for development such as reusing improving or reconfiguration of existing components.  Optimise efficiency cost and quality by identifying opportunities for automation/process improvements and agile delivery models Mentor Developer 1 – Software Engineering and Developer 2 – Software Engineering to effectively perform in their roles Identify the problem patterns and improve the technical design of the application/system Proactively identify issues/defects/flaws in module/requirement implementation Assists Lead 1 – Software Engineering on Technical design. Review activities and begin demonstrating Lead 1 capabilities in making technical decisions\nMeasures Of Outcomes\n Adherence to engineering process and standards (coding standards) Adherence to schedule / timelines Adhere to SLAs where applicable Number of defects post delivery Number of non-compliance issues Reduction of reoccurrence of known defects Quick turnaround of production bugs Meet the defined productivity standards for project Number of reusable components created Completion of applicable technical/domain certifications Completion of all mandatory training requirements\nCode\n\nOutputs Expected:\nDevelop code independently for the above\nConfigure\nImplement and monitor configuration process\nTest\nCreate and review unit test cases scenarios and execution\nDomain Relevance\nDevelop features and components with good understanding of the business problem being addressed for the client\nManage Project\nManage module level activities\nManage Defects\nPerform defect RCA and mitigation\nEstimate\nEstimate time effort resource dependence for one's own work and others' work including modules\nDocument\nCreate documentation for own work as well as perform peer review of documentation of others' work\nManage Knowledge\nConsume and contribute to project related documents share point libraries and client universities\nStatus Reporting\nReport status of tasks assignedComply with project related reporting standards/process\nRelease\nExecute release process\nDesign\nLLD for multiple components\nMentoring\nMentor juniors on the teamSet FAST goals and provide feedback to FAST goals of mentees\nSkill Examples\n Explain and communicate the design / development to the customer Perform and evaluate test results against product specifications Develop user interfaces business software components and embedded software components 5 Manage and guarantee high levels of cohesion and quality6 Use data models Estimate effort and resources required for developing / debugging features / components Perform and evaluate test in the customer or target environment  Team Player Good written and verbal communication abilities Proactively ask for help and offer help \nKnowledge Examples\n\nAdditional Comments:\n\nNone",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=14%2B3KiTT%2Bqlngay73zmTBw%3D%3D&trackingId=l1BMJy62t80VHxUqnLVYHg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Associate Lead Software Engineer",
    "companyName": "SailPoint",
    "location": "Maharashtra, India, ",
    "description": "About the job\n        \n\n\n        \n                  At SailPoint, we are building the most comprehensive suite of identity governance & management SaaS products in the world. Built from the ground up on a microservices, multi-tenant architecture, our services are focused on enabling organizations to discover, secure, and manage every type of identity.\n\nWe are seeking an experienced and highly technical Staff Software Engineer to join the IdentityNow Product Team. A growing customer base, with an increasing percentage coming from large-scale use cases with high daily transaction volumes means building systems with the capability to automatically handle a growing amount of work. The role demands deep domain experience along with the ability to design and develop large-scale distributed systems. The ability to lead technically in a dynamic and ever evolving environment is crucial to this role.\n\nWe offer a competitive salary, great benefits, excellent work-life balance. Plenty of opportunities to learn, grow and innovate.\n\nResponsibilities :Analyze and refine requirements with Product ManagementSignificant hands-on software development, designing, coding, building software to scale team’s servicesSetting the standard for excellence in engineering by advocating design and coding best practices for the team and cross-teamsLooking beyond the immediate backlog to create and share a forward-facing technical vision for your teamShare support of critical team systems by participating in on-call rotationsOccasionally partner with services to review and contribute to solution architecture\n\nRequirements :8+ years of overall professional software development experience5+ years of experience developing software in Java, leading teams, design and setting technical direction2+ years of experience building web applications in a solving for scale environmentExperience working with one or more from the following: Cloud/AWS, IAM/IGA, Compliance, Security and PrivacyExperience working on a large, full-featured, business-focused productExperience with SQL, large scale databases, and related technologies, such as DynamoDB, Aurora, Postgres, MySQL, and Hibernate or other ORM technologies.Experience with event-based architecture including messaging, queues, and events, such as redis and kafkaA positive and collaborative demeanor, combined with the ability to coach, mentor and delegateStrong communication skills\n\nNice to have:Experience with the Go programming languageExperience guiding technical teams through complex initiatives at scale.Experience engaging directly with customers in critical conversations to understand their needs and respond professionally.\n\nSailPoint is an equal opportunity employer and we welcome everyone to our team. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=14%2B3KiTT%2Bqlngay73zmTBw%3D%3D&trackingId=l1BMJy62t80VHxUqnLVYHg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Sr. SW Engineer - FM Backend",
    "companyName": "Gigamon",
    "location": "Mylapore, Tamil Nadu, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Description\n\nDescription\n\nThe right candidate will design and develop major components of GigaVUE-FM at Gigamon. Working as part of a growing, dynamic team, the candidate will thrive in a cross-functional team environment to lead and achieve project deliverables and will have the opportunity to make a significant impact to the product lines.\n\nResponsibilities\n design and develop features for GigaVUE-FM to manage physical traffic visibility and analysis and extend it into the virtual environments Work effectively with all stakeholders and engineers throughout the lifecycle of the product to deliver a competitive product on time with the right quality Work with customers and third-parties to understand their requirements/feedback and build features that increase the lead Gigamon has in the market\nRequirements\n BS in CS or related field3 to 5 years of professional experience designing and developing complex software using Java, Spring, NMS/EMS, Hibernate, REST, MongoDB, HBase, OpenTSDB etc., Working knowledge of vSphere API, vCenter and ESXi is a plus Working knowledge of Openstack, Amazon EC2 and other cloud platforms and environments is a plus Excellent communication skills",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=14%2B3KiTT%2Bqlngay73zmTBw%3D%3D&trackingId=l1BMJy62t80VHxUqnLVYHg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer",
    "companyName": "Light & Wonder",
    "location": "Chennai, Tamil Nadu, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Gaming:\nWelcome to the world of land-based gaming. Light & Wonder’s gaming team builds cutting-edge technology, products, and content for the most iconic casinos and operators across the globe.\nPosition Summary\nCompany Profile: (Light & Wonder (lnw.com))\nLight & Wonder (erstwhile Scientific Games) creates technology-based products and content for land-based casino gaming, and social and digital organizations worldwide. We are the global leader in cross-platform games and entertainment.\nThrough our amazing game content, technology platforms, and Systems applications, we delight our players with what they want, wherever and whenever - be it online, mobile, or at their favorite land-based casino. We are excited to go all in on creating great games and a seamless player experience across all platforms.\nAt Light & Wonder, all our team members are known as Creators. We empower our creators to innovate, create, and bring fun to the workspace. The core principles that unite our team, guide our actions, and drive our growth are\n Dare to be bold - We always bring courage to work to reach for the unbelievable Celebrate perspectives - We combine diverse talent to look at the familiar in unfamiliar ways Never settle - We relentlessly push forward to create the extraordinary in every detail Uphold integrity - We promote accountability and respect to raise the bar for ourselves and the industry Win as a team - We bring out the best in each other to share collective success\nWe have 5000 creators working across in various regions globally. In India, we are a team of 1400 plus creators sharing the passion to excite our players and customers by creating the world's best game experiences. We strive to walk the walk and show that we are inspiring wonder and building magical worlds with endless possibilities.\nLight & Wonder is committed to offer very competitive benefits that are aligned with our values and inspires employees to drive innovation and contribute to the organization’s performance. Employees are the most valued resources and we always look to improve their well-being with a wide range of benefits befitting every individual. Not limited to monetary benefits, we have robust learning and development opportunities that help them to grow professionally.\nJob Description:\n 5-7 years of experience in developing Front end applications using Angular,Typescript,HTML5, CSS3 and jQuery In-depth understanding of the entire web development process (design, development and deployment) Developing high-performance applications by writing testable, reusable, and efficient code. Strong expertise in Object Oriented Design and Development using Typescript. Experience in building highly responsive, intuitive, and high-performance web applications. Experience with unit test tools like Jest/Jasmine is a must. Experience working in Agile SCRUM teams is a must.",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=14%2B3KiTT%2Bqlngay73zmTBw%3D%3D&trackingId=l1BMJy62t80VHxUqnLVYHg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Manual Test Engineer",
    "companyName": "cure.fit (cult.fit)",
    "location": "Bengaluru, Karnataka, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Founded in 2016 by Mukesh Bansal and Ankit Nagori , Cure.fit is a mobile app that takes a holistic approach towards health and fitness by bringing together all aspects of a healthy lifestyle on a single platform. Cure.fit offers both online and offline experiences across fitness, nutrition and mental well-being through its 4 products, i.e. Cult.fit , Eat.fit , Mind.fit & Care.fit with the aim to make fitness fun and easy\n\nAs a Quality member, you will test the applications developed by custom development. You will be involved in end-to-end processes and metrics for software testing within the organization . You will collaborate with project managers and software developers to establish reporting metrics, test scenarios, and efficiencies through manual testing and streamlining QA techniques to achieve quality objectives.\n\nThis Role Demands Someone Who Has\nAbility to work effectively in a fast-paced and changing business environment.Flexibility, adaptability, and work in minimal supervision if required are must to have to be successful in this role.\nSkills & Experience\nWell versed with testing methodologies\nMust-Have Skills\nHaving good knowledge on iOS/Android based apps testing.Highly proficient in manual testing (Different types of testing: Regression, Sanity, Smoke & Functionality related)Good at writing manual test cases with all possible scenarios.Knowledge of defect reporting & bug tracking using JiraGood in debugging skillsKnowledge of software development lifecycleGood communication skills\nGood To Have Skills\nDecent problem solving skills and ability to write code.API testingWebsite testingPrevious experience of testing e-commerce applicationsExperience working with Agile methodologiesAbility to find, file, and manage bugs, aggressively driving qualityExperienced in testing larger scale projects/ quick changes from planning to sign offMust be extremely responsive, able to work under pressure in crisis with a strong sense of urgencyAbility to independently create test data as per the requirements\nEducation And Experience\nRequires Bachelors in Engineering Degree or equivalent2-4 years minimum professional experience in testing\nKey Responsibilities\nAnalyzing the requirement from a testing perspectiveCreating test plans and writing test scriptsClosely working with the scrum master and product owner to identify the risk areasManaging the defects logged and tracking them till they get closedPerforming RCA over the defects loggedIn-depth regression testing which will cover all the components\nAt Cure.fit , our mission is to “make health easy”. Through our products and services, we want to enable people to significantly improve their overall health, reduce the risk of lifestyle diseases and enable a long, disease free life. We are deeply passionate about health, fitness, and the general well-being and are eager to leverage the power of technology to help people live healthier, happier lives.\n\nIn pursuit of this objective, we are always looking for excellent team members to fulfill the vision of building these incredible and innovative products.",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=14%2B3KiTT%2Bqlngay73zmTBw%3D%3D&trackingId=l1BMJy62t80VHxUqnLVYHg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Manual Test Engineer",
    "companyName": "cure.fit (cult.fit)",
    "location": "Bengaluru, Karnataka, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Founded in 2016 by Mukesh Bansal and Ankit Nagori , Cure.fit is a mobile app that takes a holistic approach towards health and fitness by bringing together all aspects of a healthy lifestyle on a single platform. Cure.fit offers both online and offline experiences across fitness, nutrition and mental well-being through its 4 products, i.e. Cult.fit , Eat.fit , Mind.fit & Care.fit with the aim to make fitness fun and easy\n\nAs a Quality member, you will test the applications developed by custom development. You will be involved in end-to-end processes and metrics for software testing within the organization . You will collaborate with project managers and software developers to establish reporting metrics, test scenarios, and efficiencies through manual testing and streamlining QA techniques to achieve quality objectives.\n\nThis Role Demands Someone Who Has\nAbility to work effectively in a fast-paced and changing business environment.Flexibility, adaptability, and work in minimal supervision if required are must to have to be successful in this role.\nSkills & Experience\nWell versed with testing methodologies\nMust-Have Skills\nHaving good knowledge on iOS/Android based apps testing.Highly proficient in manual testing (Different types of testing: Regression, Sanity, Smoke & Functionality related)Good at writing manual test cases with all possible scenarios.Knowledge of defect reporting & bug tracking using JiraGood in debugging skillsKnowledge of software development lifecycleGood communication skills\nGood To Have Skills\nDecent problem solving skills and ability to write code.API testingWebsite testingPrevious experience of testing e-commerce applicationsExperience working with Agile methodologiesAbility to find, file, and manage bugs, aggressively driving qualityExperienced in testing larger scale projects/ quick changes from planning to sign offMust be extremely responsive, able to work under pressure in crisis with a strong sense of urgencyAbility to independently create test data as per the requirements\nEducation And Experience\nRequires Bachelors in Engineering Degree or equivalent2-4 years minimum professional experience in testing\nKey Responsibilities\nAnalyzing the requirement from a testing perspectiveCreating test plans and writing test scriptsClosely working with the scrum master and product owner to identify the risk areasManaging the defects logged and tracking them till they get closedPerforming RCA over the defects loggedIn-depth regression testing which will cover all the components\nAt Cure.fit , our mission is to “make health easy”. Through our products and services, we want to enable people to significantly improve their overall health, reduce the risk of lifestyle diseases and enable a long, disease free life. We are deeply passionate about health, fitness, and the general well-being and are eager to leverage the power of technology to help people live healthier, happier lives.\n\nIn pursuit of this objective, we are always looking for excellent team members to fulfill the vision of building these incredible and innovative products.",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=14%2B3KiTT%2Bqlngay73zmTBw%3D%3D&trackingId=l1BMJy62t80VHxUqnLVYHg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Dotnet Engineer - Support Team",
    "companyName": "Temenos",
    "location": "Chennai, Tamil Nadu, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  About Temenos\n\nWe’re passionate about helping banks to perform better, so we solely focus on creating banking software. Temenos offers cloud-native, cloud-agnostic, API-first digital banking, core banking, payments, fund management, and wealth management software products, enabling banks to deliver consistent, frictionless customer journeys and achieve market-leading cost/income performance. Our products combine the richest end-to-end packaged country model bank functionality and the most advanced technology, helping our clients go-live faster, giving them the freedom to innovate and deliver personalized experiences.\n\nWe are technology first, with 700+ published APIs, we partner with 100+ Fintechs in our marketplace. We have been recognized year after year by Gartner, IBS, and Forrester for our award-winning solutions.\n\nTemenos is the 4th largest European Software company, with over 3000 clients in 150 countries. We are proud of our 7500+ Temenosians working across the globe to make banking better!\n\n THE ROLE \n\nAbout the department:\n\nProduct Analysis and Customer Support as the name indicates, provides support to clients using Temenos products which includes clients in the Implementing stage & clients already live on Temenos products. All support requests from these clients are handled by PACS.\n\nJob Role:\n\nSenior Dotnet Engineer will provide the technical expertise, assistance and project coordination necessary to modify and repair technical issues and resolve technical problems for TEMENOS’ customers. This role will work closely with other members of the Customer Care and Product Support teams in order to provide swift, efficient and consistent resolutions for customers.\n\nKey Responsibilities\n\n Primary responsibility will be to facilitate solution to the tickets logged. It includes analysis of the ticket logged, updating clients and stakeholders through appropriate channels in every stage of resolution & providing an agreeable solution \n\nSkills & Experience\n\n BE/Btech/MCA candidates with 2 to 8 years of Development (or) Development + Support, experience required.  Software Proficiency required: .Net, C#, VB.net, SQL server, ADO, MVC, WCF, LINQ, WEB API, JavaScript, jQuery, BootStrap.  Strong communication skills a must  Strong problem-solving skills.  Able to provide exceptional follow through and be customer service driven.  Accessibility to work varying hours due to customers being nationwide.  Run queries, debug and troubleshoot and fix defects. Should have excellent debugging skills. Recommend changes in software to improve user functionality and eliminate problems. Assist in technical implementations issues. Perform software installations and upgrades. Provide customer support and technical issue resolution via internal case management system.  Ensure the customer receives an adequate level of service with each concern or request. Answer product and process related questions posed by customer through an internal case management system.  Track and maintain constant communication with the customer from the beginning to the end of any established case, issue, or concern.  Remain highly adaptable - Due to the turbulent nature of priorities in supporting customers, this role requires high adaptability to changing demands, deadlines and priorities. Answer product and process related questions posed by customer through an internal case management system.  Act as the technical reference point during software implementation/upgrades. Provide guidance and support to client IT teams.  Develop/Enhance Tools that will help in reducing the analysis time and boost customer experience. Best tools has fair chance of getting integrated to Core product  Responsible for maintaining positive and loyal relationship between TEMENOS and its customers \n\nLocation: Chennai/Bangalore/Hyderabad \n\nWork Shifts : Candidates willing to work on US Shifts\n\n WHY TEMENOS \n\n You will work at the cutting edge of technology innovation; we challenge the status quo and are transforming banking every day.  You will experience in a fast-paced environment, ambitious team; we look forwards and continuously strive to be the best.  You will be part of a team that values integrity; we support each other and keep our promises.  You will be able to work freely, flexibility and can be your authentic self; we champion diversity.  You will be joining a global and diverse family that works together through the good times and bad; we care deeply about each other and our clients.  You will experience what we call – Temenosity! \n\nWe value applications from people from all walks of life; if you are excited to be part our the journey and want to make a real impact, we would love to hear from you.\n\nPlease make sure to read our Recruitment Privacy Policy",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=14%2B3KiTT%2Bqlngay73zmTBw%3D%3D&trackingId=l1BMJy62t80VHxUqnLVYHg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer",
    "companyName": "Anthology Inc",
    "location": "Chennai, Tamil Nadu, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Job Description\n\nSenior Software Engineer\n\nChennai, India\n\nThe Opportunity\n\nAnthology offers the largest EdTech ecosystem on a global scale, supporting over 150 million users in 80 countries. Our mission is to provide dynamic, data-informed experiences to the global education community so that learners and educators can achieve their goals.    \n\nWe believe in the power of a truly diverse and inclusive workforce. As we expand globally, we are committed to making diversity, inclusion, and belonging a foundational part of not only our hiring practices but who we are as a company.   \n\nFor more information about Anthology and our career opportunities, please visit www.anthology.com www.anthology.com.  \n\nAs a member of our Product Development organization, you’ll work in an agile environment delivering industry-leading SaaS products and web service platforms. You’ll be deeply involved in translating wireframes and sketches into working prototypes to refine user interface behaviors.\n\nS Pecific Responsibilities Will Include\n\n Participating in hands-on technical design, coding, and implementation of product features  Technical collaborating with Architects and Product Designers contributing to the overall architectural vision of cloud service infrastructure in support of Blackboard’s notification products  Enhancing and supporting existing cloud-based products; designing and implementing new features; assessing and paying down technical debt  Communicating progress and escalating issues to management in a timely manner  Participating in agile planning and execution  Acting as a lead engineer on a development team responsible for developing and testing features or fixing bugs on our industry-leading Community Engagement products  Developing broad and deep knowledge on our current software architecture and helping define our next generation architecture  Coaching and mentoring junior team members; performing peer code reviews and delivering feedback  Collaborating in a cross-functional agile team to solve challenging technical problems with innovative solutions  Following best practices and methodologies to produce desired software on time with top notch quality \n\nThe Candidate\n\nRequired skills /qualifications :\n Degree in Computer Science or related field  5+ years of experience with web application development  Exceptional object-oriented and coding skills, preferably with Java, J2EE  Understanding of Service Oriented Architectures and RESTful Web Service best practices  Experience in AWS (S3, lambda, API gateway, WAF, DynamoDB)  Ability to design and develop scalable, distributed, high availability applications in the cloud via API-based microservices  Demonstrated ability to incorporate beneficial software design patterns and identify performance anti-patterns  Hands-on experience with SQL Programming (MS SQL Server/Oracle)  Basic understanding of frontend technologies (JavaScript, Ajax, jQuery, etc.)  Experience participating in agile and fast-paced software development methodologies like XP or Scrum  Strong troubleshooting and problem-solving skills \n\nPreferred Skills /qualifications\n\n Experience with Java programming  Experience in frontend frameworks like Angular or React  Experience working with various notification API suites (Twilio, Open Market) \n\nThe Office\n\nAnthology has an office in one of the biggest cultural, economic, and educational centers in South India: Chennai. L ocated on OMR, the IT corridor of South Chennai\n Easy access to Velachery, Thiruvanmiyur Railway station and bus stop  Very close to Tidel Park, Ascendas , and SRP Tools – Holiday Inn  Office provides lunch and snacks on all working days  Office is situated behind Hotel Turyaa on the 5 th floor of Rayala Techno Park  Fun Committee, Happy Fete Team, Food Committee, and Sports Committee ensures fun at work  ISR Team actively engages employees in contributing to various local charities \n\nThis job description is not designed to contain a comprehensive listing of activities, duties, or responsibilities that are required. Nothing in this job description restricts management's right to assign or reassign duties and responsibilities at any time.\n\nAnthology is an equal employment opportunity/affirmative action employer and considers qualified applicants for employment without regard to race, gender, age, color, religion, national origin, marital status, disability, sexual orientation, gender identity/expression, protected military/veteran status, or any other legally protected factor.",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=14%2B3KiTT%2Bqlngay73zmTBw%3D%3D&trackingId=l1BMJy62t80VHxUqnLVYHg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Lead Software Engineer",
    "companyName": "The Depository Trust & Clearing Corporation (DTCC)",
    "location": "Chennai, Tamil Nadu, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  \n\nLead Software Engineer\n\nAre you ready to explore a world of possibilities?\n\nJoin our DTCC family, and you’ll grow your expertise and become the best version of you. As you embark on a new journey, you’ll seek challenges with flexibility and patience, learning new skills and advancing your career while having the time of your life.\n\nEmployee Benefits:\n\nWe believe in work-life Balance\n\nExcellent Pay /Incentives\n\n 24 days Earned leaves \n\n5 Day per week schedule and other Excellent health Benefits\n\n Why You Would Love This Job: \n\nThe Information Technology group delivers secure, reliable technology solutions that enable DTCC to be the trusted infrastructure of the global capital markets\n\nLead Software Engineer coordinates the technical design of large business systems; integration of business services & information security; implements technology-specific best practices & standards; controls success criteria from design through deployment, including, reliability, cost-effectiveness, performance, data integrity, maintainability, reuse, extensibility, usability and scalability; provides leadership on AD teams and can assist the Domain Architect as a technology liaison across teams. Acts as a partner with multi-functional teams to ensure the success of product strategy and project deliverables\n\n Your Responsibilities: Technology Expertise is a domain expert on one or more of programming languages, vendor products, DTCC applications, data structures, business lines Platforms works with Infrastructure partners to stand up development, testing, and production environments. Will define scalability and performance criteria for the product Data Modeling reviews and extends data models Requirements Elaboration works with the Functional Architect to ensure that non-functional requirements are complete and appropriate Is aware of frameworks that promote concepts of isolation, extensibility, and extendibility  Talents Needed For Success: 8+ years’ experience in application development or system analysis 2 years of team leadership experience Full Stack developer with solid Core Java including Collections, multi-threading concepts with a working experience on J2EE along with Framework knowledge – Spring/Spring boot Experience in Angular framework  Experience in oracle database Experience in API analysis, integration & troubleshooting Bachelor's degree in technical/computer field or related experience required  Who We Are: \n\nWith over 45 years of experience, DTCC is the premier post-trade market infrastructure for the global financial services industry. From operating facilities, data centers and offices in 16 countries, DTCC, through its subsidiaries, automates, centralizes and standardizes the processing of financial transactions, mitigating risk, growing openness and driving efficiency for thousands of broker/dealers, custodian banks and asset managers. Industry owned and governed, the firm simplifies the complexities of clearing, settlement, asset servicing, data management, data reporting and information services across asset classes, bringing increased security and soundness to financial markets. In 2018, DTCC’s subsidiaries processed securities transactions valued at more than U.S. $1.85 quadrillion. Its depository provides custody and asset servicing for securities issues from 170 countries and territories valued at U.S. $52.2 trillion. DTCC’s Global Trade Repository service, through locally registered, licensed, or approved trade repositories, processes over 14 billion messages annually. To learn more, please visit us at www.dtcc.com or connect with us on LinkedIn, Twitter, YouTube and Facebook.\n\nWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, sex, gender, gender expression, sexual orientation, age, marital status, veteran status, or disability status. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform crucial job function",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=14%2B3KiTT%2Bqlngay73zmTBw%3D%3D&trackingId=l1BMJy62t80VHxUqnLVYHg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer - Java8",
    "companyName": "HERE Technologies",
    "location": "Mumbai, Maharashtra, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  What's the role? \nAs a Senior Software Engineer in the Foundation Engineering you will work self-sustained in an agile team. Your responsibilities will cover developing, extending, and maintaining tool and services that process data for HERE’s global databases.\nYour Tasks\n Implement tools to enhance both automated and semi-automated map data processing, involving backend/service-based software stacks, but also dashboard components for data tracking and analysis Own and drive technical excellence and in-depth solutions in an innovative and fast-paced environment Apply and extended CI/CD tools and execute end-2-end ownership of your developed software stack, including DevOps and testing aspects Work closely with other full stack and frontend engineers on the team to de/-refine APIs and system integrations Work with other engineering teams and internal customers to identify new opportunities, address critical needs, and solve complex problems using your backend development expertise Become an expert at leveraging internal platform resources and APIs Drive initiatives that contribute in development of software that is efficient, re-usable and reliable (e.g. agile, coding, verification) Be part of an agile team, share knowledge, carry out code reviews.\n Who are you? \nBachelor or master’s degree in Computer Science/Information Systems or equivalent\n 5+ years of software development experience, Excellent applied skills in Java and/or Scala programming, in combination with backend architectures, messaging technologies and related frameworks Cloud Experience (AWS/Azure/IBM/Oracle) Strong and applied experience in REST based web service technologies, JSON and XML, SOA and micro services architectures Strong and applied DBMS & SQL skills, with a strong preference on PostgreSQL / PostGIS Strong and applied AWS skills (EC2, S3, RDS,), as well as experience with virtualization tools like Docker Strong experience CI/CD tools, with a preference on Jenkins Good knowledge of using issue tracking tools (e.g., JIRA), code collaboration tools (e.g., Git/GitLab) and team collaboration tools (e.g., Confluence/Wiki). Good knowledge of Linux/Unix – familiar with shell scripting Able to translate business and architectural features into quality, consistent software design Solid knowledge of programming practices, strive to write great code that is reusable, flexible, and reliable. Strong quality mindset is considered a must: unit testing, performance testing, writing testable code Self-motivated, well-organized, details-oriented and a strong team player with an agile mindset\nHERE is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, age, gender identity, sexual orientation, marital status, parental status, religion, sex, national origin, disability, veteran status, and other legally protected characteristics.\n Who are we? \nHERE Technologies is a location data and technology platform company. We empower our customers to achieve better outcomes – from helping a city manage its infrastructure or a business optimize its assets to guiding drivers to their destination safely.\nAt HERE we take it upon ourselves to be the change we wish to see. We create solutions that fuel innovation, provide opportunity and foster inclusion to improve people’s lives. If you are inspired by an open world and driven to create positive change, join us. Learn more about us. Watch Video\nHERE is searching for a Senior Software Engineer for our Foundation Engineering team. Foundation Engineering enables the creation of mapping products that are highly available, performant, and near real-time.\nThe Senior Software Engineer will be a contributor on the team to deliver digital maps to major automakers, for e.g. BMWs, VWs, Audi, Daimler. You will work on a technology to collect and process road information from many sources, terabytes of data, including car sensors from millions of cars on the road. Our services convert this input into a digital map which is delivered back to the cars and used for navigation, driver assistance and even autonomous driving.\nDevelopers building new services will rapidly launch their differentiated prototypes leveraging templates that enforce security, availability, and efficiency best-practices with a minimal collection of service-specific libraries.\nWhat You’ll Get\n Challenging problems to solve Opportunities to learn cool new things Work that makes a difference in the world Freedom to decide how to perform your work Variety in the types of projects Feedback so you will know how well you are doing Collaborative, Supportive Colleagues",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=14%2B3KiTT%2Bqlngay73zmTBw%3D%3D&trackingId=l1BMJy62t80VHxUqnLVYHg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "Protegrity",
    "location": "Mumbai, Maharashtra, India, Remote",
    "description": "About the job\n        \n\n\n        \n                  The global data privacy software market is projected to grow from $2.36 billion in 2022 to $25.85 billion by 2029.\nSo, if you are searching for an innovative career, then the cybersecurity industry might just be the one for you. Protegrity, an international provider of data protection solutions, is looking for new team members who want to make an impact in a company that prioritizes something we all care about: our privacy.\nWe need people who recognize the opportunity, can plan effectively, take action and execute in the enterprise marketplace with our intuitive, diverse, and future-forward global teams.\nSo, are you up for collaborating with the best in data security?\nJoin us on this journey and make an impact with one of the top 25 global software providers. We look forward to making our world become a better place with you on our team.\nApply and discover what’s next today!\nAs a software engineer with Protegrity’s talented product development team you will contribute to cutting-edge research, development and feature design/implementation in a fast-paced Agile environment. This position is perfect for smart technical individuals who enjoy building technology, working in a team of talented engineers and being part of end-to-end product delivery life cycle.\nTo qualify, you should have 3-5 years of relevant experience in developing & integrating scalable solutions. You should be highly versatile with full stack application programming and software application design concepts and aware with the latest trends in technology.\nResponsibilities may include but not be limited to\n Contribute to continuous development, enhancement and maintenance of existing and new products/features Contribute to appropriate software development methods, standards, tools to achieve well engineered outcome. Ability to work independently by applying development practices used by the team/organization including usage of design patterns, frameworks, programming/debugging environments, IDEs etc. Participating in Agile practices of the team/organization as an individual contributor and a team player. Adaptability to learn and enhance skills in the domain of data security alongside the product’s technical environment (like OS, cloud technology, container orchestration, native programming language of the environment, hardware etc.) Ability to review work of peer engineers/juniors alongside being an individual contributor. Excellent collaboration abilities within and across teams for technical requirements and product module dependencies. Ability to be a good team player and soft skilled person.\nIn addition to the qualifications a successful candidate will demonstrate\n 3+ years post-bachelor’s degree experience as software engineer in developing & integrating big data and/or cloud solutions. Knowledge on modern scalable/elastic systems in cloud like Databricks/ HDInisghts/ Dataflow/ Cloudera Data Platform/Big Query/Synapse etc. Any or multiple is desirable. Knowledge of large-scale SQL engines like Hive, Presto, SparkSQL etc. Experience on any or multiple of programming languages like Java/Python/Go/C++ Knowledge of Public Cloud technologies like AWS/GCP/Azure Understanding of containerized platforms like Kubernetes or Openshift Specifying, Designing, implementing and debugging high-performance Big Data and Cloud systems Experience on Linux OS and Shell Scripting Capability to specify, design, implement, debug and profile high-performance web application software. Should be strong at debugging, troubleshooting, profiling own’s code as well as reviewing that of peers. Sufficient knowledge of office productivity tools to represent formal exchange of technical content communication. Excellent verbal and written communication skills along with good rapport and collaboration with teammates within the team.\nGood to have skills -\n Knowledge of operating systems and concepts. Linux & Windows is the preference. Knowledge of creating and operating any multi node cluster like Hadoop. Knowledge of creating and operating any containerized platform like Kubernetes in cloud Knowledge of software performance measurements and tuning Understanding of software security requirements and associated standards like NIST, OWASP, PCI-DSS etc. Has gone through a devops cycle, CI/CD pipelines and software test automations. Knowledge of cryptography and cryptographic algorithms Knowhows of Agile process for product delivery.\nPreferred Qualifications\n Background to computer science and systems Experience on Java & Python programming language Knowledge of Public Cloud technologies like AWS/GCP/Azure Knowledge on modern scalable/elastic systems in cloud like Databricks/ HDInisghts/ Dataflow/ Cloudera Data Platform(CDP)/Big Query/Synapse etc. Any or multiple is desirable.\nWe offer a competitive salary and comprehensive benefits with generous vacation and holiday time off. All employees are also provided access to ongoing learning & development.\nEnsuring a diverse and inclusive workplace is our priority. We are committed to an environment of acceptance where you are free to bring your full self to work. All qualified applicants and current employees will not be discriminated against on the basis of race, color, religion, sex, sexual orientation, gender identity, age, national origin, disability or veteran status.",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=14%2B3KiTT%2Bqlngay73zmTBw%3D%3D&trackingId=l1BMJy62t80VHxUqnLVYHg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Developer II",
    "companyName": "S&P Global",
    "location": "Ahmedabad, Gujarat, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Segment: S&P Global Sustainable1\n\nThe Role: Software Developer II\n\nGrade: 9\n\nLocation: Hyderabad, Ahmedabad\n\nThe Team: We are looking for a highly motivated, enthusiastic, and skilled software engineer for Sustainable1. This developer would help us to accelerate our Climate Analytics work.\n\nThe Impact: The Senior Software Engineer will work to improve and enhance the architecture, design, scalability, and performance of our cutting-edge Climanomics™ platform\n\nWhat’s in it for you: It’s a fast-paced agile environment that deals with huge volumes of data, so you’ll have an opportunity to sharpen your data skills and work on an emerging technology stack\n\nResponsibilities\nDesign, and implement software components for Climanomics platform.Perform analysis and articulate solutions.Design underlying engineering for use in multiple product offerings supporting a large volume of end-users.Develop project plans with task breakdowns and estimates.Manage and improve existing solutions.Solve a variety of complex problems and figure out possible solutions, weighing the costs and benefits.Perform other duties as assigned \nBasic Qualifications\n\nWhat We’re Looking For: \nBachelors/Master’s Degree in Computer Science, Information Systems or equivalent.5+ years’ experience in application developmentExperience with the PERN stack Experience with server-side development in Node.js, Express.js, Python, GoProficient with software development lifecycle (SDLC) methodologies like Agile, Test-driven developmentExperience with large datasets and ETL pipelines in cloud environments (preferably with Postgres, DynamoDB, and DocumentDB)Experience with frontend JavaScript, in conjunction with Typescript or Flow, and modern frameworks like React, ReduxApache Kafka distributed event streaming platform\nPreferred Qualifications\nFamiliarity and/or enthusiasm with Data Science / Machine Learning is a plusExperience working in cloud computing environments such as AWS, Azure, or GCPExperience in Databricks, SnowFlake\nAbout Company Statement\n\nS&P Global Corporate\n\nAt S&P Global, we don’t give you intelligence—we give you essential intelligence. The essential intelligence you need to make decisions with conviction. We’re the world’s foremost provider of credit ratings, benchmarks and analytics in the global capital and commodity markets. Our divisions include S&P Global Ratings, S&P Global Market Intelligence, S&P Dow Jones Indices and S&P Global Platts. For more information, visit www.spglobal.com.\n\nS&P Global has a Securities Disclosure and Trading Policy (“the Policy”) that seeks to mitigate conflicts of interest by monitoring and placing restrictions on personal securities holding and trading. The Policy is designed to promote compliance with global regulations. In some Divisions, pursuant to the Policy’s requirements, candidates at S&P Global may be asked to disclose securities holdings. Some roles may include a trading prohibition and remediation of positions when there is an effective or potential conflict of interest. Employment at S&P Global is contingent upon compliance with the Policy.\n\nEqual Opportunity Employer\n\nS&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law. Only electronic job submissions will be considered for employment.\n\nIf you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person.\n\nEqual Opportunity Employer\n\nS&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law. Only electronic job submissions will be considered for employment.\n\nIf you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person. \n\nUS Candidates Only:  The EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf describes discrimination protections under federal law.\n\n20 - Professional (EEO-2 Job Categories-United States of America), IFTECH202.1 - Middle Professional Tier I (EEO Job Group), SWP Priority – Ratings - (Strategic Workforce Planning)\n\nJob ID: 270635\n\nPosted On: 2022-08-03\n\nLocation: Hyderabad, Telangana, India",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=14%2B3KiTT%2Bqlngay73zmTBw%3D%3D&trackingId=l1BMJy62t80VHxUqnLVYHg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Developer II",
    "companyName": "S&P Global",
    "location": "Ahmedabad, Gujarat, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Segment: S&P Global Sustainable1\n\nThe Role: Software Developer II\n\nGrade: 9\n\nLocation: Hyderabad, Ahmedabad\n\nThe Team: We are looking for a highly motivated, enthusiastic, and skilled software engineer for Sustainable1. This developer would help us to accelerate our Climate Analytics work.\n\nThe Impact: The Senior Software Engineer will work to improve and enhance the architecture, design, scalability, and performance of our cutting-edge Climanomics™ platform\n\nWhat’s in it for you: It’s a fast-paced agile environment that deals with huge volumes of data, so you’ll have an opportunity to sharpen your data skills and work on an emerging technology stack\n\nResponsibilities\nDesign, and implement software components for Climanomics platform.Perform analysis and articulate solutions.Design underlying engineering for use in multiple product offerings supporting a large volume of end-users.Develop project plans with task breakdowns and estimates.Manage and improve existing solutions.Solve a variety of complex problems and figure out possible solutions, weighing the costs and benefits.Perform other duties as assigned \nBasic Qualifications\n\nWhat We’re Looking For: \nBachelors/Master’s Degree in Computer Science, Information Systems or equivalent.5+ years’ experience in application developmentExperience with the PERN stack Experience with server-side development in Node.js, Express.js, Python, GoProficient with software development lifecycle (SDLC) methodologies like Agile, Test-driven developmentExperience with large datasets and ETL pipelines in cloud environments (preferably with Postgres, DynamoDB, and DocumentDB)Experience with frontend JavaScript, in conjunction with Typescript or Flow, and modern frameworks like React, ReduxApache Kafka distributed event streaming platform\nPreferred Qualifications\nFamiliarity and/or enthusiasm with Data Science / Machine Learning is a plusExperience working in cloud computing environments such as AWS, Azure, or GCPExperience in Databricks, SnowFlake\nAbout Company Statement\n\nS&P Global Corporate\n\nAt S&P Global, we don’t give you intelligence—we give you essential intelligence. The essential intelligence you need to make decisions with conviction. We’re the world’s foremost provider of credit ratings, benchmarks and analytics in the global capital and commodity markets. Our divisions include S&P Global Ratings, S&P Global Market Intelligence, S&P Dow Jones Indices and S&P Global Platts. For more information, visit www.spglobal.com.\n\nS&P Global has a Securities Disclosure and Trading Policy (“the Policy”) that seeks to mitigate conflicts of interest by monitoring and placing restrictions on personal securities holding and trading. The Policy is designed to promote compliance with global regulations. In some Divisions, pursuant to the Policy’s requirements, candidates at S&P Global may be asked to disclose securities holdings. Some roles may include a trading prohibition and remediation of positions when there is an effective or potential conflict of interest. Employment at S&P Global is contingent upon compliance with the Policy.\n\nEqual Opportunity Employer\n\nS&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law. Only electronic job submissions will be considered for employment.\n\nIf you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person.\n\nEqual Opportunity Employer\n\nS&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law. Only electronic job submissions will be considered for employment.\n\nIf you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person. \n\nUS Candidates Only:  The EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf describes discrimination protections under federal law.\n\n20 - Professional (EEO-2 Job Categories-United States of America), IFTECH202.1 - Middle Professional Tier I (EEO Job Group), SWP Priority – Ratings - (Strategic Workforce Planning)\n\nJob ID: 270635\n\nPosted On: 2022-08-03\n\nLocation: Hyderabad, Telangana, India",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=14%2B3KiTT%2Bqlngay73zmTBw%3D%3D&trackingId=l1BMJy62t80VHxUqnLVYHg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  }
]