[
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "Yarikul Infotech",
    "location": "Srinagar, Jammu & Kashmir, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  The ideal candidate will be responsible for developing high-quality applications. They will also be responsible for designing and implementing testable and scalable code.  Must Haves:Candidate must be living in or willing to work from our Srinagar, Jammu & Kashmir officeMust not be bound by a specific programming languageWilling to learn and switch programming languages and technologiesPrior experience in Fullstack Software DevelopmentEnthusiasm to explore and learn new technologies on their own and share your knowledge\nResponsibilities:Write high-quality, scalable, and testable code for our Web-based ERP softwareDesign, Develop and Maintain new features and modules for our ERP Software\nQualifications:Bachelor's degree or equivalent experience in Computer Science or a related fieldExperience in Web DevelopmentExperience in MVC frameworks in Front end and Back end languages.SQL database or relational database skillsProblem-solving skills\nSalient Features:A competitive SalaryFriendly and relaxed work environmentOpportunity to take Paid courses and learn new skillsFlexible working hoursOpportunity to travel abroad",
    "link": "https://www.linkedin.com/jobs/view/3504145426/?eBP=CwEAAAGHHBimMP57ndi2nXDvjQSaYrl53UwEvWRqHTEy3gzeBl_dmn4l_wQrzsnP9pxeuUuj1EnLpbk9-CnlnqRWGsEFo5JcWSZKBLcmzl6TlewcqY147-u01PdNg2sa44EzrzcztfFesUiYMszEbP6L_fRrQKJ2CfRKVKxW23rp7e1iA349yo7yVy8tb5EyInohazcG4pWJ9X1xip8ePyebPJZXclA2mE0nhg7hgAZKm-mCwzysVElaytHJNRyAbdhbhHkZKziv_LveckAfmd3i574NABtYQoNUwQKBwmnMtEVbSqgs1TNXEYdDDk91--CC_kZ449v0kVNScgNjwewk8TbhRMheKvW-5dpA3HF7wqBhUErhPp0IV1Pm&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=fLyDmUUFJQgB792mf067Lw%3D%3D&trackingId=kAif3naVM4WKAg8rNJrqOg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer II",
    "companyName": "Advarra",
    "location": "Kakinada, Andhra Pradesh, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Primary Duties And Responsibilities Designing, coding and deploying web enabled clinical trial management software by:Developing web-based systems built using Java EE technologies in a multi-tiered environment including working with front-end components, business logic, workflow logic, backend systems as well as integration endpoints.Perform implementation of cases under mentoring and guidance of more experienced engineers.Studying information needs, conferring with users/focus groups, studying systems flow, data usage, and work processes.Documenting and demonstrating solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code.Determining operational feasibility through analysis, problem definition, requirements, solution development, and proposed solutions.Utilizing software engineering tools such as configuration management systems, build processes, and debuggers in the software development process.Adhering to Advarra coding standards and in accordance with applicable software development methodology and release processes.Working with Quality Assurance including functional performance and deployment issues.Performing technical root cause analysis and outline corrective action for given problems.Collaborating and adding value through participation in peer code reviews, providing comments and suggestions.Working collaboratively and professionally with other Advarra team (QA, PM, Support) members to achieve customer goals.Maintain Professional and Technical knowledge by:Attending internal and external training.Reviewing professional publications.\n\n\nParticipating in professional networks and/or organizations",
    "link": "https://www.linkedin.com/jobs/view/3504145426/?eBP=CwEAAAGHHBimMP57ndi2nXDvjQSaYrl53UwEvWRqHTEy3gzeBl_dmn4l_wQrzsnP9pxeuUuj1EnLpbk9-CnlnqRWGsEFo5JcWSZKBLcmzl6TlewcqY147-u01PdNg2sa44EzrzcztfFesUiYMszEbP6L_fRrQKJ2CfRKVKxW23rp7e1iA349yo7yVy8tb5EyInohazcG4pWJ9X1xip8ePyebPJZXclA2mE0nhg7hgAZKm-mCwzysVElaytHJNRyAbdhbhHkZKziv_LveckAfmd3i574NABtYQoNUwQKBwmnMtEVbSqgs1TNXEYdDDk91--CC_kZ449v0kVNScgNjwewk8TbhRMheKvW-5dpA3HF7wqBhUErhPp0IV1Pm&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=fLyDmUUFJQgB792mf067Lw%3D%3D&trackingId=kAif3naVM4WKAg8rNJrqOg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer (Entry Level)",
    "companyName": "MRI Software",
    "location": "Bangalore Rural, Karnataka, India, ",
    "description": "About the job\n        \n\n\n        \n                  We are currently seeking a Junior Software Engineer to work within our global Product Development department working to apply defined software development life cycle processes to deliver production ready code of the highest quality, this individual will be diligent in testing their code and working with the team to produce\nMRI Software’s high standard product. This individual will work under the Agile development methodology in a cross-functional environment with other groups, both inside and outside the department including Product Management and Documentation, as well as create and test code in our dynamic team setting\nResponsibilities\nApplies defined practices and procedures to design, implement, and support software projectsBuilds effective working relationships with team membersActively seeks assistance as needed but demonstrates learning and growing independenceActively seeks guidance for prioritization and review of deliverables.Performs and designs testing protocols to ensure that the product is fully tested.\nRequirements\nCurrently pursuing a BE, Btech, MCA, MSC, or BCA Computer Science or related technical field (2022 Passout may also apply)Experience developing software or algorithms based on predetermined specificationsKnowledge of object-oriented programming, Microsoft .Net or Java preferredProficient with Source Control tools Familiarity with database objects (tables, stored procedures, queries, etc.) a plusAttention to detail is a mustGood written and verbal communication skills\nBenefits\nAbility to learn leading technical / industry standards and technologiesFlexible working arrangements (2 days in the office)Annual performance-related bonusHealth insurance6x Flexi Fridays: knock 2.5 hours off your day on a FridayEngaging, fun & inclusive culture: check out the MRI Software APAC Insta feed and stories!\nAbout The Business\nMRI Software is a global Proptech leader delivering innovative applications and hosted solutions that free real estate companies to elevate their business. \nOur flexible technology platform, along with an open and connected ecosystem, allows us to meet the unique needs of real estate businesses, from property-level management and accounting, to investment modeling and analytics for the global commercial and residential markets. With nearly five decades of expertise and insight, we have grown to include offices in across the United States, the United Kingdom, Hong Kong, Singapore, Australia, South Africa, New Zealand, Canada, and India, with over 3000 team members to support our clients and their unique needs!\nMRI is proud to be an Equal Employment Opportunity employer.",
    "link": "https://www.linkedin.com/jobs/view/3504145426/?eBP=CwEAAAGHHBimMP57ndi2nXDvjQSaYrl53UwEvWRqHTEy3gzeBl_dmn4l_wQrzsnP9pxeuUuj1EnLpbk9-CnlnqRWGsEFo5JcWSZKBLcmzl6TlewcqY147-u01PdNg2sa44EzrzcztfFesUiYMszEbP6L_fRrQKJ2CfRKVKxW23rp7e1iA349yo7yVy8tb5EyInohazcG4pWJ9X1xip8ePyebPJZXclA2mE0nhg7hgAZKm-mCwzysVElaytHJNRyAbdhbhHkZKziv_LveckAfmd3i574NABtYQoNUwQKBwmnMtEVbSqgs1TNXEYdDDk91--CC_kZ449v0kVNScgNjwewk8TbhRMheKvW-5dpA3HF7wqBhUErhPp0IV1Pm&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=fLyDmUUFJQgB792mf067Lw%3D%3D&trackingId=kAif3naVM4WKAg8rNJrqOg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer",
    "companyName": "NAF Technology India",
    "location": "Chennai, Tamil Nadu, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  Position Summary:    Do you love a Challenge? Are you Passionate about technology? Are you customer obsessed? Looking to innovate? Join NAF Tech!  New American Funding(NAF) is a mortgage lender offering an array of loan options. Established in 2003 and headquartered in Tustin, CA, United States, NAF has 4400+ strong work-force across 167 branches and a servicing portfolio of 229,000+ loans and $60.7 Billion.  By having a clear understanding of product requests, collaborating with our product teams and designers, and providing solutions to our business problems, this role will provide insights in our development efforts. We're expecting this candidate to be able to make independent decisions, and use their creativity to solve different problems, and most important of all, have fun with the team here!  Responsibilities:  Define the long-term technical strategy and architecture vision for device management, leveraging new technologies to deliver features to our customers. Think out of box, plan and build frameworks as building blocks, be updated with the technology and improve frameworks on timely manner Analyse User requirements, clarify and cascade as needed for clear understanding and implementation Professionally maintain all software and create updates regularly to address customer concerns Troubleshoot coding problems quickly and efficiently to ensure a productive workplace Ensure software security by developing programs to actively monitor the defined standards Collaborate with team members to determine best coding practices and enhance client experience Develop Successors in Place by mentoring the individuals and assist in their career growth and update them with the technical challenges that might come their way Document and demonstrate solutions by developing documentation, flowcharts, layouts, diagrams, charts and code comments Updates job knowledge by studying state-of-the-art development tools, programming techniques, and computing equipment Actively participate in Internal initiatives, contribute to org wide Technology initiatives  Core Competencies:  Bachelor’s Degree in Computer Science or equivalent Overall, 5+ years of Software development experience 2+ years of experience contributing to the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems Strong C/S Foundation and competencies on Data Structures, Algorithms and Software Design Principles supporting multiple channels. Proficiency in either of these - C#, VB.Net, ASP.net, React and AngularJS, HTML5, CSS3, SASS Proficiency in Angular 12, NGRX, C# Azure AppService and Functions, Cosmos DB, Blob Storage, ElasticSearch, SQL Server is a plus.Integration expertise working with third-party libraries and APIs Possess expert knowledge in performance, scalability, enterprise system architecture, and engineering best practices. Knowledge in latest Architectural patterns that facilitates TDD approach, Knowledge in Unit Testing Experience in being part of Production deployments and related activities Ability to work in Agile fast paced environment with knowledge on CI/CD /Monitoring frameworks and related DevOps tools (Jenkins,Jira,Google Analytics if any) Proficient in Problem solving Ability to work as part of Team or as Individual contributors Excellent communication and interpersonal skills working across multiple geographies  Nice to Have:  Optimize Applications/Frameworks to maximize speed and scale Working Knowledge of Django, Flask and React.JS Proficient in Relational Databases querying A Deep understanding of cross functional teams and working across the teams Ability to handle Aggressive timelines and achieve optimal solutions to the Business requirements.",
    "link": "https://www.linkedin.com/jobs/view/3504145426/?eBP=CwEAAAGHHBimMP57ndi2nXDvjQSaYrl53UwEvWRqHTEy3gzeBl_dmn4l_wQrzsnP9pxeuUuj1EnLpbk9-CnlnqRWGsEFo5JcWSZKBLcmzl6TlewcqY147-u01PdNg2sa44EzrzcztfFesUiYMszEbP6L_fRrQKJ2CfRKVKxW23rp7e1iA349yo7yVy8tb5EyInohazcG4pWJ9X1xip8ePyebPJZXclA2mE0nhg7hgAZKm-mCwzysVElaytHJNRyAbdhbhHkZKziv_LveckAfmd3i574NABtYQoNUwQKBwmnMtEVbSqgs1TNXEYdDDk91--CC_kZ449v0kVNScgNjwewk8TbhRMheKvW-5dpA3HF7wqBhUErhPp0IV1Pm&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=fLyDmUUFJQgB792mf067Lw%3D%3D&trackingId=kAif3naVM4WKAg8rNJrqOg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer II",
    "companyName": "SailPoint",
    "location": "Maharashtra, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Job DescriptionAs part of Sustaining Team, the candidate will be responsible for improving the features, quality and overall stability of the product. He/she will be developing solutions to address the customer production issues. The profile requires writing quality code, troubleshooting customer issues and use cases, debugging & fixing complex problems. He/ She will work closely with the customer support team, core development team, QA team, and Services team and communicate directly with the customers, as and when required. This position is highly visible & customer facing and thus requires being highly responsible, daring to explore new territories, learn and adapt to new language/functionality, quick context switching and stretching at times to have a happy customer in the end. The candidate should be optimistic and should have high networking capabilities. He/she can work with or without guidance, apply judgements under defined policies/processes and continue enhancing domain/technical skills.Required Skills/Experience:BE/MCA with 3-5 years of software development/sustaining experience in Java/J2EE technologyExperience in developing/maintaining applications across different tiers - Web UI, business logic, persistence, integrations/connectivityHaving experience in JSF, Ext-JS, AJAX, JavaBeans, Bean Shell and other J2EE technologies/frameworkHaving experience with Databases (Oracle, SQL, MySQL, Sybase, etc.)Knowledge of Web Service architecture – REST, SOAP, SAML, SPML, etc.Knowledge of application servers - Tomcat, JBOSS, WebLogic, WebSphereGood written and verbal communications skills - Experience directly interacting with customers/support team and work under pressure for extended periods to manage escalationsShould have good analytical, problem solving and diagnostic skillsFlexible to adjust working schedule when necessary to communicate and work with SailPoint US team/Services/Support or even customers\n\nNice to have knowledge and experience:Knowledge of Identity Management solutions/domainExperience working in Product-based organizationsFamiliarity working with security applications and experience on supporting/ deploying a product will be helpfulGood to have knowledge of cloud based applications, e.g., salesforce, workday, service now, etc.Good to have knowledge of Unix based systems (AIX, Solaris, Linux, etc.)\n\nSailPoint is an equal opportunity employer and we welcome everyone to our team. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.",
    "link": "https://www.linkedin.com/jobs/view/3504145426/?eBP=CwEAAAGHHBimMP57ndi2nXDvjQSaYrl53UwEvWRqHTEy3gzeBl_dmn4l_wQrzsnP9pxeuUuj1EnLpbk9-CnlnqRWGsEFo5JcWSZKBLcmzl6TlewcqY147-u01PdNg2sa44EzrzcztfFesUiYMszEbP6L_fRrQKJ2CfRKVKxW23rp7e1iA349yo7yVy8tb5EyInohazcG4pWJ9X1xip8ePyebPJZXclA2mE0nhg7hgAZKm-mCwzysVElaytHJNRyAbdhbhHkZKziv_LveckAfmd3i574NABtYQoNUwQKBwmnMtEVbSqgs1TNXEYdDDk91--CC_kZ449v0kVNScgNjwewk8TbhRMheKvW-5dpA3HF7wqBhUErhPp0IV1Pm&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=fLyDmUUFJQgB792mf067Lw%3D%3D&trackingId=kAif3naVM4WKAg8rNJrqOg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "Incedo Inc.",
    "location": "Chennai, Tamil Nadu, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  Role Description: Java Developer\n\nWe are looking for a candidate able to lead & own the development & integration of product/service lines. Understands the technical requirements; develops the technology project plan and communicates the schedule to the team. Liaison with technical & domain architects to facilitate selection of appropriate technologies to meet the customer requirements\n\nRole and responsibilities:\n\n• Participate in the full development life cycle, working within broadly defined parameters.• Own the delivery of an entire piece of a system or application.• Management and execution against project plans and delivery commitments.• Work closely with development manager, tech leads, Scrum master and Product owner to develop the best technical design and approach for new product development.• Create and execute appropriate quality plans, project plans, test strategies and processes for development activities in concert with business and project management efforts• Writing high quality code, participating in code reviews, designing/architecting systems of varying complexity and scope, and creating high quality documentation supporting the design/coding tasks\n\nTechnical skills requirements:\n\nThe candidate must demonstrate proficiency in,• Strong java developer with 3+(3-5) years of experience.• Good in core java 8 or above.• SpringBoot, Hibernate, Good Database skills.• Experience in Microservices architecture.• Experience using any messaging framework\n\nRegards,Incedo HR Team",
    "link": "https://www.linkedin.com/jobs/view/3504145426/?eBP=CwEAAAGHHBimMP57ndi2nXDvjQSaYrl53UwEvWRqHTEy3gzeBl_dmn4l_wQrzsnP9pxeuUuj1EnLpbk9-CnlnqRWGsEFo5JcWSZKBLcmzl6TlewcqY147-u01PdNg2sa44EzrzcztfFesUiYMszEbP6L_fRrQKJ2CfRKVKxW23rp7e1iA349yo7yVy8tb5EyInohazcG4pWJ9X1xip8ePyebPJZXclA2mE0nhg7hgAZKm-mCwzysVElaytHJNRyAbdhbhHkZKziv_LveckAfmd3i574NABtYQoNUwQKBwmnMtEVbSqgs1TNXEYdDDk91--CC_kZ449v0kVNScgNjwewk8TbhRMheKvW-5dpA3HF7wqBhUErhPp0IV1Pm&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=fLyDmUUFJQgB792mf067Lw%3D%3D&trackingId=kAif3naVM4WKAg8rNJrqOg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "Navis",
    "location": "Chennai, Tamil Nadu, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  Making Your Next Move Count\nAt Kaleris - Navis, you will find a rewarding career where you can thrive at every level. We invest in our teammates through offering competitive compensation and benefits, and progressive training opportunities that empower employees to achieve total (physical, financial, social & community) wellbeing. In addition to challenging and meaningful work, you will find a strong work-life balance and a deep commitment to developing yourself. Our’ culture thrives on teamwork and diversity. So, bring your unique perspective and talent to us and thrive in your every work day!\nKaleris - Navis LP is an equal opportunity employer, committed to a diverse and inclusive workforce.\nPosition Summary\nJoin our talented team of Software Engineers in building the next generation of our flagship product the Navis™ SPARCS N4 terminal operating system (TOS). In this position, you will have an opportunity to make major contributions to our next-generation transportation and logistic software for the marine industry. You will work together with colleagues to define system requirements and build state-of-the-art software. You must be a quick learner, have excellent communication skills and be able to maintain ownership of large engineering projects through their lifecycle: architecture/design, implementation, testing, maintenance, and support. This position has unique opportunities for growth in both the functional and technical directions.\nResponsibilities\nAnalyze, design, unit test, and develop robust large-scale applications.Create secure, scalable, and highly available distributed applications.Collaborate with product management and quality assurance to deliver highly efficient features and functionality.Take ownership of a product feature design and development.Participate in code and feature reviews and provide feedback.Provide guidance and support related to your feature to various cross-functional teams within the organization.Mentor and coach other team members.Write technical documents that explain how new modules and new products are implementedParticipate in the full life-cycle development process from definition and design to product delivery\nQualifications BE/BTech/MCA/MSC IT with 1-3 years of experienceStrong knowledge of and experience with object-oriented methodologies, enterprise application architectures, and design pattern,Expert Knowledge of application development using JavaExperience in creating RESTful applications using Spring Boot deployed on a public cloud environment like AWS and/or Azure.Highly experienced with software development processes, and in particular, software design and unit/integration testing using JUnit.Good understanding of application software, secure coding, scalability, performance, and reliability aspectsAbility to work in a fast-paced, test-driven, collaborative, and iterative programming environment. Experience with agile development approaches is a plusA highly motivated individual, who is ready to accept challenges, continually innovate and learn, and help othersExcellent problem-solving and troubleshooting skills.Fluent in written and spoken EnglishExperience with relational database management systems and No SQL like Cassandra.Experience with messaging technologies like Kafka, and JMS\nOptional QualificationsExperience with open-source frameworks such as Spring, Spring Boot, and Spring Integration is a plus.\nAbout Kaleris - NavisKaleris – Navis is the global market leader in a multi-billion dollar industry building and implementing maritime terminal operating systems, optimization and automation solutions at ports around the world. From Long Beach to Hong Kong, Dubai to Brazil, and Rotterdam to Busan, Kaleris – Navis delivers mission critical enterprise software that is at the heart of running a terminal and services to optimize operations. We are an innovative and profitable maritime platform striving to make global trade smarter, safer, and more sustainable for everyone by connecting multiple systems to support a more efficient global container flow. Most of the material goods in the world are transported in containers using our software.",
    "link": "https://www.linkedin.com/jobs/view/3504145426/?eBP=CwEAAAGHHBimMP57ndi2nXDvjQSaYrl53UwEvWRqHTEy3gzeBl_dmn4l_wQrzsnP9pxeuUuj1EnLpbk9-CnlnqRWGsEFo5JcWSZKBLcmzl6TlewcqY147-u01PdNg2sa44EzrzcztfFesUiYMszEbP6L_fRrQKJ2CfRKVKxW23rp7e1iA349yo7yVy8tb5EyInohazcG4pWJ9X1xip8ePyebPJZXclA2mE0nhg7hgAZKm-mCwzysVElaytHJNRyAbdhbhHkZKziv_LveckAfmd3i574NABtYQoNUwQKBwmnMtEVbSqgs1TNXEYdDDk91--CC_kZ449v0kVNScgNjwewk8TbhRMheKvW-5dpA3HF7wqBhUErhPp0IV1Pm&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=fLyDmUUFJQgB792mf067Lw%3D%3D&trackingId=kAif3naVM4WKAg8rNJrqOg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "CM.com",
    "location": "Greater Bengaluru Area, On-site",
    "description": "About the job\n        \n\n\n        \n                  The Challenge\nToday, people all over the world are connected. All day, every day. At CM.com we firmly believe that technology exists to enhance people’s lives. We enable our customers to be part of those lives. Constantly searching for ways to better connect people with each other is what drives us.To help us achieve this mission we are looking for an enthusiastic software engineer to help build our R&D hub in India.\nAs a software engineer at our India office in Bangalore, you will be part of the Connect team that takes the product from a Proof of Concept phase, to the market and to a mature product. The result will be that the Connect product is a mission critical integration into the marketplace. At CM.com we have over 300 people working in our R&D department divided over 25+ agile teams. \nThe productMany of our Payments, Messaging or SaaS products require integrations with external platforms (like Salesforce or Microsoft Dynamics) to truly maximize the value that our customers get out of their product. From Conversational A.I. Chatbots that communicate with ERPs, to a contact center application getting data from an order system, to CRMs that post records to our Customer Data Platform.To avoid a complex web of point solutions, we are launching a new product: CM Connect.  External platforms integrate with CM Connect once, after which the data contracts, authentication and authorization automatically cascade to multiple CM products.\nWhat you offerBachelor’s / Master’s degree in computer science / IT.4 to 8 years’ experience in overall software product development. Preferably in the Cloud/SaaS/Enterprise sectorExpert in C#, preferably with knowledge of the latest .Net 5 and 6 frameworksExperience defining and developing web service API’sAgile and Test driven development methodologiesExcellent verbal and written communication skills with a strong eye for detail\n\nWhat we offerA challenging job within an innovative and international fast-growing company. We are the fastest growing CPaaS company in 2022The opportunity to shape your job with your own skillsAwarded to be a Great Place to Work in 2021 & 2022 by CM.com employeesWorking together with motivated and entrepreneurial colleaguesOnboarding and buddy program to help you to get up to speedPlenty of opportunity for personal and professional growth through courses and training, by among others the CM Academy\nCM.com as a CompanyCM.com is a listed company (Euronext Amsterdam: CMCOM) and provides Conversational Commerce services from its cloud platform that connects enterprises and brands to the mobile phones of billions of consumers worldwide. Conversational Commerce is the convergence of messaging and payments.CM.com has over 1000 employees and 23 offices globally. The CM.com India office is in Bangalore and its headquarters is in Breda. In the Netherlands we have offices in Amsterdam, Utrecht, Arnhem, Enschede and Maastricht.\nApply now and ‘Start the ConversationAre you the candidate we are looking for? Please apply via our company website with your resume and tell us what excites you about this opportunity. The interview process will have four interviewing rounds.\nWe look forward to hearing from you.",
    "link": "https://www.linkedin.com/jobs/view/3504145426/?eBP=CwEAAAGHHBimMP57ndi2nXDvjQSaYrl53UwEvWRqHTEy3gzeBl_dmn4l_wQrzsnP9pxeuUuj1EnLpbk9-CnlnqRWGsEFo5JcWSZKBLcmzl6TlewcqY147-u01PdNg2sa44EzrzcztfFesUiYMszEbP6L_fRrQKJ2CfRKVKxW23rp7e1iA349yo7yVy8tb5EyInohazcG4pWJ9X1xip8ePyebPJZXclA2mE0nhg7hgAZKm-mCwzysVElaytHJNRyAbdhbhHkZKziv_LveckAfmd3i574NABtYQoNUwQKBwmnMtEVbSqgs1TNXEYdDDk91--CC_kZ449v0kVNScgNjwewk8TbhRMheKvW-5dpA3HF7wqBhUErhPp0IV1Pm&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=fLyDmUUFJQgB792mf067Lw%3D%3D&trackingId=kAif3naVM4WKAg8rNJrqOg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer I",
    "companyName": "Eventbrite",
    "location": "India, Remote",
    "description": "About the job\n        \n\n\n        \n                  THE CHALLENGE\nEventbrite's business continues to grow and scale rapidly, powering millions of events. Event creators and event goers need new tools and technologies that empower them to have the most meaningful live experiences. As a Software Engineer at Eventbrite, you will build beautiful, responsive, delightful and intuitive user interfaces that people are excited to use\nTHE TEAM\nWe're a people-focused Engineering organization: the women and men on our team value working together in small teams to solve big problems, supporting an active culture of mentorship and inclusion, and pushing themselves to learn new things daily. Pair programming, weekly demos, tech talks, and quarterly hackathons are at the core of how we’ve built our team and product. We believe in engaging with the community, regularly hosting free events with some of the top technical speakers, and actively contributing to open source software (check out Britecharts as an example!). Our technology spans across web, mobile, API, big data, machine learning, search, physical point of sale, and scanning systems. To learn more about some of the frontend teamwork, check out our frontend blog\nTHE SKILL SET\nAdvanced English Level1-2 years of experience working in a Software Development role Experience with or the excitement to work with Python and Django web frameworkUnderstanding that great code is also maintainable codeYou care about making sure your code is well testedA result driven self starter with great communication and collaboration skillsUnit-testing know-how required, experience with TDD or BDD is an added bonusKnowledge of front-end technologies (HTML, CSS, Ajax, Javascript)Database experience (ideally MySQL, NoSQLis a plus)OOP/OOD knowledge\nBONUS POINTS\nExperience with AWS and developing APIsExperience using non-relational databasesFamiliarity with Eventbrite and a passion for live events\nWhat We Offer\nAt Eventbrite, we strive to support our Britelings and their loved ones through different stages of life with robust and attractive benefits, financial and physical wellness options, and great perks. In addition to offering a competitive salary and company stock, we have other great benefits available. In the Briteland, you’ll find great medical plans, fertility and adoption benefits, wellness reimbursement, generous parental leave, and much more.\nWe Care About Your Mental Health And Wellbeing.\nOur employees enjoy free coaching sessions with Modern Health. We also offer free therapy sessions with a psychologist. You’ll also have access to private medical insurance for you and your family, that includes dental care. And our wellness program to pay for your gym expenses.\nWe work hard to cultivate a diverse, equitable and inclusive culture where Britelings feel like they belong.\nEmployees can participate in resource groups and we offer programming throughout the year to support a diverse and inclusive workplace.\nWe offer ongoing training and career development that meets people where they are in their careers.\nWe offer unlimited access to courses in Udemy, leadership coaching for all managers, Briteling led talks, and weekly company-wide town halls with our CEO. We take culture seriously and design programs with employee feedback in mind to make Eventbrite a great place to work no matter where you work from in the world.\nWork-life balance & flexibility is extremely important to us.\nOur employees can choose what works best for them: work in one of our offices, be fully remote or the best of both worlds! We believe in a flexible working environment to allow Britelings to perform at their best ensuring a healthy work-life balance. We have recently implemented Britebreak Fridays: all Britelings turn off their computers and take the first Friday of every month off to focus on their wellbeing.\nAbout Eventbrite\nEventbrite is a global self-service ticketing and experience technology platform that serves a community of hundreds of thousands of event creators in nearly 180 countries. Since inception, Eventbrite has been at the center of the experience economy, transforming the way people organize and attend events. The company was founded by Julia Hartz, Kevin Hartz and Renaud Visage, with a vision to build a self-service platform that would make it possible for anyone to create and sell tickets to live experiences. The Eventbrite platform provides an intuitive, secure, and reliable service that enables creators to plan and execute their live and online events, whether it’s an annual culinary festival attracting thousands of foodies, a professional webinar, a weekly yoga workshop or a youth dance class. With over 290 million tickets distributed for over 5 million total events in 2021, Eventbrite is where people all over the world discover new things to do or new ways to do more of what they love. Learn more at www.eventbrite.com .\nIS THIS ROLE NOT AN EXACT FIT?\nSign up to keep in touch and we’ll let you know when we have new positions on our team .\nEventbrite is committed to equality of opportunity for all staff, and applications from all suitably qualified individuals are encouraged, regardless of age, disability, sex, gender reassignment, sexual orientation, pregnancy and maternity, race, religion or belief and marriage and civil partnerships.\nApplicant Privacy Notice",
    "link": "https://www.linkedin.com/jobs/view/3504145426/?eBP=CwEAAAGHHBimMP57ndi2nXDvjQSaYrl53UwEvWRqHTEy3gzeBl_dmn4l_wQrzsnP9pxeuUuj1EnLpbk9-CnlnqRWGsEFo5JcWSZKBLcmzl6TlewcqY147-u01PdNg2sa44EzrzcztfFesUiYMszEbP6L_fRrQKJ2CfRKVKxW23rp7e1iA349yo7yVy8tb5EyInohazcG4pWJ9X1xip8ePyebPJZXclA2mE0nhg7hgAZKm-mCwzysVElaytHJNRyAbdhbhHkZKziv_LveckAfmd3i574NABtYQoNUwQKBwmnMtEVbSqgs1TNXEYdDDk91--CC_kZ449v0kVNScgNjwewk8TbhRMheKvW-5dpA3HF7wqBhUErhPp0IV1Pm&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=fLyDmUUFJQgB792mf067Lw%3D%3D&trackingId=kAif3naVM4WKAg8rNJrqOg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Sr Software Engineer",
    "companyName": "Zuora",
    "location": "Chennai, Tamil Nadu, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  OUR VISION: THE WORLD. SUBSCRIBED.\nCustomers have changed. They’re looking for new ways to engage with businesses. Consumers today have a new set of expectations. They want outcomes, not ownership. Customization, not generalization. Constant improvement, not planned obsolescence.\nIn the old world (let’s call it the Product Economy) it was all about things. Acquiring new customers, shipping commodities, billing for one-time transactions. But in today’s new era, it’s all about relationships. More and more customers are becoming subscribers because subscription experiences built around services meet consumers’ needs better than the static offerings or a single product.\nOur vision is “The World Subscribed” where one day every company will be a part of the Subscription Economy® (a phrase coined by our CEO, Tien Tzuo, and author of the best-selling book Subscribed).\nAs consumers wave goodbye to ownership, join us as we help companies win on their journey to usership!\nTHE TEAM\nModern finance leaders are looking for new ways to strategically advise their business and ultimately scale revenue growth. But as they adopt increasingly complex pricing models incorporating a mix of subscriptions, one-time, and usage-based offers, their financial close process has become more resource-intensive, prone to human error, and can span weeks.\nWith Zuora Revenue, businesses can not only automatically recognize, reconcile, and analyze revenue in real-time, but they can accurately close the books as early as Day 0, while easily forecasting their revenue targets.\nYou read more about it at https://www.zuora.com/products/revenue/\nTHE OPPORTUNITY (AKA: Why you want this role over any other out there) \nWe are looking for a Sr Engineer who is self-motivated to design, develop, test, and operate cutting-edge, large scalable, and enterprise SaaS applications.\nOur Tech Stack: Java, Spring, Rest API, Microservices, Kafka, AWS, Kubernetes, Terraform, Apache Pinot, AngularJS, Oracle, PL/SQL, Jenkins\nWhat You’ll Achieve\nEnable scrum teams to be successful by designing & building DevOps tools and CI/CD pipelines to meet the delivery and quality commitmentsPlan, design and implement the right tooling for the operation of large scale enterprise SaaS applicationsHelp the team achieve the bold goal of every commit reaching production post quality gates.Help with Zuora’s transition to micro-service and cloud-based architecture.Raise the bar on engineering practices and code quality.\nWhat You’ll Need To Be Successful\nBTech/BE/BS/MS/PHD in Computer Engineering discipline or relevant degree. 10+ years of experience specializing in Dev/ops for enterprise SaaS products Self-starter who is able to make a large impact with minimal supervision.Proficiency with AWS Services including Lambda, EC2, ECS, EMR, S3, Cloudwatch.Strong in scripting languages such as Python, Groovy etcHands-on experience with build engineering tools such as Gitlab, Jenkins, docker, chef, or similar (Ability to learn new tools)Hands-on experience with modern container orchestration services such as K8’s/ ECS etc.Knowledge of Oracle, and PL/SQL will be an advantageExcellent Problem Solving and communication skills.\nWhat are the benefits of working at Zuora?\nEmployee Stock Purchase PlanMedical Coverage and Parental Leave Carrer cash to keep yourself updatedRefresh/wellness holidays along with standard time offOur campus includes a game area along with a well-stocked pantry\nAbout Zuora & Our “zeo” Culture\nZuora (NYSE: ZUO) Zuora provides the leading cloud-based subscription management platform that functions as a system of record for subscription businesses across all industries. Powering the Subscription Economy®, the Zuora platform was architected specifically for dynamic, recurring subscription business models and acts as an intelligent subscription management hub that automates and orchestrates the entire subscription order-to-revenue process seamlessly across billing and revenue recognition. Zuora serves more than 1,000 companies around the world, including Box, Ford, Penske Media Corporation, Schneider Electric, Siemens, Xplornet, and Zoom.\nAt Zuora, we have one CEO but every employee is empowered and supported to be the ‘ZEO’ of their own career experience. By embedding inclusion and belonging into our processes, policies and culture, we are building a workplace where our 1,200+ ZEOs across North America, Europe, and APAC can bring all the elements of who they are into their work. In addition to an industry-leading six-month, 100% paid parental leave for all our ZEOs, we also offer programs to support your mental health and give back to our communities along with “career cash” and plenty of learning and development opportunities.\nTo learn more visit www.zuora.com\nZuora is proud to be an Equal Employment Opportunity Employer.\nWe believe the Subscription Economy has the power to make the world a better place by broadening access, increasing inclusion, and bolstering sustainability. At Zuora, we’re creating a culture that every ZEO wants to subscribe to. We achieve our vision and mission for diversity and inclusion through our framework ONE ZUORA: Inspiring Innovation through Inclusion.\nZuora does not discriminate on the basis of, and considers individuals seeking employment with Zuora without regards to, race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics.\nZuora is proud to be an Equal Opportunity Employer committed to creating an inclusive environment for all. We encourage candidates from all backgrounds to apply. Applicants in need of special assistance or accommodation during the interview process or in accessing our website may contact us by sending an email to assistance(at)zuora.com.",
    "link": "https://www.linkedin.com/jobs/view/3504145426/?eBP=CwEAAAGHHBimMP57ndi2nXDvjQSaYrl53UwEvWRqHTEy3gzeBl_dmn4l_wQrzsnP9pxeuUuj1EnLpbk9-CnlnqRWGsEFo5JcWSZKBLcmzl6TlewcqY147-u01PdNg2sa44EzrzcztfFesUiYMszEbP6L_fRrQKJ2CfRKVKxW23rp7e1iA349yo7yVy8tb5EyInohazcG4pWJ9X1xip8ePyebPJZXclA2mE0nhg7hgAZKm-mCwzysVElaytHJNRyAbdhbhHkZKziv_LveckAfmd3i574NABtYQoNUwQKBwmnMtEVbSqgs1TNXEYdDDk91--CC_kZ449v0kVNScgNjwewk8TbhRMheKvW-5dpA3HF7wqBhUErhPp0IV1Pm&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=fLyDmUUFJQgB792mf067Lw%3D%3D&trackingId=kAif3naVM4WKAg8rNJrqOg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Lead Software Engineer",
    "companyName": "HERE Technologies",
    "location": "Bengaluru East, Karnataka, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  What's the role? \nAs a Lead Software Engineer, you'll have the opportunity to work on this amazing product. Within the cross-functional and self-organized team, you’ll have fun working on systems under huge load and storing a vast amount of data in the very heart of our platform - the Delivery Platform. These services are mission-critical and meet demanding compliance, security, performance, and uptime requirements. You will help run it on production with full control and responsibility. Your role encompasses defining and working on features and technical tasks in a self-directed fashion, supporting your colleagues with technical challenges, working with product management to analyse requirements, talking to stakeholders, designing, implementing, and documenting solutions as well as testing and reviewing your colleagues' work.\nTeam Shared Responsibilities\n architecture, design, develop, test the backend components  evaluate and choose technologies suitable for work  elaboration and refinement of user stories  development infrastructure (build, testing, continuous integration, delivery)  run, monitor, and support in production, ensure our customers receive world-class service by periodically participating in 24x7 on-call shifts  team ceremonies (planning, demo, triage, retrospective)  communicate effectively about decisions, direction, and progress, both inside and outside the team \n Who are you? \nAn ambitious team-player who has experience developing and deploying production-grade services. You have experience with the production software lifecycle, as well as deployment of software to production ready, stable environments. You have 7+ years of professional software development and deployment experience including knowledge of continuous integration, continuous delivery, and automated testing disciplines. You also have good interpersonal skills and feel comfortable coordinating across teams in multiple design centres.\n Bachelor/Masters in a technical degree like C.S. or technical management  Strong programming skills with 7 plus years of experience; Python experience required  Experience with cloud-based technologies (e.g. AWS, Azure, GCP, OCI)  Experience with Kubernetes  Knowledge with distributed systems; Docker, Terraform, Puppet are desired  Experience with deployment automation systems (e.g. Jenkins, Gitlab, etc.)  Interest in high throughput, low latency, highly reliable systems at scale  Interest in DevOps methodologies to drive throughput and stability  What we offer \n Cutting-edge technology environment  Challenging real-world problems to solve  Work that makes a difference in the world  Freedom to decide how to perform your work  Variety in the types of projects  Variety of Learning & Development options.  Collaborative and encouraging Colleagues. \nHERE is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, age, gender identity, sexual orientation, marital status, parental status, religion, sex, national origin, disability, veteran status, and other legally protected characteristics.\nMake HERE your destination, we are just getting started. Apply now!\n Who are we? \nHERE Technologies is a location data and technology platform company. We empower our customers to achieve better outcomes – from helping a city manage its infrastructure or a business optimize its assets to guiding drivers to their destination safely.\nAt HERE we take it upon ourselves to be the change we wish to see. We create solutions that fuel innovation, provide opportunity and foster inclusion to improve people’s lives. If you are inspired by an open world and driven to create positive change, join us. Learn more about us. Watch Video\nHERE is looking for Lead Software Engineers to join its fast-growing and highly motivated Delivery Platform team. The Delivery Platform team is responsible for providing the enabling layers to the HERE Platform through identity and access management, accounting, billing, container orchestration, cloud abstraction, big data management, processing, and streaming services. The Delivery Platform services are mission-critical and meet demanding compliance, security, performance, and uptime requirements.",
    "link": "https://www.linkedin.com/jobs/view/3504145426/?eBP=CwEAAAGHHBimMP57ndi2nXDvjQSaYrl53UwEvWRqHTEy3gzeBl_dmn4l_wQrzsnP9pxeuUuj1EnLpbk9-CnlnqRWGsEFo5JcWSZKBLcmzl6TlewcqY147-u01PdNg2sa44EzrzcztfFesUiYMszEbP6L_fRrQKJ2CfRKVKxW23rp7e1iA349yo7yVy8tb5EyInohazcG4pWJ9X1xip8ePyebPJZXclA2mE0nhg7hgAZKm-mCwzysVElaytHJNRyAbdhbhHkZKziv_LveckAfmd3i574NABtYQoNUwQKBwmnMtEVbSqgs1TNXEYdDDk91--CC_kZ449v0kVNScgNjwewk8TbhRMheKvW-5dpA3HF7wqBhUErhPp0IV1Pm&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=fLyDmUUFJQgB792mf067Lw%3D%3D&trackingId=kAif3naVM4WKAg8rNJrqOg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer- Full Stack",
    "companyName": "IKEA",
    "location": "Bengaluru, Karnataka, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  \nWe are creating a better financial every day for the modern lives of the many people, and we need your help to do it!\n\nOur team is building new products to help create better finances, financing their dreams, and making more responsible choices. We are in the early phases of establishing these products and for some, we are still validating our main hypothesis of customer value.\n\nSo, if you would like to get in on the ground floor of a fantastic journey to help our customers, this is the team to join!\n\nWhat You’ll Need To Have\n\nBeing a greenfield space, you will get to influence the technology landscape in the team. The technology considerations could include (but is not limited to), tech stack used by our sister teams - such as \n• Frontend - React and Typescript with the CI pipeline in GitHub actions \n• Backend - Golang (running on GCP, using Cloud Run as compute and Cloud Spanner as primary storage)\n• Java/J2EE, NodeJS, React JS, HTML 5, CSS 3 Javascript etc.\n• Fastly Compute at Edge\n• NodeJS\n• Fastly\n• Akamai CDN / WAF\n• Optimizely Fullstack\n• Auth0\n\nWe Prefer\n\n• Formal qualifications in computer science, software engineering, or any engineering equivalent\n• Minimum 4 years of professional experience as software engineer with similar level of experience in the specific tech stack for the area\n• Minimum 1 years’ experience of working in agile/iterative software development teams with a DevOps working setup and with an emphasis on self-organization and delivery to agreed commitments\n• Experience in React and Typescript, GCP, GoLang (secondary preference node.js)\n• Knowledgeable in cloud native development\n• Experience in building, running and operating systems that handle significant traffic volumes.\n• Has a user-centered approach to software engineering\n• Experience in developing services that dynamically scale and understands upstream and downstream effects of this\n• Strong analytical skills and ability to solve complex problems at scale\n• Excellent written and verbal English communication skills\n• Anyone with prior start up experience or building new application from scratch experience (highly recommended) \n• Comfortable working through ambiguity \n \n \n “At IKEA, you’re welcome no matter where you come from, what you believe, and what you look like. We don’t even care how you have furnished your home. We’re interested in you simply because you’re you. Our different views, backgrounds, and personalities make us better understand our customers, give us more fun at work and spark more and better ideas. Perhaps your unique take on something could lead to a great idea that creates a better everyday life for the many people\n\nWe are looking for an engineer that enjoys building things that make an impact with our customers. Are you excited about technology and want a chance to be part of building better digital products for our customers? Look no further, you have arrived at the right opportunity!\n\nOur teams come from diverse backgrounds, coming together in the mission of creating a better everyday life for the many people over several touchpoints for the customers. In a true cross functional team with designers, data analysts, engineers, agile coach, and product owner we make this a reality.\n\nWe expect all team members to contribute to good software design principles and keep each other accountable for the principles decided upon in the team. We use these principles to guide the team when looking for new solutions to problems, such as bringing in new tools, frameworks or creating new solutions.\n\n\nSpecifically, we are looking for an engineer with experience in building web applications at scale, versed in both – frontend and backend\n\nA Day In Your Life With Us\n\nAs Software Engineer, your main responsibilities will include:\n• Building software that meets the team’s high standards\n• Contribute to all aspects of the product lifecycle, with a focus on engineering (including new product ideas)\n• Promote good software engineering practices within an agile/iterative development approach in order to improve time to market and fulfill business needs\n• Contribute to solution architecture and contribute to the landscape architecture\n• Define, maintain, and improve our integration and delivery pipeline\n• Explore and apply new technologies suitable for our product\n• Take responsibility for the product, all the way from ideation to runtime, this may include on call duties \n \n TOGETHER AS A TEAM \n Studies show that members of underrepresented communities don’t apply for jobs unless they’re 100% “qualified”. If this is part of the reason you hesitate to apply, we like you to reconsider and give it a chance. Maybe your profile fits our needs much better than you think. We look forward to receiving your application.\n\nFrom: “Why Women Don’t Apply for Jobs Unless They’re 100% Qualified” by Tara Sophia Mohr, August 2014”\n\n\nWe warmly welcome your application!",
    "link": "https://www.linkedin.com/jobs/view/3504145426/?eBP=CwEAAAGHHBimMP57ndi2nXDvjQSaYrl53UwEvWRqHTEy3gzeBl_dmn4l_wQrzsnP9pxeuUuj1EnLpbk9-CnlnqRWGsEFo5JcWSZKBLcmzl6TlewcqY147-u01PdNg2sa44EzrzcztfFesUiYMszEbP6L_fRrQKJ2CfRKVKxW23rp7e1iA349yo7yVy8tb5EyInohazcG4pWJ9X1xip8ePyebPJZXclA2mE0nhg7hgAZKm-mCwzysVElaytHJNRyAbdhbhHkZKziv_LveckAfmd3i574NABtYQoNUwQKBwmnMtEVbSqgs1TNXEYdDDk91--CC_kZ449v0kVNScgNjwewk8TbhRMheKvW-5dpA3HF7wqBhUErhPp0IV1Pm&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=fLyDmUUFJQgB792mf067Lw%3D%3D&trackingId=kAif3naVM4WKAg8rNJrqOg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer- Full Stack",
    "companyName": "IKEA",
    "location": "Bengaluru, Karnataka, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  \nWe are creating a better financial every day for the modern lives of the many people, and we need your help to do it!\n\nOur team is building new products to help create better finances, financing their dreams, and making more responsible choices. We are in the early phases of establishing these products and for some, we are still validating our main hypothesis of customer value.\n\nSo, if you would like to get in on the ground floor of a fantastic journey to help our customers, this is the team to join!\n\nWhat You’ll Need To Have\n\nBeing a greenfield space, you will get to influence the technology landscape in the team. The technology considerations could include (but is not limited to), tech stack used by our sister teams - such as \n• Frontend - React and Typescript with the CI pipeline in GitHub actions \n• Backend - Golang (running on GCP, using Cloud Run as compute and Cloud Spanner as primary storage)\n• Java/J2EE, NodeJS, React JS, HTML 5, CSS 3 Javascript etc.\n• Fastly Compute at Edge\n• NodeJS\n• Fastly\n• Akamai CDN / WAF\n• Optimizely Fullstack\n• Auth0\n\nWe Prefer\n\n• Formal qualifications in computer science, software engineering, or any engineering equivalent\n• Minimum 4 years of professional experience as software engineer with similar level of experience in the specific tech stack for the area\n• Minimum 1 years’ experience of working in agile/iterative software development teams with a DevOps working setup and with an emphasis on self-organization and delivery to agreed commitments\n• Experience in React and Typescript, GCP, GoLang (secondary preference node.js)\n• Knowledgeable in cloud native development\n• Experience in building, running and operating systems that handle significant traffic volumes.\n• Has a user-centered approach to software engineering\n• Experience in developing services that dynamically scale and understands upstream and downstream effects of this\n• Strong analytical skills and ability to solve complex problems at scale\n• Excellent written and verbal English communication skills\n• Anyone with prior start up experience or building new application from scratch experience (highly recommended) \n• Comfortable working through ambiguity \n \n \n “At IKEA, you’re welcome no matter where you come from, what you believe, and what you look like. We don’t even care how you have furnished your home. We’re interested in you simply because you’re you. Our different views, backgrounds, and personalities make us better understand our customers, give us more fun at work and spark more and better ideas. Perhaps your unique take on something could lead to a great idea that creates a better everyday life for the many people\n\nWe are looking for an engineer that enjoys building things that make an impact with our customers. Are you excited about technology and want a chance to be part of building better digital products for our customers? Look no further, you have arrived at the right opportunity!\n\nOur teams come from diverse backgrounds, coming together in the mission of creating a better everyday life for the many people over several touchpoints for the customers. In a true cross functional team with designers, data analysts, engineers, agile coach, and product owner we make this a reality.\n\nWe expect all team members to contribute to good software design principles and keep each other accountable for the principles decided upon in the team. We use these principles to guide the team when looking for new solutions to problems, such as bringing in new tools, frameworks or creating new solutions.\n\n\nSpecifically, we are looking for an engineer with experience in building web applications at scale, versed in both – frontend and backend\n\nA Day In Your Life With Us\n\nAs Software Engineer, your main responsibilities will include:\n• Building software that meets the team’s high standards\n• Contribute to all aspects of the product lifecycle, with a focus on engineering (including new product ideas)\n• Promote good software engineering practices within an agile/iterative development approach in order to improve time to market and fulfill business needs\n• Contribute to solution architecture and contribute to the landscape architecture\n• Define, maintain, and improve our integration and delivery pipeline\n• Explore and apply new technologies suitable for our product\n• Take responsibility for the product, all the way from ideation to runtime, this may include on call duties \n \n TOGETHER AS A TEAM \n Studies show that members of underrepresented communities don’t apply for jobs unless they’re 100% “qualified”. If this is part of the reason you hesitate to apply, we like you to reconsider and give it a chance. Maybe your profile fits our needs much better than you think. We look forward to receiving your application.\n\nFrom: “Why Women Don’t Apply for Jobs Unless They’re 100% Qualified” by Tara Sophia Mohr, August 2014”\n\n\nWe warmly welcome your application!",
    "link": "https://www.linkedin.com/jobs/view/3504145426/?eBP=CwEAAAGHHBimMP57ndi2nXDvjQSaYrl53UwEvWRqHTEy3gzeBl_dmn4l_wQrzsnP9pxeuUuj1EnLpbk9-CnlnqRWGsEFo5JcWSZKBLcmzl6TlewcqY147-u01PdNg2sa44EzrzcztfFesUiYMszEbP6L_fRrQKJ2CfRKVKxW23rp7e1iA349yo7yVy8tb5EyInohazcG4pWJ9X1xip8ePyebPJZXclA2mE0nhg7hgAZKm-mCwzysVElaytHJNRyAbdhbhHkZKziv_LveckAfmd3i574NABtYQoNUwQKBwmnMtEVbSqgs1TNXEYdDDk91--CC_kZ449v0kVNScgNjwewk8TbhRMheKvW-5dpA3HF7wqBhUErhPp0IV1Pm&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=fLyDmUUFJQgB792mf067Lw%3D%3D&trackingId=kAif3naVM4WKAg8rNJrqOg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "Nucleus Software",
    "location": "Chennai, Tamil Nadu, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Role: Software Engineer Location § Work Location : Chennai/Noida Job Role & Responsibilities Develop and support applications through all phases of the project life cycle, including Design, Development, Testing Support and Release SupportHaving good hands-on experience in C# .Net platform, MVC, SQL, PL/SQL Required to develop applications using C# and .Net platformRequired to work independently with the customer and engage well with themGood understanding of design principles and Object oriented programmingDevelop Low level design documentsResponsible for coding, Developing test cases and unit testingAdhering to the schedule and scope of the projectEnsure to follow Technology and Process standards set for the projectProduce high quality technical deliverables for the customerInteract with project lead to review Technical deliverablesProvide status updates to Project lead and Manager Key Deliverables Design and Develop Programs with high quality and agreed processes, within the planned scheduleDeliver quality code following the Technology and Process Standards set for the projectDetailed Application Analysis documents and Impact Analysis documentsTechnical Design Documents (LLD)Deliver reviewed Test cases with Test Results Required for the Position 4+ years of experience in Developing the applications/product using C# and .Net in Banking domain Should have passion for technology and possess good learning skillsShould have Expertise in Classes, Session management, MVC, Paging, Java Script, J Query, Web ApplicationMust be strong in OOPs Concepts and common design patternsShould be experienced and have good knowledge in SQL, PL/SQLShould possess excellent communication skills Should possess excellent de-bugging, troubleshooting and problem solving skillsShould possess good client interaction skills and should be able to work independently with the clientShould be proactive and self-initiated",
    "link": "https://www.linkedin.com/jobs/view/3504145426/?eBP=CwEAAAGHHBimMP57ndi2nXDvjQSaYrl53UwEvWRqHTEy3gzeBl_dmn4l_wQrzsnP9pxeuUuj1EnLpbk9-CnlnqRWGsEFo5JcWSZKBLcmzl6TlewcqY147-u01PdNg2sa44EzrzcztfFesUiYMszEbP6L_fRrQKJ2CfRKVKxW23rp7e1iA349yo7yVy8tb5EyInohazcG4pWJ9X1xip8ePyebPJZXclA2mE0nhg7hgAZKm-mCwzysVElaytHJNRyAbdhbhHkZKziv_LveckAfmd3i574NABtYQoNUwQKBwmnMtEVbSqgs1TNXEYdDDk91--CC_kZ449v0kVNScgNjwewk8TbhRMheKvW-5dpA3HF7wqBhUErhPp0IV1Pm&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=fLyDmUUFJQgB792mf067Lw%3D%3D&trackingId=kAif3naVM4WKAg8rNJrqOg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Manual Test Engineer",
    "companyName": "cure.fit (cult.fit)",
    "location": "Bengaluru, Karnataka, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Founded in 2016 by Mukesh Bansal and Ankit Nagori , Cure.fit is a mobile app that takes a holistic approach towards health and fitness by bringing together all aspects of a healthy lifestyle on a single platform. Cure.fit offers both online and offline experiences across fitness, nutrition and mental well-being through its 4 products, i.e. Cult.fit , Eat.fit , Mind.fit & Care.fit with the aim to make fitness fun and easy\n\nAs a Quality member, you will test the applications developed by custom development. You will be involved in end-to-end processes and metrics for software testing within the organization . You will collaborate with project managers and software developers to establish reporting metrics, test scenarios, and efficiencies through manual testing and streamlining QA techniques to achieve quality objectives.\n\nThis Role Demands Someone Who Has\nAbility to work effectively in a fast-paced and changing business environment.Flexibility, adaptability, and work in minimal supervision if required are must to have to be successful in this role.\nSkills & Experience\nWell versed with testing methodologies\nMust-Have Skills\nHaving good knowledge on iOS/Android based apps testing.Highly proficient in manual testing (Different types of testing: Regression, Sanity, Smoke & Functionality related)Good at writing manual test cases with all possible scenarios.Knowledge of defect reporting & bug tracking using JiraGood in debugging skillsKnowledge of software development lifecycleGood communication skills\nGood To Have Skills\nDecent problem solving skills and ability to write code.API testingWebsite testingPrevious experience of testing e-commerce applicationsExperience working with Agile methodologiesAbility to find, file, and manage bugs, aggressively driving qualityExperienced in testing larger scale projects/ quick changes from planning to sign offMust be extremely responsive, able to work under pressure in crisis with a strong sense of urgencyAbility to independently create test data as per the requirements\nEducation And Experience\nRequires Bachelors in Engineering Degree or equivalent2-4 years minimum professional experience in testing\nKey Responsibilities\nAnalyzing the requirement from a testing perspectiveCreating test plans and writing test scriptsClosely working with the scrum master and product owner to identify the risk areasManaging the defects logged and tracking them till they get closedPerforming RCA over the defects loggedIn-depth regression testing which will cover all the components\nAt Cure.fit , our mission is to “make health easy”. Through our products and services, we want to enable people to significantly improve their overall health, reduce the risk of lifestyle diseases and enable a long, disease free life. We are deeply passionate about health, fitness, and the general well-being and are eager to leverage the power of technology to help people live healthier, happier lives.\n\nIn pursuit of this objective, we are always looking for excellent team members to fulfill the vision of building these incredible and innovative products.",
    "link": "https://www.linkedin.com/jobs/view/3504145426/?eBP=CwEAAAGHHBimMP57ndi2nXDvjQSaYrl53UwEvWRqHTEy3gzeBl_dmn4l_wQrzsnP9pxeuUuj1EnLpbk9-CnlnqRWGsEFo5JcWSZKBLcmzl6TlewcqY147-u01PdNg2sa44EzrzcztfFesUiYMszEbP6L_fRrQKJ2CfRKVKxW23rp7e1iA349yo7yVy8tb5EyInohazcG4pWJ9X1xip8ePyebPJZXclA2mE0nhg7hgAZKm-mCwzysVElaytHJNRyAbdhbhHkZKziv_LveckAfmd3i574NABtYQoNUwQKBwmnMtEVbSqgs1TNXEYdDDk91--CC_kZ449v0kVNScgNjwewk8TbhRMheKvW-5dpA3HF7wqBhUErhPp0IV1Pm&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=fLyDmUUFJQgB792mf067Lw%3D%3D&trackingId=kAif3naVM4WKAg8rNJrqOg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Manual Test Engineer",
    "companyName": "cure.fit (cult.fit)",
    "location": "Bengaluru, Karnataka, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Founded in 2016 by Mukesh Bansal and Ankit Nagori , Cure.fit is a mobile app that takes a holistic approach towards health and fitness by bringing together all aspects of a healthy lifestyle on a single platform. Cure.fit offers both online and offline experiences across fitness, nutrition and mental well-being through its 4 products, i.e. Cult.fit , Eat.fit , Mind.fit & Care.fit with the aim to make fitness fun and easy\n\nAs a Quality member, you will test the applications developed by custom development. You will be involved in end-to-end processes and metrics for software testing within the organization . You will collaborate with project managers and software developers to establish reporting metrics, test scenarios, and efficiencies through manual testing and streamlining QA techniques to achieve quality objectives.\n\nThis Role Demands Someone Who Has\nAbility to work effectively in a fast-paced and changing business environment.Flexibility, adaptability, and work in minimal supervision if required are must to have to be successful in this role.\nSkills & Experience\nWell versed with testing methodologies\nMust-Have Skills\nHaving good knowledge on iOS/Android based apps testing.Highly proficient in manual testing (Different types of testing: Regression, Sanity, Smoke & Functionality related)Good at writing manual test cases with all possible scenarios.Knowledge of defect reporting & bug tracking using JiraGood in debugging skillsKnowledge of software development lifecycleGood communication skills\nGood To Have Skills\nDecent problem solving skills and ability to write code.API testingWebsite testingPrevious experience of testing e-commerce applicationsExperience working with Agile methodologiesAbility to find, file, and manage bugs, aggressively driving qualityExperienced in testing larger scale projects/ quick changes from planning to sign offMust be extremely responsive, able to work under pressure in crisis with a strong sense of urgencyAbility to independently create test data as per the requirements\nEducation And Experience\nRequires Bachelors in Engineering Degree or equivalent2-4 years minimum professional experience in testing\nKey Responsibilities\nAnalyzing the requirement from a testing perspectiveCreating test plans and writing test scriptsClosely working with the scrum master and product owner to identify the risk areasManaging the defects logged and tracking them till they get closedPerforming RCA over the defects loggedIn-depth regression testing which will cover all the components\nAt Cure.fit , our mission is to “make health easy”. Through our products and services, we want to enable people to significantly improve their overall health, reduce the risk of lifestyle diseases and enable a long, disease free life. We are deeply passionate about health, fitness, and the general well-being and are eager to leverage the power of technology to help people live healthier, happier lives.\n\nIn pursuit of this objective, we are always looking for excellent team members to fulfill the vision of building these incredible and innovative products.",
    "link": "https://www.linkedin.com/jobs/view/3504145426/?eBP=CwEAAAGHHBimMP57ndi2nXDvjQSaYrl53UwEvWRqHTEy3gzeBl_dmn4l_wQrzsnP9pxeuUuj1EnLpbk9-CnlnqRWGsEFo5JcWSZKBLcmzl6TlewcqY147-u01PdNg2sa44EzrzcztfFesUiYMszEbP6L_fRrQKJ2CfRKVKxW23rp7e1iA349yo7yVy8tb5EyInohazcG4pWJ9X1xip8ePyebPJZXclA2mE0nhg7hgAZKm-mCwzysVElaytHJNRyAbdhbhHkZKziv_LveckAfmd3i574NABtYQoNUwQKBwmnMtEVbSqgs1TNXEYdDDk91--CC_kZ449v0kVNScgNjwewk8TbhRMheKvW-5dpA3HF7wqBhUErhPp0IV1Pm&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=fLyDmUUFJQgB792mf067Lw%3D%3D&trackingId=kAif3naVM4WKAg8rNJrqOg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "ACI Worldwide",
    "location": "Bengaluru, Karnataka, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Job Description\n\nJob Summary:\n\nAnalyzes, designs, programs, debugs, and modifies software enhancements and/or new products used in local, networked, or Internet-related computer programs. Using current programming language and technologies, writes code, completes programming, and performs testing and debugging of applications. Completes documentation and procedures for installation and maintenance. May interact with users to define system requirements and/or necessary modifications.\n\nJob Responsibilities:\n\nParticipates in the design, development, testing of high-quality software/solutions.Assists with direct estimates, such as time, percentage of project completion, etc. to lead and/or manage.Creates and reviews product/project deliverables according to the life cycle methodologies (i.e., impact assessments, external & internal specifications, manuals, education material, etc.).Creates and reviews unit, integration, system, and/or QA test plans/scripts, executes tests, and analyzes the results.Perform other duties as assignedUnderstand and adhere to all corporate policies to include but not limited to the ACI Code of Business Conduct and Ethics.\n\nKnowledge, Skills and Experience required for the job:\n\nBachelor’s degree in Computer Science or related field or equivalent experience in software development tasks.2 years related experience.\n\nPreferred Knowledge, Skills and Experience needed for the job:\n\nWork Environment:\n\nStandard work environmentMajority of time spent on PC (Phys. Req.)Travel required, may be domestic or international",
    "link": "https://www.linkedin.com/jobs/view/3504145426/?eBP=CwEAAAGHHBimMP57ndi2nXDvjQSaYrl53UwEvWRqHTEy3gzeBl_dmn4l_wQrzsnP9pxeuUuj1EnLpbk9-CnlnqRWGsEFo5JcWSZKBLcmzl6TlewcqY147-u01PdNg2sa44EzrzcztfFesUiYMszEbP6L_fRrQKJ2CfRKVKxW23rp7e1iA349yo7yVy8tb5EyInohazcG4pWJ9X1xip8ePyebPJZXclA2mE0nhg7hgAZKm-mCwzysVElaytHJNRyAbdhbhHkZKziv_LveckAfmd3i574NABtYQoNUwQKBwmnMtEVbSqgs1TNXEYdDDk91--CC_kZ449v0kVNScgNjwewk8TbhRMheKvW-5dpA3HF7wqBhUErhPp0IV1Pm&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=fLyDmUUFJQgB792mf067Lw%3D%3D&trackingId=kAif3naVM4WKAg8rNJrqOg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer - Full Stack - Chennai",
    "companyName": "Appian Corporation",
    "location": "Chennai, Tamil Nadu, India, ",
    "description": "About the job\n        \n\n\n        \n                  Software Engineer - Full Stack\n\nHere at Appian, we’re passionate about technology. We love making it, and we love using it. Joining Appian Engineering will provide you with the opportunity to learn in an environment that values cross-functional collaboration and is committed to personal and professional growth. We want to revolutionise the way people work, and in doing so, we develop the Appian platform to be simple so our customers can thrive.\n\nAs a mid-level Software Engineer at Appian you will help build automation (RPA, AI, ML) into the next generation of our core low-code application development platform and help tackle our most challenging technical problems alongside other brilliant engineers.\n\nTo Be Successful In This Role, You Will\n Respond to and resolve emergent problems; write software and build automation to prevent problem recurrence  Leverage knowledge of data structures, algorithms, and design patterns to write software in a full-stack Java & web technology environment, including but not limited to Gradle, JDBC, Hibernate, Spring, Kafka, Quartz, Typescript, Redux and React  Utilize both object-oriented as well as functional programming approaches in different technologies to implement features effectively.  Leverage relevant software development experience to radiate best practices and faster development  Manage availability, latency, scalability and efficiency of the product by designing reliability into software and systems  Be a strong contributor to team feature breakdowns/sizing and design of new feature implementations  Have a high degree of personal responsibility for the overall performance of the team, including capabilities, quality, stability and velocity  Seek to identify opportunities for code refactoring and performance optimisations on a regular basis and champion these efforts within the team  Effectively communicate technical designs verbally and/or in writing for small to medium sized technical audiences. \nBasic Qualifications\n 2 - 10+ years experience building and delivering enterprise grade software applications  You’re a tinkerer at heart with an innate ability to solve tough system problems  Experience in CI/CD in Cloud environments, like AWS and continuous integration systems, like Jenkins  You thrive on solving labyrinthine problems within large, high-performance, real-time, distributed data systems  BE/B.Tech/BS in Computer Science or related technical discipline  MS in Computer Science preferred  Demonstrable understanding of systems, algorithms, and OO design or webapi design.  You have been a strong contributor to breakdowns/sizing and design of new feature implementations.  Agile is your mantra and quality is your goal. \nAbout Appian\n\nBefore Appian was a company, it was an idea. Not about a product or a market, but about the culture needed to sustain innovation and value. Today, we help businesses build apps and workflows rapidly, with a low-code automation platform. Appian was founded on the belief that talented and passionate people, given the power and autonomy to excel, will deliver amazing impact. We have worked thoughtfully to create an inclusive, agile and collaborative work environment where employees feel challenged, and all voices are heard. We value and encourage cross-departmental collaboration, and actively seek opportunities to better ourselves and others. Creating impact to us means that when we deliver results, we’re focused on lasting positive change.\n\nJoin us.",
    "link": "https://www.linkedin.com/jobs/view/3504145426/?eBP=CwEAAAGHHBimMP57ndi2nXDvjQSaYrl53UwEvWRqHTEy3gzeBl_dmn4l_wQrzsnP9pxeuUuj1EnLpbk9-CnlnqRWGsEFo5JcWSZKBLcmzl6TlewcqY147-u01PdNg2sa44EzrzcztfFesUiYMszEbP6L_fRrQKJ2CfRKVKxW23rp7e1iA349yo7yVy8tb5EyInohazcG4pWJ9X1xip8ePyebPJZXclA2mE0nhg7hgAZKm-mCwzysVElaytHJNRyAbdhbhHkZKziv_LveckAfmd3i574NABtYQoNUwQKBwmnMtEVbSqgs1TNXEYdDDk91--CC_kZ449v0kVNScgNjwewk8TbhRMheKvW-5dpA3HF7wqBhUErhPp0IV1Pm&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=fLyDmUUFJQgB792mf067Lw%3D%3D&trackingId=kAif3naVM4WKAg8rNJrqOg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer",
    "companyName": "Victoria's Secret",
    "location": "Bengaluru, Karnataka, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Description\nPurpose & Overview:\nDevelop, troubleshoot, debug and implement Salesforce.com and Force.com applications. Deliver innovative, high quality solutions to customers. Our Salesforce developer will have strong enterprise business application development. This position will work as part of a development team using rapid development practices.\nResponsibilities & Qualifications:\n Requires a bachelor’s degree (preferably in Computer Science) and 6 – 8 years of IT experience and at least 4 – 5 years of Force.com development experience, with a strong focus on Apex and lightning development. Expertise in lightning aura component development. Web component knowledge preferred. Strong expertise on salesforce point and click tools – Schema Builder, Process Flows, Approval Flows, Visual Work Flows, etc. Strong expertise on salesforce custom development – APEX Classes, APEX triggers, Asynchronous Processing – Batch Apex, Queueable Apex, Future Methods, Scheduled Apex Strong expertise in OOPs concepts and patterns Good Knowledge on Salesforce Application Design Patterns and integration patterns. Experience with integrating salesforce with other systems Experience on various SF products and thorough understanding of their architectures Configuration experience with standard and custom Salesforce objects and fields. Strong Knowledge on web development technologies - HTML, JavaScript, and CSS. Strong oral and written communication skills. Ability to work independently and as part of a team.\nQualifications\nQualifications – External\n Experience in continuous integration and version management tools like GIT hub Salesforce Lightning Web Components knowledge Knowledge on React JS or any JS framework. Salesforce DX Experience with Salesforce Lightning Connect Salesforce Platform Developer 2 Certification",
    "link": "https://www.linkedin.com/jobs/view/3504145426/?eBP=CwEAAAGHHBimMP57ndi2nXDvjQSaYrl53UwEvWRqHTEy3gzeBl_dmn4l_wQrzsnP9pxeuUuj1EnLpbk9-CnlnqRWGsEFo5JcWSZKBLcmzl6TlewcqY147-u01PdNg2sa44EzrzcztfFesUiYMszEbP6L_fRrQKJ2CfRKVKxW23rp7e1iA349yo7yVy8tb5EyInohazcG4pWJ9X1xip8ePyebPJZXclA2mE0nhg7hgAZKm-mCwzysVElaytHJNRyAbdhbhHkZKziv_LveckAfmd3i574NABtYQoNUwQKBwmnMtEVbSqgs1TNXEYdDDk91--CC_kZ449v0kVNScgNjwewk8TbhRMheKvW-5dpA3HF7wqBhUErhPp0IV1Pm&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=fLyDmUUFJQgB792mf067Lw%3D%3D&trackingId=kAif3naVM4WKAg8rNJrqOg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "Entrata India",
    "location": "Pune, Maharashtra, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  If you’re one of the best and brightest, a highly-motivated innovator, a fast worker, and a fierce competitor, you might be just the person we’re looking for! Entrata’s Research and Development department is seeking a Software Engineer. You will spend a lot of time working with senior architects and directors, designing database schema, and laying out the basic code architecture so an offshore team can run with it. You will also be tasked with projects that you will own and see through to completion.\n\nResponsibilities will include:\nWrite well-designed, testable, efficient code Solve technical problems by working closely with Development Managers, UX, Product Managers, and offshore teamsDesigns high-performance database schema and code architecture for their productsEmpower offshore teams to rapidly deliver stable, high-performing, and reliable code. This requires frequent interaction with them by teleconference.Reviews and corrects code for quality and design through constant evaluation of product code and getting involved in complicated or sensitive code.Maintain database queries and write scalable SQL.Contribute in all phases of the development life-cycle (back-end and front-end)Participate in and advocate for Agile and Scrum activities.Prepare and produce releases of software components.Handle high traffic website operations, be proactive with maintenance, and exhibit problem-solving skills to ensure optimal working and performance of the websites.Build interfaces and change existing functionalities and logic of existing code for improvement.Understand standard systems development life-cycle processes and apply agile methodology effectively on client & internal engagements.Apply knowledge of industry trends and developments to improve service to the client and internal project.\n\nMinimum Qualifications:\n1-5 years of development experience (PHP is preferred)Experience working with web-based applications and processesSQL and other database knowledgeStrong written and verbal communicationAmbitious, dedicated, and a little eccentricTeam oriented, willing to standardize code and architecture\n\nPreferred Qualifications:\nBachelor's Degree in Computer Science or related field preferredExperience with microservicesExperience working with offshore teams\n\nNaukri Job URL\n\nhttps://www.naukri.com/job-listings-201222007185\n\nEntrata has been setting the standard for property management technology for nearly 20 years and continues to lead innovation in an industry that provides housing to tens of thousands of apartment communities around the world. People who come to work at Entrata are forward-thinking, hard workers who come together to collaborate and have a good time.\n\nBut members of the Entrata team aren’t just intelligent and ambitious, they’re the living embodiment of another core Value: “Teamwork and Collaboration.” Entrata is dedicated to creating a workplace where a diverse and inclusive team thrives in an environment free from discrimination. We provide equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, protected veteran status, or any other applicable characteristics protected by law.\n\nIt’s a great place to work! Will you join us?",
    "link": "https://www.linkedin.com/jobs/view/3504145426/?eBP=CwEAAAGHHBimMP57ndi2nXDvjQSaYrl53UwEvWRqHTEy3gzeBl_dmn4l_wQrzsnP9pxeuUuj1EnLpbk9-CnlnqRWGsEFo5JcWSZKBLcmzl6TlewcqY147-u01PdNg2sa44EzrzcztfFesUiYMszEbP6L_fRrQKJ2CfRKVKxW23rp7e1iA349yo7yVy8tb5EyInohazcG4pWJ9X1xip8ePyebPJZXclA2mE0nhg7hgAZKm-mCwzysVElaytHJNRyAbdhbhHkZKziv_LveckAfmd3i574NABtYQoNUwQKBwmnMtEVbSqgs1TNXEYdDDk91--CC_kZ449v0kVNScgNjwewk8TbhRMheKvW-5dpA3HF7wqBhUErhPp0IV1Pm&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=fLyDmUUFJQgB792mf067Lw%3D%3D&trackingId=kAif3naVM4WKAg8rNJrqOg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "Protegrity",
    "location": "Mumbai, Maharashtra, India, Remote",
    "description": "About the job\n        \n\n\n        \n                  The global data privacy software market is projected to grow from $2.36 billion in 2022 to $25.85 billion by 2029.\nSo, if you are searching for an innovative career, then the cybersecurity industry might just be the one for you. Protegrity, an international provider of data protection solutions, is looking for new team members who want to make an impact in a company that prioritizes something we all care about: our privacy.\nWe need people who recognize the opportunity, can plan effectively, take action and execute in the enterprise marketplace with our intuitive, diverse, and future-forward global teams.\nSo, are you up for collaborating with the best in data security?\nJoin us on this journey and make an impact with one of the top 25 global software providers. We look forward to making our world become a better place with you on our team.\nApply and discover what’s next today!\nAs a software engineer with Protegrity’s talented product development team you will contribute to cutting-edge research, development and feature design/implementation in a fast-paced Agile environment. This position is perfect for smart technical individuals who enjoy building technology, working in a team of talented engineers and being part of end-to-end product delivery life cycle.\nTo qualify, you should have 3-5 years of relevant experience in developing & integrating scalable solutions. You should be highly versatile with full stack application programming and software application design concepts and aware with the latest trends in technology.\nResponsibilities may include but not be limited to\n Contribute to continuous development, enhancement and maintenance of existing and new products/features Contribute to appropriate software development methods, standards, tools to achieve well engineered outcome. Ability to work independently by applying development practices used by the team/organization including usage of design patterns, frameworks, programming/debugging environments, IDEs etc. Participating in Agile practices of the team/organization as an individual contributor and a team player. Adaptability to learn and enhance skills in the domain of data security alongside the product’s technical environment (like OS, cloud technology, container orchestration, native programming language of the environment, hardware etc.) Ability to review work of peer engineers/juniors alongside being an individual contributor. Excellent collaboration abilities within and across teams for technical requirements and product module dependencies. Ability to be a good team player and soft skilled person.\nIn addition to the qualifications a successful candidate will demonstrate\n 3+ years post-bachelor’s degree experience as software engineer in developing & integrating big data and/or cloud solutions. Knowledge on modern scalable/elastic systems in cloud like Databricks/ HDInisghts/ Dataflow/ Cloudera Data Platform/Big Query/Synapse etc. Any or multiple is desirable. Knowledge of large-scale SQL engines like Hive, Presto, SparkSQL etc. Experience on any or multiple of programming languages like Java/Python/Go/C++ Knowledge of Public Cloud technologies like AWS/GCP/Azure Understanding of containerized platforms like Kubernetes or Openshift Specifying, Designing, implementing and debugging high-performance Big Data and Cloud systems Experience on Linux OS and Shell Scripting Capability to specify, design, implement, debug and profile high-performance web application software. Should be strong at debugging, troubleshooting, profiling own’s code as well as reviewing that of peers. Sufficient knowledge of office productivity tools to represent formal exchange of technical content communication. Excellent verbal and written communication skills along with good rapport and collaboration with teammates within the team.\nGood to have skills -\n Knowledge of operating systems and concepts. Linux & Windows is the preference. Knowledge of creating and operating any multi node cluster like Hadoop. Knowledge of creating and operating any containerized platform like Kubernetes in cloud Knowledge of software performance measurements and tuning Understanding of software security requirements and associated standards like NIST, OWASP, PCI-DSS etc. Has gone through a devops cycle, CI/CD pipelines and software test automations. Knowledge of cryptography and cryptographic algorithms Knowhows of Agile process for product delivery.\nPreferred Qualifications\n Background to computer science and systems Experience on Java & Python programming language Knowledge of Public Cloud technologies like AWS/GCP/Azure Knowledge on modern scalable/elastic systems in cloud like Databricks/ HDInisghts/ Dataflow/ Cloudera Data Platform(CDP)/Big Query/Synapse etc. Any or multiple is desirable.\nWe offer a competitive salary and comprehensive benefits with generous vacation and holiday time off. All employees are also provided access to ongoing learning & development.\nEnsuring a diverse and inclusive workplace is our priority. We are committed to an environment of acceptance where you are free to bring your full self to work. All qualified applicants and current employees will not be discriminated against on the basis of race, color, religion, sex, sexual orientation, gender identity, age, national origin, disability or veteran status.",
    "link": "https://www.linkedin.com/jobs/view/3504145426/?eBP=CwEAAAGHHBimMP57ndi2nXDvjQSaYrl53UwEvWRqHTEy3gzeBl_dmn4l_wQrzsnP9pxeuUuj1EnLpbk9-CnlnqRWGsEFo5JcWSZKBLcmzl6TlewcqY147-u01PdNg2sa44EzrzcztfFesUiYMszEbP6L_fRrQKJ2CfRKVKxW23rp7e1iA349yo7yVy8tb5EyInohazcG4pWJ9X1xip8ePyebPJZXclA2mE0nhg7hgAZKm-mCwzysVElaytHJNRyAbdhbhHkZKziv_LveckAfmd3i574NABtYQoNUwQKBwmnMtEVbSqgs1TNXEYdDDk91--CC_kZ449v0kVNScgNjwewk8TbhRMheKvW-5dpA3HF7wqBhUErhPp0IV1Pm&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=fLyDmUUFJQgB792mf067Lw%3D%3D&trackingId=kAif3naVM4WKAg8rNJrqOg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "Protegrity",
    "location": "Mumbai, Maharashtra, India, Remote",
    "description": "About the job\n        \n\n\n        \n                  The global data privacy software market is projected to grow from $2.36 billion in 2022 to $25.85 billion by 2029.\nSo, if you are searching for an innovative career, then the cybersecurity industry might just be the one for you. Protegrity, an international provider of data protection solutions, is looking for new team members who want to make an impact in a company that prioritizes something we all care about: our privacy.\nWe need people who recognize the opportunity, can plan effectively, take action and execute in the enterprise marketplace with our intuitive, diverse, and future-forward global teams.\nSo, are you up for collaborating with the best in data security?\nJoin us on this journey and make an impact with one of the top 25 global software providers. We look forward to making our world become a better place with you on our team.\nApply and discover what’s next today!\nAs a software engineer with Protegrity’s talented product development team you will contribute to cutting-edge research, development and feature design/implementation in a fast-paced Agile environment. This position is perfect for smart technical individuals who enjoy building technology, working in a team of talented engineers and being part of end-to-end product delivery life cycle.\nTo qualify, you should have 3-5 years of relevant experience in developing & integrating scalable solutions. You should be highly versatile with full stack application programming and software application design concepts and aware with the latest trends in technology.\nResponsibilities may include but not be limited to\n Contribute to continuous development, enhancement and maintenance of existing and new products/features Contribute to appropriate software development methods, standards, tools to achieve well engineered outcome. Ability to work independently by applying development practices used by the team/organization including usage of design patterns, frameworks, programming/debugging environments, IDEs etc. Participating in Agile practices of the team/organization as an individual contributor and a team player. Adaptability to learn and enhance skills in the domain of data security alongside the product’s technical environment (like OS, cloud technology, container orchestration, native programming language of the environment, hardware etc.) Ability to review work of peer engineers/juniors alongside being an individual contributor. Excellent collaboration abilities within and across teams for technical requirements and product module dependencies. Ability to be a good team player and soft skilled person.\nIn addition to the qualifications a successful candidate will demonstrate\n 3+ years post-bachelor’s degree experience as software engineer in developing & integrating big data and/or cloud solutions. Knowledge on modern scalable/elastic systems in cloud like Databricks/ HDInisghts/ Dataflow/ Cloudera Data Platform/Big Query/Synapse etc. Any or multiple is desirable. Knowledge of large-scale SQL engines like Hive, Presto, SparkSQL etc. Experience on any or multiple of programming languages like Java/Python/Go/C++ Knowledge of Public Cloud technologies like AWS/GCP/Azure Understanding of containerized platforms like Kubernetes or Openshift Specifying, Designing, implementing and debugging high-performance Big Data and Cloud systems Experience on Linux OS and Shell Scripting Capability to specify, design, implement, debug and profile high-performance web application software. Should be strong at debugging, troubleshooting, profiling own’s code as well as reviewing that of peers. Sufficient knowledge of office productivity tools to represent formal exchange of technical content communication. Excellent verbal and written communication skills along with good rapport and collaboration with teammates within the team.\nGood to have skills -\n Knowledge of operating systems and concepts. Linux & Windows is the preference. Knowledge of creating and operating any multi node cluster like Hadoop. Knowledge of creating and operating any containerized platform like Kubernetes in cloud Knowledge of software performance measurements and tuning Understanding of software security requirements and associated standards like NIST, OWASP, PCI-DSS etc. Has gone through a devops cycle, CI/CD pipelines and software test automations. Knowledge of cryptography and cryptographic algorithms Knowhows of Agile process for product delivery.\nPreferred Qualifications\n Background to computer science and systems Experience on Java & Python programming language Knowledge of Public Cloud technologies like AWS/GCP/Azure Knowledge on modern scalable/elastic systems in cloud like Databricks/ HDInisghts/ Dataflow/ Cloudera Data Platform(CDP)/Big Query/Synapse etc. Any or multiple is desirable.\nWe offer a competitive salary and comprehensive benefits with generous vacation and holiday time off. All employees are also provided access to ongoing learning & development.\nEnsuring a diverse and inclusive workplace is our priority. We are committed to an environment of acceptance where you are free to bring your full self to work. All qualified applicants and current employees will not be discriminated against on the basis of race, color, religion, sex, sexual orientation, gender identity, age, national origin, disability or veteran status.",
    "link": "https://www.linkedin.com/jobs/view/3504145426/?eBP=CwEAAAGHHBimMP57ndi2nXDvjQSaYrl53UwEvWRqHTEy3gzeBl_dmn4l_wQrzsnP9pxeuUuj1EnLpbk9-CnlnqRWGsEFo5JcWSZKBLcmzl6TlewcqY147-u01PdNg2sa44EzrzcztfFesUiYMszEbP6L_fRrQKJ2CfRKVKxW23rp7e1iA349yo7yVy8tb5EyInohazcG4pWJ9X1xip8ePyebPJZXclA2mE0nhg7hgAZKm-mCwzysVElaytHJNRyAbdhbhHkZKziv_LveckAfmd3i574NABtYQoNUwQKBwmnMtEVbSqgs1TNXEYdDDk91--CC_kZ449v0kVNScgNjwewk8TbhRMheKvW-5dpA3HF7wqBhUErhPp0IV1Pm&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=fLyDmUUFJQgB792mf067Lw%3D%3D&trackingId=kAif3naVM4WKAg8rNJrqOg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer",
    "companyName": "Alcatel-Lucent Enterprise",
    "location": "Bengaluru, Karnataka, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  Job description:We are looking for highly motivated, high-calibre software engineers to become a part of the ALE. The individual will be part of the SW team responsible for the OmniSwitch Series of Switches feature development. Aptitude, Attitude and Ability to learn and Adapt are as important as meeting specific experience criteria. Qualifications:\nSkills:Experience in working with some of the following Standards and protocols in the Enterprise Switching domain- L2: 802.1q (VLAN), 802.1p, 802.1ad (QinQ), Link Aggregation/LACP, 802.1d/w (STP/RSTP), 802.1s (MSTP), Source Learning, Shortest Path Bridging (SPB), MVRP.- OAM: 802.3ah (EFM), 802.1ag (CFM), Y.1731  Knowledge of data-path pipeline processing. Knowledge of Broadcom/Marvell ASICs is a plus.- Very good command over C/C++ and Linux operating system- 3+ years of relevant industry experience- Must have excellent attention to detail and good problem-solving skills\nSocial SkillsAbility to think out-of-the-box and innovate with available software testing tools and librariesAbility to work in a team environment, with a hands-on, proactive attitudeGood written and verbal communication skills\n Education: Bachelor’s Degree in Computer Science/Engineering or equivalent",
    "link": "https://www.linkedin.com/jobs/view/3504145426/?eBP=CwEAAAGHHBimMP57ndi2nXDvjQSaYrl53UwEvWRqHTEy3gzeBl_dmn4l_wQrzsnP9pxeuUuj1EnLpbk9-CnlnqRWGsEFo5JcWSZKBLcmzl6TlewcqY147-u01PdNg2sa44EzrzcztfFesUiYMszEbP6L_fRrQKJ2CfRKVKxW23rp7e1iA349yo7yVy8tb5EyInohazcG4pWJ9X1xip8ePyebPJZXclA2mE0nhg7hgAZKm-mCwzysVElaytHJNRyAbdhbhHkZKziv_LveckAfmd3i574NABtYQoNUwQKBwmnMtEVbSqgs1TNXEYdDDk91--CC_kZ449v0kVNScgNjwewk8TbhRMheKvW-5dpA3HF7wqBhUErhPp0IV1Pm&recommendedFlavor=ACTIVELY_HIRING_COMPANY&refId=fLyDmUUFJQgB792mf067Lw%3D%3D&trackingId=kAif3naVM4WKAg8rNJrqOg%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  }
]