[
  {
    "site": "LinkedIN",
    "title": "Software Engineer (Entry Level)",
    "companyName": "MRI Software",
    "location": "Bangalore Rural, Karnataka, India, ",
    "description": "About the job\n        \n\n\n        \n                  We are currently seeking a Junior Software Engineer to work within our global Product Development department working to apply defined software development life cycle processes to deliver production ready code of the highest quality, this individual will be diligent in testing their code and working with the team to produce\nMRI Software’s high standard product. This individual will work under the Agile development methodology in a cross-functional environment with other groups, both inside and outside the department including Product Management and Documentation, as well as create and test code in our dynamic team setting\nResponsibilities\nApplies defined practices and procedures to design, implement, and support software projectsBuilds effective working relationships with team membersActively seeks assistance as needed but demonstrates learning and growing independenceActively seeks guidance for prioritization and review of deliverables.Performs and designs testing protocols to ensure that the product is fully tested.\nRequirements\nCurrently pursuing a BE, Btech, MCA, MSC, or BCA Computer Science or related technical field (2022 Passout may also apply)Experience developing software or algorithms based on predetermined specificationsKnowledge of object-oriented programming, Microsoft .Net or Java preferredProficient with Source Control tools Familiarity with database objects (tables, stored procedures, queries, etc.) a plusAttention to detail is a mustGood written and verbal communication skills\nBenefits\nAbility to learn leading technical / industry standards and technologiesFlexible working arrangements (2 days in the office)Annual performance-related bonusHealth insurance6x Flexi Fridays: knock 2.5 hours off your day on a FridayEngaging, fun & inclusive culture: check out the MRI Software APAC Insta feed and stories!\nAbout The Business\nMRI Software is a global Proptech leader delivering innovative applications and hosted solutions that free real estate companies to elevate their business. \nOur flexible technology platform, along with an open and connected ecosystem, allows us to meet the unique needs of real estate businesses, from property-level management and accounting, to investment modeling and analytics for the global commercial and residential markets. With nearly five decades of expertise and insight, we have grown to include offices in across the United States, the United Kingdom, Hong Kong, Singapore, Australia, South Africa, New Zealand, Canada, and India, with over 3000 team members to support our clients and their unique needs!\nMRI is proud to be an Equal Employment Opportunity employer.",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=eWWy2PY%2Fy%2BIBfJkUulA0Mg%3D%3D&trackingId=XATO53CUOA%2Faa9pqB8lynA%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Lead I - Software Engineering",
    "companyName": "UST",
    "location": "Kochi, Kerala, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Job Description\n\nRole Proficiency:\n\nAct creatively to develop applications and select appropriate technical options optimizing application development maintenance and performance by employing design patterns and reusing proven solutions account for others' developmental activities\n\nOutcomes\n Interpret the application/feature/component design to develop the same in accordance with specifications.  Code debug test document and communicate product/component/feature development stages.  Validate results with user representatives; integrates and commissions the overall solution Select appropriate technical options for development such as reusing improving or reconfiguration of existing components or creating own solutions Optimises efficiency cost and quality. Influence and improve customer satisfaction Set FAST goals for self/team; provide feedback to FAST goals of team members\nMeasures Of Outcomes\n Adherence to engineering process and standards (coding standards) Adherence to project schedule / timelines Number of technical issues uncovered during the execution of the project Number of defects in the code Number of defects post delivery Number of non compliance issues On time completion of mandatory compliance trainings\nCode\n\nOutputs Expected:\nCode as per designFollow coding standards templates and checklistsReview code – for team and peers\nDocumentation\nCreate/review templates\nchecklists\n\nguidelines\n\nstandards for design/process/developmentCreate/review deliverable documents. Design documentation r and requirements test cases/results\nConfigure\nDefine and govern configuration management planEnsure compliance from the team\nTest\nReview and create unit test cases\nscenarios and executionReview test plan created by testing teamProvide clarifications to the testing team\nDomain Relevance\nAdvise Software Developers on design and development of features and components with a deep understanding of the business problem being addressed for the client.Learn more about the customer domain identifying opportunities to provide valuable addition to customersComplete relevant domain certifications\nManage Project\nManage delivery of modules and/or manage user stories\nManage Defects\nPerform defect RCA and mitigationIdentify defect trends and take proactive measures to improve quality\nEstimate\nCreate and provide input for effort estimation for projects\nManage Knowledge\nConsume and contribute to project related documents\nshare point\n\nlibraries and client universitiesReview the reusable documents created by the team\nRelease\nExecute and monitor release process\nDesign\nContribute to creation of design (HLD\nLLD\n\nSAD)/architecture for Applications/Features/Business Components/Data Models \n\nInterface With Customer\nClarify requirements and provide guidance to development teamPresent design options to customersConduct product demos\nManage Team\nSet FAST goals and provide feedbackUnderstand aspirations of team members and provide guidance opportunities etcEnsure team is engaged in project\nCertifications\nTake relevant domain/technology certification\nSkill Examples\n Explain and communicate the design / development to the customer Perform and evaluate test results against product specifications Break down complex problems into logical components Develop user interfaces business software components  Use data models Estimate time and effort required for developing / debugging features / components Perform and evaluate test in the customer or target environment  Make quick decisions on technical/project related challenges Manage a Team mentor and handle people related issues in team Maintain high motivation levels and positive dynamics in the team. Interface with other teams designers and other parallel practices Set goals for self and team. Provide feedback to team members Create and articulate impactful technical presentations Follow high level of business etiquette in emails and other business communication Drive conference calls with customers addressing customer questions Proactively ask for and offer help Ability to work under pressure determine dependencies risks facilitate planning; handling multiple tasks. Build confidence with customers by meeting the deliverables on time with quality. Estimate time and effort resources required for developing / debugging features / components Make on appropriate utilization of Software / Hardware’s. Strong analytical and problem-solving abilities\nKnowledge Examples\n Appropriate software programs / modules  Functional and technical designing Programming languages – proficient in multiple skill clusters  DBMS Operating Systems and software platforms Software Development Life Cycle Agile – Scrum or Kanban Methods Integrated development environment (IDE)  Rapid application development (RAD) Modelling technology and languages Interface definition languages (IDL)  Knowledge of customer domain and deep understanding of sub domain where problem is solved\nAdditional Comments\n\nKnowledge in Java",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=eWWy2PY%2Fy%2BIBfJkUulA0Mg%3D%3D&trackingId=XATO53CUOA%2Faa9pqB8lynA%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Sr. Java Fullstack Developer",
    "companyName": "Magnit",
    "location": "Bengaluru, Karnataka, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  About the RoleThe position is for building the next generation of our Integrated Workforce Management (IWM) applications utilizing Java, JavaScript and Oracle technologies. Partnering with other top Engineers, Architects, Product Managers & QAs, you will help define, design, and implement world-class SaaS solutions for our customers. Primary Responsibilities· Design & develop next features and functionalities using modern technologies· Enhance existing features & functionalities with better user experience & more efficient implementation· Touch all levels of the technology stack – web front end, application server & database layer· Collaborate with other engineers & participant all technical discussions· Investigate new tools, technologies & apply them appropriately to the tasks on hand· Work closely with product managers & quality assurance engineers to ensure on time product delivery Secondary ResponsibilitiesHelping production support engineers to troubleshoot production issues  Minimum Qualifications · Designed, developed and supported complicated Software Applications for at least 4 years· Proficient in programming with Java, JavaScript, & SQL· Experienced with MVC architecture, Spring framework, Apache, Tomcat, Hibernate/JPA, & Junit, JavaScript frameworks like Angular, React, etc· Good problem-solving skills & quick learner for new concepts & new technologies· Good knowledge of HTML, CSS· Excellent verbal and written communication skills· Attention to detail · Be a motivated self-starter that enjoys working in a dynamic environment· B.S. in Computer Science is required or equivalent experience Preferred Qualifications· M.S. in Computer Science or equivalent experience· Experience building SaaS solutions· Experience working at start-ups or other fast-paced software development environment",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=eWWy2PY%2Fy%2BIBfJkUulA0Mg%3D%3D&trackingId=XATO53CUOA%2Faa9pqB8lynA%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Lead Embedded Engineer",
    "companyName": "HID",
    "location": "Chennai, Tamil Nadu, India, ",
    "description": "About the job\n        \n\n\n        \n                  An Amazing Career Opportunity for a Lead Embedded Engineer!!\n\nChennai, India.\n\nYou are a dynamic, highly skilled, and experienced engineering and technology enthusiast, and enjoy working in an exciting and fast paced growing environment. You excel at communication, collaboration and have solid accounting and compliance knowledge. Leveraging these skills is what you enjoy doing throughout the day. You are a top performer and want to engage with a team who have the same positive energy, integrity, and dedication to the work as you do.\n\n Who are we? \n\nHID Global powers the trusted identities of the world’s people, places, and things, allowing people to transact safely, work productively and travel freely. We are a high-tech software company headquartered in Austin, TX, with over 4,000 worldwide employees. Check us out here: www.hidglobal.com and https://youtu.be/23km5H4K9Eo\n\nAbout HID Global, Chennai\n\nHID Global’s Flagship R&D Center in Chennai hosts 300 employees in a 48000 square foot space dedicated to delivering innovative products and provide an excellent platform for scaling our operations in delivering secure access solutions. Here we deliver cloud-based solutions, web and mobile application development. The Chennai R&D Center is seen as the subject matter expert and talent pool on the latest cloud technologies, logical and physical access systems, data engineering including AI/ML, cryptographic key management systems, and other mobile-based smart card delivery systems.\n\n Specific Responsibilities: \n Contribute as an embedded firmware developer on multiple simultaneous programs and projects  Actively participate as a member of a cross-functional team in order to appropriately plan and schedule programs  Effectively report status, concerns and make recommendations in team meetings  Design and implement embedded firmware and code reviews \nAs our Lead Embedded Engineer, you’ll support success by:\n 8-10 years of experience as an embedded firmware programmer  Strong programming skills in implement projects and providing technical guidance with minimal oversight  Excellent C programming skills  Experience with RTOS as well as state machine based embedded systems.  Software debugging skills, with working knowledge of hardware  Experience in working with any microcontrollers (ARM/MIPS) is a must  In-depth knowledge of ARM microcontroller architecture a plus  Experience in communication protocols like UART, I2C, SPI and USB  Experience on any wireless RF protocols such as BLE will be an added advantage  Ability to use tools like oscilloscope, spectrum analyser and multimeter to debug analog circuits.  Ability to read and understand hardware schematics  Strong written and verbal communication skills  Ability to work cooperatively with other developers, hardware engineers and testers in the development of the system.  Motivated to learn new technologies and programming languages/standards \nProcess Requirements\n Experience in using Git or any similar version control platform  Experience working in Agile Scrum/Kanban teams  Demonstrated ability to follow software development guidelines and processes to generate defect free and efficient code, technical software descriptions, and other artefacts as required by the software development processes. \n Who you are as a Team Member: \n Exceptional communication skills, both written and verbal.  Willingness to ‘roll up sleeves’ and dive deep into tactical work when necessary.  Good interpersonal skills, willingness to learn and continue to grow professionally.  Strong team player and ability to work well with others.  You welcome opportunities to incorporate diversity into your work, including valuing different backgrounds, experiences an \nWhy apply?\n Empowerment: You’ll work as part of a global team in a flexible work environment, learning and enhancing your expertise.  Innovation: You embrace challenges and want to drive ambitious change.  Integrity : You are results-orientated, reliable, and straightforward and value being treated accordingly. \nThis opportunity may be open to flexible working arrangements.\n\nHID is an Equal Opportunity/Affirmative Action Employer – Minority/Female/Disability/Veteran/Gender Identity/Sexual Orientation.\n\nWe make it easier for people to get where they want to go!\n\nOn an average day, think of how many times you tap, twist, tag, push or swipe to get access, find information, connect with others or track something. HID technology is behind billions of interactions, in more than 100 countries. We help you create a verified, trusted identity that can get you where you need to go – without having to think about it.\n\nWhen you join our HID team, you’ll also be part of the ASSA ABLOY Group, the global leader in access solutions. You’ll have 50,000 colleagues in more than 70 different countries. We empower our people to build their career around their aspirations and our ambitions – supporting them with regular feedback, training, and development opportunities. Our colleagues think broadly about where they can make the most impact, and we encourage them to grow their role locally, regionally, or even internationally. As we welcome new people on board, it’s important to us to have diverse, inclusive teams, and we value different perspectives and experiences.",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=eWWy2PY%2Fy%2BIBfJkUulA0Mg%3D%3D&trackingId=XATO53CUOA%2Faa9pqB8lynA%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Application Security Engineer (Bangkok based, relocation provided)",
    "companyName": "Agoda",
    "location": "Lucknow, Uttar Pradesh, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  About Agoda\nAgoda is an online travel booking platform for accommodations, flights, and more. We build and deploy cutting-edge technology that connects travelers with more than 2.5 million accommodations globally. Based in Asia and part of Booking Holdings, our 6,000+ employees representing 90+ nationalities foster a work environment rich in diversity, creativity, and collaboration. We innovate through a culture of experimentation and ownership, enhancing the ability for our customers to experience the world.\nGet to Know our Team: \nThe Security Department oversees security, compliance, GRC, and security operations for all Agoda. We are vigilant in ensuring there is no breach or vulnerability threatening our company or endangering our employees in order to keep Agoda safe and protected. This would be a great challenge for those who want to work with the best technology in a dynamic and advanced environment.\nThe Opportunity:\nYou will be working in a fast paced DevSecOps environment where code change happens at a rapid speed and where it is paramount to control security testing into a continuous deployment/integration flow.\nIn this Role, you’ll get to:\nPlay a lead role in developing and designing application-level security controls and standards. Perform application security design reviews against new products and services. Track and prioritize all security issues. Build internal security tools that help fix security problems at scale. Perform code review and drive remediation of discovered issues. Enable automated security testing at scale to measure vulnerability, and report on risk across all microservice, web and mobile platforms. Execute security tests on thousands of servers which are spread across on-premise and public cloud data centers. \nWhat you’ll Need to Succeed:\nStrong foundations in software engineering. Minimum of 7 years of technical experience with any combination of the following: threat modeling experience, secure coding, identity management and authentication, software development, cryptography, system administration and network security. Minimum 2 years experience with Software Development Life Cycle in one or more languages (Rust, Python, Go, Nodejs, etc.)Minimum 1 year experience with public/private cloud environments (Openshift, Rancher, K8s, AWS, GCP, Azure, etc.)Experience in running assessments using OWASP MASVS and ASVSWorking knowledge on exploiting and fixing application vulnerabilitiesStrong background in threat modelingIn-depth knowledge of common web application vulnerabilities (i.e. OWASP Top 10)Familiarity with automated dynamic scanners, fuzzers, and proxy toolsAn analytical mind for problem solving, abstract thought, and offensive security tacticsHighly effective communication skills, in both verbal and written forms, to effectively convey technical and non-technical concepts to a wide variety of audiences Relocation package is provided in case you prefer to relocate to Bangkok, Thailand. Our benefits are…Hybrid Working ModelWFH Set Up Allowance30 Days of Remote Working from anywhere globally every yearEmployee discount for accommodation globallyGlobal team of 90+ nationalities40+ offices and 25+ countriesAnnual CSR / Volunteer Time offBenevity Subscription for employee donationsVolunteering opportunities globallyFree Headspace subscriptionFree Odilo & Udemy subscriptionsAccess to Employee Assistance Program (third party for personal and workplace support)Enhanced Parental LeaveLife, TPD & Accident Insurance\n#sanfrancisco #sanjose #losangeles #sandiego #oakland #denver #miami #orlando #atlanta #chicago #boston #detroit #newyork #portland #philadelphia #dallas #houston #austin #seattle #sydney #melbourne #perth #toronto #vancouver #montreal #shanghai #beijing #shenzhen #prague #Brno #Ostrava #cairo #alexandria #giza #estonia #paris #berlin #munich #hamburg #stuttgart #cologne #frankfurt #dusseldorf #dortmund #essen #Bremen #leipzig #dresden #hanover #nuremberg #athens #hongkong #budapest #jakarta #bali #dublin #telaviv #jerusalem #milan #rome #venice #florence #naples #turin #palermo #bologna #tokyo #osaka #yokohama #nagoya #okinawa #fukuoka #sapporo #kualalumpur #malta #amsterdam #oslo #manila #warsaw #krakow #bucharest #doha #alrayyan #moscow #saintpetersburg #riyadh #jeddah #mecca #medina #singapore #capetown #johannesburg #seoul #barcelona #madrid #stockholm #zurich #taipei #tainan #taichung #kaohsiung #bangkok #Phuket #istanbul #dubai #abudhabi #sharjah #london #manchester #liverpool #edinburgh #kiev #hcmc #hanoi #amsterdam #bucharest #lodz #wroclaw #poznan #katowice #rio #salvador #newdelhi #Hyderabad #bangalore #Mumbai #Bengaluru #Chennai #Kolkata #Lucknow #bandung #yokohama #nagoya #okinawa #fukuoka #IT #4\nEqual Opportunity Employer \nAt Agoda, we pride ourselves on being a company represented by people of all different backgrounds and orientations. We prioritize attracting diverse talent and cultivating an inclusive environment that encourages collaboration and innovation. Employment at Agoda is based solely on a person’s merit and qualifications. We are committed to providing equal employment opportunity regardless of sex, age, race, color, national origin, religion, marital status, pregnancy, sexual orientation, gender identity, disability, citizenship, veteran or military status, and other legally protected characteristics.\nWe will keep your application on file so that we can consider you for future vacancies and you can always ask to have your details removed from the file. For more details please read our privacy policy .\nTo all recruitment agencies: Agoda does not accept third party resumes. Please do not send resumes to our jobs alias, Agoda employees or any other organization location. Agoda is not responsible for any fees related to unsolicited resumes.",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=eWWy2PY%2Fy%2BIBfJkUulA0Mg%3D%3D&trackingId=XATO53CUOA%2Faa9pqB8lynA%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Liferay Digital Experience Platform Application Developer",
    "companyName": "Accenture in India",
    "location": "Bengaluru, Karnataka, India, ",
    "description": "About the job\n        \n\n\n        \n                  About Accenture: Accenture is a global professional services company with leading capabilities in digital, cloud and security. Combining unmatched experience and specialized skills across more than 40 industries, we offer Strategy and Consulting, Technology and Operations services and Accenture Song-all powered by the world's largest network of Advanced Technology and Intelligent Operations centers. Our 699,000 people deliver on the promise of technology and human ingenuity every day, serving clients in more than 120 countries. We embrace the power of change to create value and shared success for our clients, people, shareholders, partners and communities. Visit us at accenture.com\n\nProject Role :Application Developer\n\nProject Role Description :Design, build and configure applications to meet business process and application requirements.\n\nManagement Level :10\n\nWork Experience :4-6 years\n\nWork location :Bengaluru\n\nMust Have Skills :\n\nGood To Have Skills :\n\nJob Requirements : \n\nKey Responsibilities : Strong Knowledge on installation, implementation, and management of a Liferay platform in multi-server farm installation Understanding of SOA, Business Intelligence, Information Management, Knowledge Management, Integration, portals etc Solid Knowledge and experience on Liferay and Java Tech Landscape including various server products JAVA J2EE Individual will be responsible for writing code in Java and J2EE technologies along with Web Services and methods Individual should have strong skill\n\nTechnical Experience : a: 4 plus Experience in Liferay DXP and portal techPortlets, Layouts, Themses, services b:Java,J2EE, Webservices, Spring framework application development c:Hands-on working knowledge on JAVA J2EE d:Good knowledge on OOPS concepts e:Knowledge on Angular/React JS is added advantage\n\nProfessional Attributes : Strong technical and communication skill\n\nEducational Qualification : Any degree in computer science\n 15 years of full time education",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=eWWy2PY%2Fy%2BIBfJkUulA0Mg%3D%3D&trackingId=XATO53CUOA%2Faa9pqB8lynA%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Software Engineer I",
    "companyName": "Eventbrite",
    "location": "India, Remote",
    "description": "About the job\n        \n\n\n        \n                  THE CHALLENGE\nEventbrite's business continues to grow and scale rapidly, powering millions of events. Event creators and event goers need new tools and technologies that empower them to have the most meaningful live experiences. As a Software Engineer at Eventbrite, you will build beautiful, responsive, delightful and intuitive user interfaces that people are excited to use\nTHE TEAM\nWe're a people-focused Engineering organization: the women and men on our team value working together in small teams to solve big problems, supporting an active culture of mentorship and inclusion, and pushing themselves to learn new things daily. Pair programming, weekly demos, tech talks, and quarterly hackathons are at the core of how we’ve built our team and product. We believe in engaging with the community, regularly hosting free events with some of the top technical speakers, and actively contributing to open source software (check out Britecharts as an example!). Our technology spans across web, mobile, API, big data, machine learning, search, physical point of sale, and scanning systems. To learn more about some of the frontend teamwork, check out our frontend blog\nTHE SKILL SET\nAdvanced English Level1-2 years of experience working in a Software Development role Experience with or the excitement to work with Python and Django web frameworkUnderstanding that great code is also maintainable codeYou care about making sure your code is well testedA result driven self starter with great communication and collaboration skillsUnit-testing know-how required, experience with TDD or BDD is an added bonusKnowledge of front-end technologies (HTML, CSS, Ajax, Javascript)Database experience (ideally MySQL, NoSQLis a plus)OOP/OOD knowledge\nBONUS POINTS\nExperience with AWS and developing APIsExperience using non-relational databasesFamiliarity with Eventbrite and a passion for live events\nWhat We Offer\nAt Eventbrite, we strive to support our Britelings and their loved ones through different stages of life with robust and attractive benefits, financial and physical wellness options, and great perks. In addition to offering a competitive salary and company stock, we have other great benefits available. In the Briteland, you’ll find great medical plans, fertility and adoption benefits, wellness reimbursement, generous parental leave, and much more.\nWe Care About Your Mental Health And Wellbeing.\nOur employees enjoy free coaching sessions with Modern Health. We also offer free therapy sessions with a psychologist. You’ll also have access to private medical insurance for you and your family, that includes dental care. And our wellness program to pay for your gym expenses.\nWe work hard to cultivate a diverse, equitable and inclusive culture where Britelings feel like they belong.\nEmployees can participate in resource groups and we offer programming throughout the year to support a diverse and inclusive workplace.\nWe offer ongoing training and career development that meets people where they are in their careers.\nWe offer unlimited access to courses in Udemy, leadership coaching for all managers, Briteling led talks, and weekly company-wide town halls with our CEO. We take culture seriously and design programs with employee feedback in mind to make Eventbrite a great place to work no matter where you work from in the world.\nWork-life balance & flexibility is extremely important to us.\nOur employees can choose what works best for them: work in one of our offices, be fully remote or the best of both worlds! We believe in a flexible working environment to allow Britelings to perform at their best ensuring a healthy work-life balance. We have recently implemented Britebreak Fridays: all Britelings turn off their computers and take the first Friday of every month off to focus on their wellbeing.\nAbout Eventbrite\nEventbrite is a global self-service ticketing and experience technology platform that serves a community of hundreds of thousands of event creators in nearly 180 countries. Since inception, Eventbrite has been at the center of the experience economy, transforming the way people organize and attend events. The company was founded by Julia Hartz, Kevin Hartz and Renaud Visage, with a vision to build a self-service platform that would make it possible for anyone to create and sell tickets to live experiences. The Eventbrite platform provides an intuitive, secure, and reliable service that enables creators to plan and execute their live and online events, whether it’s an annual culinary festival attracting thousands of foodies, a professional webinar, a weekly yoga workshop or a youth dance class. With over 290 million tickets distributed for over 5 million total events in 2021, Eventbrite is where people all over the world discover new things to do or new ways to do more of what they love. Learn more at www.eventbrite.com .\nIS THIS ROLE NOT AN EXACT FIT?\nSign up to keep in touch and we’ll let you know when we have new positions on our team .\nEventbrite is committed to equality of opportunity for all staff, and applications from all suitably qualified individuals are encouraged, regardless of age, disability, sex, gender reassignment, sexual orientation, pregnancy and maternity, race, religion or belief and marriage and civil partnerships.\nApplicant Privacy Notice",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=eWWy2PY%2Fy%2BIBfJkUulA0Mg%3D%3D&trackingId=XATO53CUOA%2Faa9pqB8lynA%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Expert Software Architect",
    "companyName": "Finastra",
    "location": "Pune, Maharashtra, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  Responsibilities\n\nWhat will you contribute?\n\nReporting to the [Manager Role Name], the [Role Name] will execute, deliver and document Proof of Concept (PoC) work such that it is aligned with a defined PoC framework. The role demands a strong contribution to, and the associated education of, a Patterns & Practices (PnP) repository, including a set of reference implementations and/or libraries, that demonstrate best practices for software development. As a Technical Evangelist of standards, best practices and technology roadmaps the candidate will engage and communicate with a breadth of stakeholders (via seminars, workshops, codefests, hackathons, etc.). The role requires active support of a global Architecture & Development community through evolving collaboration environments and techniques. As a member of the ASTI group you will be a reviewer of, and contributor to, Architecture principles, standards, proposed Product Architecture solutions and an overall R&D Backlog. The candidate will also be responsible for cooperative development of compliant solution architectures for various Finastra initiatives in addition to the identification of the same for adoption of R&D outputs.\n\nResponsibilities & Deliverables:\n\nYour deliverables as a [Role Name] will include, but are not limited to, the following:\nWork with other architects and domain experts to transform emerging technologies and business requirements into implementable software designs and patterns.Research, evaluate, and recommend technology solutions based on the latest technology trends, application capabilities, and best practices.Drive creation of reference architectures and R&D/PoC in conjunction with the many stakeholders (e.g. governance, development teams, product management, etc.) to continuously improve the software development methodology and processes. (continuous)Be cost-conscious to arrive to the right solutions; drive opportunities to reuse, optimize and enhance D+H solutions and approaches to reduce cost of ownership; suggest/design various acceleration tools and techniques to improve our overall software engineering process. (continuous)Provide technical leadership for developing, maintaining and communicating D+H’s technology base (cross domain).Follow, contribute and support overall architecture processes that enable tracking and enforcement of architectural guidelines, practices and policies.Develop and maintain all relevant Architectural documentation, collaboratively with other Architecture stakeholders. Work with development teams to establish and influence best practices for software quality across the organization. (continuous)Act as a technical evangelist and a coach for adopters including approaches, technologies and processes.Collaborate with other technologists to standardize patterns of implementation across domains; works cross functionally consistently and effectively.Perform peer reviews of architecture / design artifacts; review and contribute to Enterprise Architecture standards and documentation; ensure quality, consistency and adherence to D+H enterprise standards (continuous)Serve as a central point to support platform-related architecture and design activities, and provide assistance/ training to other technologists on both emerging technologies and PnP artifacts and their adoption.Analyze and address risk factors in all deliverables, and communicate/propose risk prevention and reduction approaches for adoption while providing architecture, design and assessments. (continuous)\n\nRequired Experience:\n[X] years of progressive experience in a corporate IT environment or a IT consulting company with at least 3 years in a senior role[X] years of experience in building, integrating and delivering large enterprise scale solutions using web based technologies[X] years of experience designing applications[X] years of experience delivering solutions in an agile environment",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=eWWy2PY%2Fy%2BIBfJkUulA0Mg%3D%3D&trackingId=XATO53CUOA%2Faa9pqB8lynA%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer - RCDP",
    "companyName": "Algonomy",
    "location": "Bengaluru, Karnataka, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  Designation: Senior Software Engineer - RCDP Experience: 4 - 6 years Location: Bangalore\nAt Algonomy, we believe the future of our economy is Algorithmic, where businesses will develop resilient, adaptive and agile decisioning abilities that will constantly test and refine AI-driven actions to create the best personal experience for every individual customer at scale.We aim to become the algorithmic bridge between consumers and brands/retailers, and to lead our customers through the Algorithmic transformation imperative. The name Algo-nomy signifies an expertise in algorithms. As technology evolves our lives (and our clients’) at hyper-speed, Algonomy stands as a bold, creative and agile brand; and these are also the very qualities that every digital-first business needs in order to be successful in the new normal. We are ambitious, we create category leading solutions in our markets, and we are constantly learning, inventing and adapting to stay ahead of our industry’s needs.\nPrimary responsibilities: · Develop new feature and functionality meeting the specifications· Suggest solutions to the requirements and collaborate in the design· Design sub-systems and be able to write design documents.· Write clean and optimized code, unit tests, conduct code reviews for the highest quality standards.· Working with rapid and innovative development methodologies like: Kanban, Continuous Integration and Daily deployments Minimum requirements:· B. Tech/M.Tech in Computer Science Engineering or related fields with at least 6 years of experience in related field.· Work experience on micro service based architecture using spring boot is a plus.· Knowledge on AWS that includes ec2, DynamoDB, SQS, S3, lambda etc would be a major Plus.· Strong computer science fundamentals: data structures, algorithms, design patterns.· Expert in back end technologies especially Java and Advanced Java features or any object oriented programming language.· Good Knowledge in messaging systems: Kafka/RabbitMQ/SQS/Kinesis· Working knowledge of SQL and NoSQL database technologies.· Experience in designing and development of the distributed applications is must· Experience working with AWS products and AWS solutions is necessary· Knowledge on unit testing frameworks (Junit, Jest , Spock etc) and code quality control platforms like Sonar.\nAbout Company:Algonomy (previously Manthan-RichRelevance) is a global leader in algorithmic customer engagement powering digital first strategies for retailers and brands. With industry-leading retail expertise in connecting demand to supply with a real-time customer data platform as the foundation, Algonomy enables 1:1 omnichannel personalization, customer journey orchestration and customer analytics with Xen AI at its core.\nGlobally, over 400 retail brands such as HP, L’oreal, Tiffany & Co, Aldi, McDonalds, Zalora and Pizza Hut use Algonomy’s made-for-retail solutions to orchestrate hyper-personalized customer engagement and optimize their merchandising and supplier management. Algonomy, which stands for “systematized knowledge of algorithms”, provides rapid time to value across acquisition, conversion, growth and loyalty with its 300+ pre-built algorithms.\nHeadquartered in San Francisco and Bangalore, our presence spans over 20 countries. To learn more, please visit https://algonomy.com/",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=eWWy2PY%2Fy%2BIBfJkUulA0Mg%3D%3D&trackingId=XATO53CUOA%2Faa9pqB8lynA%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer",
    "companyName": "Light & Wonder",
    "location": "Bengaluru, Karnataka, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Gaming:\nWelcome to the world of land-based gaming. Light & Wonder’s gaming team builds cutting-edge technology, products, and content for the most iconic casinos and operators across the globe.\nPosition Summary\nCompany Profile: (Light & Wonder (lnw.com))\nLight & Wonder (erstwhile Scientific Games) creates technology-based products and content for land-based casino gaming, social and digital organizations worldwide. We are the global leader in cross-platform games and entertainment.\nThrough our amazing game content, technology platforms and Systems applications, we delight our players with what they want, wherever and whenever - be it online, mobile, or at their favourite land-based casino. We are excited to go all in on creating great games and a seamless player experience across all platforms.\nAt Light & Wonder, all our team members are known as Creators. We empower our creators to innovate, create, and bring fun to the workspace. The core principles that unite our team, guide our actions, and drive our growth are\nDare to be bold - We always bring courage to work to reach for the unbelievableCelebrate perspectives - We combine diverse talent to look at the familiar in unfamiliar waysNever settle - We relentlessly push forward to create the extraordinary in every detailUphold integrity - We promote accountability and respect to raise the bar for ourselves and the industry Win as a team - We bring out the best in each other to share collective success\nWe have 5000 creators working across in various regions globally. In India, we are a team of 1400 plus creators sharing the passion to excite our players and customers by creating the world's best game experiences. We strive to walk the walk and show that we are inspiring wonder and building magical worlds with endless possibilities.\nLight & Wonder is committed to offer very competitive benefits that are aligned with our values and inspires employees to drive innovation and contribute to the organization’s performance. Employees are the most valued resources and we always look to improve their well-being with a wide range of benefits befitting every individual. Not limited to monetary benefits, we have robust learning and development opportunities that help them to grow professionally.\nJob Description:\nRoles and Responsibilities:\n Design and develop services and applications to modernize a distributed data acquisition and accounting for a gaming system\nRequirements:\n 3 to 7 years of professional software development experience Good conceptual understanding of OOPS, Data structures, design patterns, RESTful APIs, Web Sockets/Signal R, Multithreading and Micro-services Proficient in programming with C#, .Net Core and ASP.NET. Strong understanding of relational database with MS SQL Server, SSRS reports development. Experience in one of the UI frameworks like Angular/React. Experience with ETL, Database performance tuning, any NoSQL DB, CI/CD, Containerization, and Cloud deployments are added advantages. Knowledge of Agile, professional software development process, and best practices.\nT\nQualifications\nEducation\nBachelors degree in related field.\nYears Of Related Experience\nYears of experience 2 to 5 years\nPhysical Requirements\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is regularly required to sit, stand, walk, bend, use hands, operate a computer, and have specific vision abilities to include close and distance vision, and ability to adjust focus working with computer and business equipment.\nWork Conditions\nScientific Games Corporation and its affiliates (collectively, “SG”) are engaged in highly regulated gaming and lottery businesses. As a result, certain SG employees may, among other things, be required to obtain a gaming or other license(s), undergo background investigations or security checks, or meet certain standards dictated by law, regulation or contracts. In order to ensure SG complies with its regulatory and contractual commitments, as a condition to hiring and continuing to employ its employees, SG requires all of its employees to meet those requirements that are necessary to fulfill their individual roles. As a prerequisite to employment with SG (to the extent permitted by law), you shall be asked to consent to SG conducting a due diligence/background investigation on you.\nThis job description should not be interpreted as all-inclusive; it is intended to identify major responsibilities and requirements of the job. The employee in this position may be requested to perform other job-related tasks and responsibilities than those stated above.\nSG is an Equal Opportunity Employer and does not discriminate against applicants due to race, ethnicity, gender, sexual orientation, veteran status, or on the basis of disability or any other federal, state or local protected class. If you’d like more information, please click on this link: EEO Poster",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=eWWy2PY%2Fy%2BIBfJkUulA0Mg%3D%3D&trackingId=XATO53CUOA%2Faa9pqB8lynA%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer - Backend",
    "companyName": "Vamstar",
    "location": "Hyderabad, Telangana, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  About The RoleWe work in a fast paced work environment and you will be part of every stage of development working multi-functionally with user interface designers, business, frontline teams, development engineers, architects from concept phase to deployment.\nAs the Software Engineer, you will be an integral part of our tight-knit group of dedicated problem solvers. This individual will work closely with the Engineering, Analytics and Design teams and other developers. The ideal candidate brings a breadth of experience in backend development, database schema design, database and experience in tackling scaling issues.\nResponsibilities:Contribute to application architectureDesign database schema for both SQL and NoSQL data storesWrite high quality Typescript codeContribute in organizing the codebase betterReview code contributions from othersImprove build performanceMentor and lead junior developers to ensure deliverables are on time, within budget, and with good code quality.Deliver knowledge sharing sessions on code quality, best practices and latest concepts in Node, Serverless, AWS and backend developmentShip features / stories iterativelyDocument and demonstrate solutions by developing design documentation and other architecture assets.\nWho We’re Looking ForBetween 6 to 12 years of work experience and over 4 years working with Node, Serverless and AWSExtensive experience in SQL and NoSQL database including DynamoDBExcellent time management, multi-tasking and communication.\nAbout VamstarVamstar is a data science powered B2B healthcare marketplace that helps suppliers find the most relevant healthcare contracting leads using Artificial Intelligence (AI). We apply real-time machine learning forecasts, analyze buyers and competitor behaviors, and perform analytics at scale. We are a fast-growing, VC-backed start-up with innovation at our core and winners of several UK Research Grants in collaboration with leading Universities. Read more about us at www.vamstar.ioWhat is one stellar thing that will make you stand out of other applicants for this role?  If you have experience in building marketplace / exchange products, please do share it with us in detail during your interview process.",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=eWWy2PY%2Fy%2BIBfJkUulA0Mg%3D%3D&trackingId=XATO53CUOA%2Faa9pqB8lynA%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer",
    "companyName": "Clarivate",
    "location": "Bengaluru, Karnataka, India, ",
    "description": "About the job\n        \n\n\n        \n                  Join the technology team that supports Clarivate’s Alexander Street product platforms and publishing systems. Alexander Street products are curated, discipline-focused, primary-source collections, websites, and streaming media for learning and research. We’re passionate about creating landmark online resources that help scholars and students discover and learn.\n\nWe are looking for a Senior Software Engineer to join our Alexander Street Technology Team in Bangalore. This is an amazing opportunity to work on the Content Management Systems and product platforms that support Clarivate’s Alexander Street multi-media products. The team consists of 20 people and is reporting to the Director of Technology. We have a great skill set in digital content publishing and we would love to speak with you if you have skills in working with open-source technologies, Python and mySQL.\n\nAbout You – Experience, Education, Skills, And Accomplishments\n\nAt least 5 years of software development experience At least 3 years developing in Python including familiarity with a Python development framework such as Django. At least 3 years of experience working with Relational Databases, preferably mySQL. Proficient in SQL. Experience developing REST APIs. Proficiency with code versioning tools, such as Git. At a minimum, Bachelor’s degree in Computer Science, Computer Engineering, or similar Engineering or Science discipline. \n\nIt would be great if you also had . . . \n\nExperience working in an Agile environment Familiarity with Content Delivery Networks (CDN) Knowledge of Digital Rights Management (DRM) technologies Experience with Cloud architectures and services, AWS ideally Familiarity with audio and video transcoding Experience with XML transformation, XSLT Familiarity with search engines, SOLR or ElasticSearch, and with NoSQL databases, such as DynamoDB Application development experience with PHP and HTML/JavaScript Understanding of digital content publishing workflows \n\nWhat will you be doing in this role?\n\nDeveloping and maintaining the applications and systems that support the workflows of the Content Operations team. This involves the ingestion, indexing, and publishing of digital content (audio, video, text/documents, images) to the Alexander Street product platforms. Will be integral part of project teams in designing and developing solutions around product platform enhancements, and in initiatives to enhance the content management applications and systems. Directly support the Content Operations team in resolving issues and responding to requests for system changes. Collaborate with other technology teams on development projects, working with Scrum Masters and Leads on cross-team initiatives, coordinate testing with QA team, and deployments with Infrastructure and Deployment team. \n\nProduct you will be developing\n\nThe Content Management systems and applications are used by the Content Operations team to ingest digital content and prepare that content for publishing to one of the Alexander Street product platforms at search.alexanderstreet.com and video.alexanderstreet.com. The systems support workflows including creating content metadata, indexing content, processing to prepare for publishing (such as transcoding audio/video content, formatting text and transcript files), and loading to the CDN. Metadata is processed and fed to the product platform databases and search engines.\n\nThe applications and systems involve a variety of technologies including Python and PHP with mySQL databases. Supporting applications also involve Python with some PHP, HTML/JavaScript.\n\nThe content database also interfaces with other systems in providing data to the customer Administration Portal, to the royalty reporting system, and to other content publishers.\n\nAbout The Team\n\nIn working primarily on the Content Management systems, this team is providing direct support to the Content Operations team. As part of the larger organization, this team also works closely with the development team that is responsible for the Alexander Street product platforms as well as other teams that utilize Alexander Street content and data. The team also supports a product platform which shares technology with the indexing system.\n\nHours of Work \n\nThis is a full-time position. The other part of the technology organization is geographically distributed, and work remotely, and generally work core hours of 9AM-4PM EDT. With this position, we plan on having overlap hours in the mornings, EDT time to support the Content Operations team and to attend occasional meetings. We also ask for team members to be available for deployments, roughly scheduled every 3 weeks in the early mornings, 7AM EDT.\n\nAt Clarivate, we are committed to providing equal employment opportunities for all persons with respect to hiring, compensation, promotion, training and other terms, conditions and privileges of employment. We comply with applicable laws and regulations governing non-discrimination in all locations.",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=eWWy2PY%2Fy%2BIBfJkUulA0Mg%3D%3D&trackingId=XATO53CUOA%2Faa9pqB8lynA%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer",
    "companyName": "Clarivate",
    "location": "Bengaluru, Karnataka, India, ",
    "description": "About the job\n        \n\n\n        \n                  Join the technology team that supports Clarivate’s Alexander Street product platforms and publishing systems. Alexander Street products are curated, discipline-focused, primary-source collections, websites, and streaming media for learning and research. We’re passionate about creating landmark online resources that help scholars and students discover and learn.\n\nWe are looking for a Senior Software Engineer to join our Alexander Street Technology Team in Bangalore. This is an amazing opportunity to work on the Content Management Systems and product platforms that support Clarivate’s Alexander Street multi-media products. The team consists of 20 people and is reporting to the Director of Technology. We have a great skill set in digital content publishing and we would love to speak with you if you have skills in working with open-source technologies, Python and mySQL.\n\nAbout You – Experience, Education, Skills, And Accomplishments\n\nAt least 5 years of software development experience At least 3 years developing in Python including familiarity with a Python development framework such as Django. At least 3 years of experience working with Relational Databases, preferably mySQL. Proficient in SQL. Experience developing REST APIs. Proficiency with code versioning tools, such as Git. At a minimum, Bachelor’s degree in Computer Science, Computer Engineering, or similar Engineering or Science discipline. \n\nIt would be great if you also had . . . \n\nExperience working in an Agile environment Familiarity with Content Delivery Networks (CDN) Knowledge of Digital Rights Management (DRM) technologies Experience with Cloud architectures and services, AWS ideally Familiarity with audio and video transcoding Experience with XML transformation, XSLT Familiarity with search engines, SOLR or ElasticSearch, and with NoSQL databases, such as DynamoDB Application development experience with PHP and HTML/JavaScript Understanding of digital content publishing workflows \n\nWhat will you be doing in this role?\n\nDeveloping and maintaining the applications and systems that support the workflows of the Content Operations team. This involves the ingestion, indexing, and publishing of digital content (audio, video, text/documents, images) to the Alexander Street product platforms. Will be integral part of project teams in designing and developing solutions around product platform enhancements, and in initiatives to enhance the content management applications and systems. Directly support the Content Operations team in resolving issues and responding to requests for system changes. Collaborate with other technology teams on development projects, working with Scrum Masters and Leads on cross-team initiatives, coordinate testing with QA team, and deployments with Infrastructure and Deployment team. \n\nProduct you will be developing\n\nThe Content Management systems and applications are used by the Content Operations team to ingest digital content and prepare that content for publishing to one of the Alexander Street product platforms at search.alexanderstreet.com and video.alexanderstreet.com. The systems support workflows including creating content metadata, indexing content, processing to prepare for publishing (such as transcoding audio/video content, formatting text and transcript files), and loading to the CDN. Metadata is processed and fed to the product platform databases and search engines.\n\nThe applications and systems involve a variety of technologies including Python and PHP with mySQL databases. Supporting applications also involve Python with some PHP, HTML/JavaScript.\n\nThe content database also interfaces with other systems in providing data to the customer Administration Portal, to the royalty reporting system, and to other content publishers.\n\nAbout The Team\n\nIn working primarily on the Content Management systems, this team is providing direct support to the Content Operations team. As part of the larger organization, this team also works closely with the development team that is responsible for the Alexander Street product platforms as well as other teams that utilize Alexander Street content and data. The team also supports a product platform which shares technology with the indexing system.\n\nHours of Work \n\nThis is a full-time position. The other part of the technology organization is geographically distributed, and work remotely, and generally work core hours of 9AM-4PM EDT. With this position, we plan on having overlap hours in the mornings, EDT time to support the Content Operations team and to attend occasional meetings. We also ask for team members to be available for deployments, roughly scheduled every 3 weeks in the early mornings, 7AM EDT.\n\nAt Clarivate, we are committed to providing equal employment opportunities for all persons with respect to hiring, compensation, promotion, training and other terms, conditions and privileges of employment. We comply with applicable laws and regulations governing non-discrimination in all locations.",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=eWWy2PY%2Fy%2BIBfJkUulA0Mg%3D%3D&trackingId=XATO53CUOA%2Faa9pqB8lynA%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Lead Software Engineer",
    "companyName": "Epsilon India",
    "location": "Bengaluru, Karnataka, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Company Description\n\nWhen you’re one of us, you get to run with the best. For decades, we’ve been helping marketers from the world’s top brands personalize experiences for millions of people with our cutting-edge technology, solutions and services. Epsilon’s best-in-class identity gives brands a clear, privacy-safe view of their customers, which they can use across our suite of digital media, messaging and loyalty solutions. We process 400+ billion consumer actions each day and hold many patents of proprietary technology, including real-time modeling languages and consumer privacy advancements. Thanks to the work of every employee, Epsilon India is now Great Place to Work-Certified™. Epsilon has also been consistently recognized as industry-leading by Forrester, Adweek and the MRC. Positioned at the core of Publicis Groupe, Epsilon is a global company with more than 8,000 employees around the world. For more information, visit epsilon.com/apac or our LinkedIn page.\n\nJob Description\n\nAbout BU\n\nPowered by the industry’s most advanced loyalty platform, our Loyalty team makes lifetime connections for brands the world over. Focused on platform delivery, the team is equipped with best-in-class technology, unmatched data expertise and identity resolution capabilities. Our connected suite of products and extensive APIs enable us to support any loyalty strategy - from straightforward to the most complex. Our team of passionate loyalty practitioners and leaders love innovating and bringing unique ideas to life\n\nWhy We Are Looking For You\nYou have a strong experience of building products/platforms of scaleYou enjoy new challenges and are solution-oriented.\nWhat You Will Enjoy In This Role\nSolve difficult problems for the client.Bring in innovate solutions .The open and transparent environment that values innovation and efficiency.\nWhat You Will Do\nResponsible to lead complex and highly integrated software systems developed in a fast-paced agile-like development environmentAnalyzes debugs and modifies software enhancementsUsing current programming languages and technologies, writes code, performs testing and debugging of applicationsDevelop documentation throughout the software development life cycle (SDLC)Participate in the review of project deliverables including requirement specifications, functional design documents and technical design documentsCollaborates with technical and non-technical associates to understand user and organizational needs specific to at least one system process or componentCompletes coding using proper coding and quality standardsAnalyze, maintain and track defects for testingInteract with users to define system requirements and/or necessary modificationsParticipate in code reviews providing positive and constructive feedback as well as accept feedback about your own code\nQualifications\nBachelor’s Degree in Science/Engineering8- 12 years of development / Support experience\nEssential Skills And Experience\nGood communication, interpersonal and analytical skillsAbility to articulate technical problems verbally and in written formGood understanding of SQL and SchedulingFamiliarity/Experience with UNIX, LINUX, Windows environmentsAttention to detail, strong listening skills, and good verbal and written communications are requiredAbility to operate effectively, and with a sense of possibility, in a fast-paced, deadline-driven environmentStrong in Core Java & Java EE with Analytical skillExperience in Spring Framework (Core, MVC, REST, Security, Boot) - Any 3 MandatoryExperience in UI tech Angular, React, AJAX, Restful API, JSON, Javascript, CSSShould have working knowledge of RDBMS, SQL, PL/SQL\nDesirable Skills And Experience\nGood time managementEagerness to learn new technologies and domainsDetail oriented and ability to multitaskGood team playerQuick learner in a fast paced and challenging work environmentWorking knowledge in Weblogic Application Server would be preferredKnowledge of Loyalty Platforms and Marketing CampaignsWorking knowledge of Amazon Web Services would be preferredWorking knowledge on Oracle ADF or OSB would be an added advantage Experience on Microservices would be preferredOpen to work in Support / Operations",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=eWWy2PY%2Fy%2BIBfJkUulA0Mg%3D%3D&trackingId=XATO53CUOA%2Faa9pqB8lynA%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Sr. SW Engineer - FM Backend",
    "companyName": "Gigamon",
    "location": "Mylapore, Tamil Nadu, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Description\n\nDescription\n\nThe right candidate will design and develop major components of GigaVUE-FM at Gigamon. Working as part of a growing, dynamic team, the candidate will thrive in a cross-functional team environment to lead and achieve project deliverables and will have the opportunity to make a significant impact to the product lines.\n\nResponsibilities\n design and develop features for GigaVUE-FM to manage physical traffic visibility and analysis and extend it into the virtual environments Work effectively with all stakeholders and engineers throughout the lifecycle of the product to deliver a competitive product on time with the right quality Work with customers and third-parties to understand their requirements/feedback and build features that increase the lead Gigamon has in the market\nRequirements\n BS in CS or related field3 to 5 years of professional experience designing and developing complex software using Java, Spring, NMS/EMS, Hibernate, REST, MongoDB, HBase, OpenTSDB etc., Working knowledge of vSphere API, vCenter and ESXi is a plus Working knowledge of Openstack, Amazon EC2 and other cloud platforms and environments is a plus Excellent communication skills",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=eWWy2PY%2Fy%2BIBfJkUulA0Mg%3D%3D&trackingId=XATO53CUOA%2Faa9pqB8lynA%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Sr. SW Engineer - FM Backend",
    "companyName": "Gigamon",
    "location": "Mylapore, Tamil Nadu, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Description\n\nDescription\n\nThe right candidate will design and develop major components of GigaVUE-FM at Gigamon. Working as part of a growing, dynamic team, the candidate will thrive in a cross-functional team environment to lead and achieve project deliverables and will have the opportunity to make a significant impact to the product lines.\n\nResponsibilities\n design and develop features for GigaVUE-FM to manage physical traffic visibility and analysis and extend it into the virtual environments Work effectively with all stakeholders and engineers throughout the lifecycle of the product to deliver a competitive product on time with the right quality Work with customers and third-parties to understand their requirements/feedback and build features that increase the lead Gigamon has in the market\nRequirements\n BS in CS or related field3 to 5 years of professional experience designing and developing complex software using Java, Spring, NMS/EMS, Hibernate, REST, MongoDB, HBase, OpenTSDB etc., Working knowledge of vSphere API, vCenter and ESXi is a plus Working knowledge of Openstack, Amazon EC2 and other cloud platforms and environments is a plus Excellent communication skills",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=eWWy2PY%2Fy%2BIBfJkUulA0Mg%3D%3D&trackingId=XATO53CUOA%2Faa9pqB8lynA%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer",
    "companyName": "Equiniti",
    "location": "Chennai, Tamil Nadu, India, On-site",
    "description": "About the job\n        \n\n\n        \n                  Management Level\n\nG\n\nAbout Organization:\nEQ is a leading international provider of shareholder, pension, remediation and credit technology. With over 5,000 employees across UK, US, India and Poland, it supports 37 Million people in 120 countries. EQ’s purpose is to care for every customer and simplify every transaction, delivered with less of an impact on the environment. EQ’ vision is to be the leading global share registrar, offering complementary services to its client base. Equiniti is a company that has been built with strong values at the very core of our offering. Dealing with some of the most successful companies and government agencies, excellence, integrity, professionalism, partnership, commercial and innovation are therefore at the heart of everything we do. \n\nCore Duties/Responsibilities\nWill work as part of a global team working US hours, in the on-going maintenance of complex enterprise solutions, supporting UK operations and servicesWill be assigned specific responsibilities typically including, but not limited to:Handle production incidents and service requests by proactively seeking information and undergo proper RCA of the issue and provide resolutions to issues. Should have a good analytical and problem-solving skills. Ensure SLA Compliance & meeting of KPIsReporting of status to offshore stakeholdersLiaise with onshore and offshore resources on Technical/Functional issues and queries. Should understand and act based on the SOP, functional design and technical design documentsShould be a team player with good interpersonal skills and a drive to take ownership of and responsibility for the tasks assigned to you. Can rapidly absorb new technical information and apply it effectively. Highly flexible, including willingness to work away from home base and out of hours. A good team player capable of delivering results as part of a team spanning multiple sites. Should strictly follow the Equiniti coding standardDeliver the assigned tasks on time with expected quality and not allowing impediments to delay delivery. \n\nSkills, Knowledge & Experience\nBE/ME/MCA/M.Sc. Computer Science with excellent track record. Should have an overall 4+ years of experience in developing application on Microsoft .Net platform using C#. Should be a team player with good interpersonal skills and a drive to take ownership of and responsibility for the tasks assigned to you. Should exhibit leadership qualities and preferably led a team of some size. Should have appropriate level of expertise of using several of the following technologies:.Net Framework 4.5 or higherWCF / Web ServicesSQL Server 2019Microsoft Visual Studio 2019Azure Dev Ops (Team Foundation Server)Knowledge of Design PatternsMCAD / MCTS / MCPD CertificationAble to work under general direction within a clear framework of accountability. Able to deliver work that meets the time and quality targets. \n\nEQ India Benefits\n\nBeing a permanent member of the team at EQ you will be rewarded by our company benefits, these are just a few of what is on offer:\n31 days + 8 bank holidays (UK)Comprehensive Medical & Life Assurance coverMaternity leave of 6 months full pay, 10days paid paternity leaveLong Term Incentive Plan(LTIP) for all colleaguesAccidental & Life cover 3 times of concerned CTC\n\nWe are committed to equality of opportunity for all staff and applications from individuals are encouraged regardless of age, disability, sex, gender reassignment, sexual orientation, pregnancy and maternity, race, religion or belief and marriage and civil partnerships. Please note any offer of employment is subject to satisfactory pre-employment screening checks.",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=eWWy2PY%2Fy%2BIBfJkUulA0Mg%3D%3D&trackingId=XATO53CUOA%2Faa9pqB8lynA%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer- Autosar",
    "companyName": "ZF Group",
    "location": "Chennai, Tamil Nadu, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  Job description:\n\nYour Task:\n\n Analyze system requirements and derive software requirements Ensure categorization and traceability of requirements at all levels, Develop requirements, design, coding complying with coding guidelines Implement AUTOSAR configuration (Vector DaVinci or EB tools). Configure the CAN Communication Stack, Diagnostic Stack, Mem/NVM Stack Take accountability and interact with different stake holders on demand Adherence to all SW processes including QAC, Polyspace, Code inspections, unit testing and developer testing  \n\n\n\nProfile description:\n\n \n\nYour Profile:\n\n Degree in Engineering with 5+ years of experience in automotive and with minimum 3+ years of experience in cybersecurity Infineon TriCore microcontrollers (Aurix 1G/2G) T38X/TC3XX Architecture. Strong in Embedded C, Vector DaVinci tools, Vector CAN tools (CANoE, CANanalyser, CANape), Automotive Experience Experience in AUTOSAR BSW packages (COM, DCM, MemStack -J1939 TP, DiagOBD, NM, PDU Router, CANIF, DEM, FIM, COM-M, NVRAM Manager, MEMIF, EEP Abstraction etc) Microcontroller peripherals - PORT, PWM, ADC, DAC, DMA, CCU, GTM, FEE and SMU. Communication protocols SPI, I2C, CAN/FD.  \n\n\n\nWe offer:\n\nZF offers diverse opportunities to help you advance in your career. With a variety of jobs in the fields of research and development, you can be part of a global technology company. At ZF, you will have the opportunity to work at the forefront of automotive innovation and shape the next generation of mobility. ZF offers diverse and interesting possibilities in many fields of work!",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=eWWy2PY%2Fy%2BIBfJkUulA0Mg%3D%3D&trackingId=XATO53CUOA%2Faa9pqB8lynA%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer- Autosar",
    "companyName": "ZF Group",
    "location": "Chennai, Tamil Nadu, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  Job description:\n\nYour Task:\n\n Analyze system requirements and derive software requirements Ensure categorization and traceability of requirements at all levels, Develop requirements, design, coding complying with coding guidelines Implement AUTOSAR configuration (Vector DaVinci or EB tools). Configure the CAN Communication Stack, Diagnostic Stack, Mem/NVM Stack Take accountability and interact with different stake holders on demand Adherence to all SW processes including QAC, Polyspace, Code inspections, unit testing and developer testing  \n\n\n\nProfile description:\n\n \n\nYour Profile:\n\n Degree in Engineering with 5+ years of experience in automotive and with minimum 3+ years of experience in cybersecurity Infineon TriCore microcontrollers (Aurix 1G/2G) T38X/TC3XX Architecture. Strong in Embedded C, Vector DaVinci tools, Vector CAN tools (CANoE, CANanalyser, CANape), Automotive Experience Experience in AUTOSAR BSW packages (COM, DCM, MemStack -J1939 TP, DiagOBD, NM, PDU Router, CANIF, DEM, FIM, COM-M, NVRAM Manager, MEMIF, EEP Abstraction etc) Microcontroller peripherals - PORT, PWM, ADC, DAC, DMA, CCU, GTM, FEE and SMU. Communication protocols SPI, I2C, CAN/FD.  \n\n\n\nWe offer:\n\nZF offers diverse opportunities to help you advance in your career. With a variety of jobs in the fields of research and development, you can be part of a global technology company. At ZF, you will have the opportunity to work at the forefront of automotive innovation and shape the next generation of mobility. ZF offers diverse and interesting possibilities in many fields of work!",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=eWWy2PY%2Fy%2BIBfJkUulA0Mg%3D%3D&trackingId=XATO53CUOA%2Faa9pqB8lynA%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer",
    "companyName": "Quorum Software",
    "location": "Pune, Maharashtra, India, Hybrid",
    "description": "About the job\n        \n\n\n        \n                  Location: Pune, India \n\nModel of Work: Remote/Hybrid\n\nAbout Quorum Software\n\nQuorum Software connects people and information across the energy value chain. Twenty years ago, we built the first software for gas plant accountants. Pipeline operators came next, followed by land administrators, pumpers, and planners. Since 1998, Quorum has helped thousands of energy workers with business workflows that optimize profitability and growth. Our vision for the future connects the global energy ecosystem through cloud-first software, data standards, and integration. The trusted source of decision-ready data for 1,800+ companies, Quorum Software makes the essential connections that let us work better together in the connected energy workplace. For more information, visit quorumsoftware.com\n\nBe a part of our legacy\n\nQuorum Software is the world's largest provider of digital technology focused solely on business workflows that empower the next evolution of energy. From emerging companies to supermajors, throughout every region of the globe, customers rely on Quorum's proven innovation and unmatched global expertise to streamline business operations and make data-driven decisions that optimize profitability and growth. Our industry-leading solutions are transforming energy companies across the entire value chain, helping visionary leaders evolve their organizations into modern energy companies.\n\nWho We Are Looking For\n\nAre you excited by challenges? Do you enjoy working in a fast-paced, international and dynamic environment? Then now is the time to join Quorum Software, a rapidly growing company and industry leader in oil & gas transformation.\n\nJob Purpose\n\nWe are looking for a Exago Developer to work at an intermediate level position in our Enterprise Business Intelligence Engineering team to maintain and enhance our existing Exago integration within our Enterprise Applications, Exago reports, and deployment processes. This position requires knowledge Exago as well as full stack .Net development to a lesser extent. Solid understanding of Exago areas such as installations, administrations, configurations, report development, report maintenance/troubleshooting is a must. Knowledge of .net development is also preferred. The overall objective of this role is to contribute to Business Intelligence Engineering team maintenance and development and activities.\n\nWhat You Will Do\nInstallation, configuration and maintenance of Exago Server in the CloudDevelopment, maintenance, and troubleshooting Exago reportsSolid understanding of Exago extensions to access, extend and modify the platform’s capabilities to suit our needsIntegrating Exago into Quorum products and meet products’ reporting requirementsMaintaining and enhancing Quorum’s Exago integration librariesBe deeply involved in the development of Quorum personnel, including mentorship, training, and possibly directing and being accountable for the work of othersAnd other duties as assigned.\n\nWhat To Bring4 – 6+ years in software developmentDemonstrated leadership and ability to work as a leader on large and complex tasksDemonstrate a solid understanding of software development methodologies and how they apply to your teamKnowledge and experience with different versions of Exago Experience with installation and configuration and administrations of ExagoKnowledge of implementing multitenancy would be helpful Good understanding of the nuts and bolts of Exago’s security modelGood troubleshooting skillsSolid SQL skills both in terms of scripting and writing complex queriesDevelopment Experience working in Agile environmentDevelopment requirements Object-Oriented Programming (C# preferred).Net Framework/ASP.NET Core/.NET developmentPowerShell scriptingSource controlTechnical DocumentationRelational Databases (MS SQL, Oracle)Front End Development (HTML/CSS/JS)\nNice To Have\nAttention to detailFlexibility, willingness to learnGood written and verbal communicationAzure DevOps release definitions and task groupsAzure DevOps build pipelinesGitflow branching strategy (Quorum standard)Unit TestingIIS Web Server Administration\n\nAdditional Details\nVisa Sponsorship: Employment eligibility to work with Quorum Software in India is required as the company will not pursue visa sponsorship for this position.\n\nDiversity Statement: At Quorum, we are committed to fostering, cultivating and preserving a culture of diversity, equity and inclusion. We want to be the place where a diverse pool of talented people join us, stay with us and do their best work. With a diverse team of employees, we grow and learn better together. The collective sum of the individual differences, life experiences, knowledge, innovation, self-expression, and talent that our employees invest in their work represents not only part of our culture, but our reputation and our achievements. We are fully focused on equality and believe deeply in diversity of race, gender, sexual orientation, religion, ethnicity, national origin and all the other characteristics that make us unique. We have a DEI committee focused on Culture, Advocacy and Talent, have company-wide Unconscious Bias training and more.",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=eWWy2PY%2Fy%2BIBfJkUulA0Mg%3D%3D&trackingId=XATO53CUOA%2Faa9pqB8lynA%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  },
  {
    "site": "LinkedIN",
    "title": "Senior Software Engineer",
    "companyName": "FactSet",
    "location": "Hyderabad, Telangana, India, ",
    "description": "About the job\n        \n\n\n        \n                  Role/Department Description:\n\nResponsibilities:\nContribute new features, fixes, and refactors to the Orders applicationPerform code reviews and coach engineers with respect to best practicesThink and communicate critically about architecture, design, and best practicesCollaborate with other engineers and Product Developers in a Scrum Agile environment using Jira and ConfluenceEstimate task sizes and regularly communicate progress in daily standups and Scrum meetingsCoordinate with other teams across offices and departments\n\nRequired Skills:\nBachelor’s degree requiredStrong technical, analytical, troubleshooting, and communication skillsExperience with .Net, C#, JavascriptExperience building and deploying production level services",
    "link": "https://www.linkedin.com/jobs/view/3531971903/?eBP=JOB_SEARCH_ORGANIC&recommendedFlavor=SCHOOL_RECRUIT&refId=eWWy2PY%2Fy%2BIBfJkUulA0Mg%3D%3D&trackingId=XATO53CUOA%2Faa9pqB8lynA%3D%3D&trk=flagship3_search_srp_jobs",
    "stipend": "Not disclosed"
  }
]